[
    {
        "id_": "34188fc0-5e06-49ba-8139-efca93f9a6bf",
        "text": "# 1. INTRODUCTION\n\nModern Searches for Extraterrestrial Intelligence (SETI) tend to focus on trying to detect unnaturally narrowband radio transmission. In natural radio science contexts, this can mean signals over frequency ranges less than &gt;100 kHz, but in a SETI context narrowband usually means signals with widths measured in Hz (n.b. some SETI work does focus on broader signals, e.g. Gajjar et al. 2022; Suresh et al. 2023, and the tools we use here are sensitive to these signals as well). While some terrestrial digital communication applications often opt for the higher data transmission rates of broadband modulation schemes, narrowband signals are useful as carrier waves for low signal-to-noise (SNR) cases, making it easy to find and lock onto a signal Doppler-drifting through frequency space, particularly in the case of our deep space probes like Voyager (Derrick & Isaacson 2023a). In the limits of our sensitivity to interstellar radio transmission, for a given transmitter power, such narrowband signals offer the best possibility of detection.\n\nSufficiently powerful narrowband signals also have the potential to address ambiguous interpretations. Humans have developed technology to produce much narrower radio transmissions (↭ 1 Hz) than natural astrophysical processes, suggesting that non-human sources of such signals must be artificially constructed by some biologically derived entity. The search for radio technosignatures is motivated by the fact that modern radio receivers on Earth can detect signals produced by the largest modern-day transmitters over interstellar distances (Cocconi & Morrison 1959). However, disentangling such distantly sourced signals from signals of anthropogenic origin can be tricky, particularly as more of the radio spectrum is being utilized for various terrestrial communication purposes. Ever since the very first Search for Extraterrestrial Intelligence (SETI) project, parsing out radio frequency interference (RFI) has been a significant problem (Drake 1961). Indeed, a major component of most modern radio SETI projects include both observational and data analysis strategies for RFI mitigation (Tarter 2001).\n\nThe standard observational strategy for single-dish radio SETI is to employ an on/off nodding cadence, in an attempt to discriminate persistent signals localized to a particular source (Lebofsky et al. 2019). However, radio arrays such as the Allen Telescope Array (ATA) employ interferometric techniques to combine the data from each dish in a wide field of view. Beamforming —the interferometric addition of signals from many elements to form tight synthetic beams within the primary field of view— can be used to synthesize many simultaneous, smaller and spatially separated beams, which provides a similar effect to the on/off nodding cadence without having to slew away from the target. This is the primary observational strategy employed at the ATA to distinguish RFI from sky-localized astrophysical signals (Harp 2005).\n\nThe newly upgraded ATA was originally designed and recently upgraded with SETI in mind as the primary scientific driver (Sheikh et al. 2023a). The main focus of the"
    },
    {
        "id_": "63c51b6f-4a5c-4722-8e1b-a2184c9a367d",
        "text": "# A n ATA S E T I S e a rc h o f T R A P P I S T - 1"
    },
    {
        "id_": "f839d660-38cc-4008-8a1b-6d36e0bb2059",
        "text": "# 3\n\nThe research presented in this paper was to build a generalized pipeline for analyzing the SETI data products at the ATA and then apply it to a specific SETI observation. The TRAPPIST-1 system was selected as the primary science target for observation. Since the publication of its discovery in 2016 (Gillon et al. 2016), TRAPPIST-1 has provided an intriguing case study for exoplanet science. The star is a cool M-dwarf—the most abundant spectral type of star—and currently one of the best prospects for detecting and characterizing orbiting terrestrial-sized planets with solid surfaces due to the relative masses and radii between the star and these kinds of planets. Such stars, particularly later M-dwarfs, have very low luminosities that are difficult to observe at large distances. But the proximity of TRAPPIST-1, at approximately 12.5 parsecs, allows extremely precise measurements of the system’s characteristics (Agol et al. 2021).\n\nThe TRAPPIST-1 system is almost perfectly edge-on from our line of sight, hosting seven known transiting planets. The planets are evenly spaced and in orbital resonance, with planets d, e, f and g spanning the extreme limits where liquid water could theoretically exist on a planetary surface given stellar irradiance and a sufficiently thick atmosphere (Hill et al. 2023). Much work has been done to determine the system’s viability for biological development (Turbet et al. 2020; Krissansen-Totton 2023; Gillon 2024).\n\nThe precisely measured orbital characteristics of this compact multi-planet system suggest that the system is so close to edge-on that several planets may occult each other in what is called a planet-planet occultation (PPO). There are many nearby multi-planet nearly co-planar systems that may exhibit PPOs, but the TRAPPIST-1 system is unique among these in how well constrained its many planets’ orbital parameters are and how closely aligned they all are. The TRAPPIST-1 system is the perfect laboratory to both predict and potentially observe PPOs. Photometrically observing PPOs outside of transit is at the cusp of our technological capability, and it could be a useful observational tool in the near future (Luger et al. 2017).\n\nEven without being able to directly observe PPOs, these events may be critical observation windows for SETI if accurately predicted. On Earth, the Deep Space Network (DSN) is frequently used to transmit and receive radio signals between ground stations and the artificial probes on and around other planetary bodies in the solar system (Mudgway 2000). The beams of transmitted signals are often powerful and wide enough to wash over their target and propagate out into deep space, where they could be received with a serendipitously aligned receiver. Similarly, by definition, Earth is favorably aligned to receive powerful signals transmitted from one planetary body and washing over another during a PPO event. For 2 of the 7 PPO events found in this work, the transmission source planet is within the system’s habitable zone (Gillon 2024). But sources of leaked transmission are not necessarily limited to planets in the habitable zone. Satellites or ground-based relays on uninhabited worlds could be set up and used to communicate for reasons not limited to our own orbiters and rovers on other planets within the solar system. If powerful transmissions are being sent between planetary bodies during these events, wide enough to not be entirely..."
    },
    {
        "id_": "6b5fdd83-a2a0-4c0e-8d58-e79c59b33207",
        "text": "# 4\n\nblocked by their intended target and catching the Earth within the opening angle of the propagating beam, this unintentionally “leaked” radio emission can be detected as a technosignature (Siemion et al. 2013; Wright 2021).\n\nThe purpose of this paper is to:\n\n1. Report the results of a search for narrowband radio technosignatures from the TRAPPIST-1 system.\n2. Demonstrate an application of the PPO method to observational data.\n3. Describe the application of and current state of the NbeamAnalysis pipeline.\n\nWe used the newly upgraded Allen Telescope Array (ATA) at the Hat Creek Radio Observatory (HCRO), to observe the TRAPPIST-1 system for 28 hours from 0.9 to 9.3 GHz. We subsequently analyzed the data for narrowband radio technosignatures over the entire data set and then more closely examined it during predicted PPO events within the observational windows. The details of the observations are discussed in §2. The pipeline created to analyze the data is detailed in §3. The results of the analysis are highlighted in §4. And finally, §5 concludes with a discussion of the project and future work."
    },
    {
        "id_": "1e96d402-1d57-4a12-9909-5771a48902a6",
        "text": "# 2. OBSERVATIONS AND DATA\n\nThe ATA is a 42-element radio interferometer located in Hat Creek, California at the Hat Creek Radio Observatory (HCRO). It is comprised of 6.1 m offset Gregorian antennas, and is currently in the process of being upgraded with new “Antonio” feeds: dual-polarization log-periodic feeds which are sensitive from 1–11 GHz and cryogenically-cooled to 70 K. The analog signals from the dishes are sent to the HCRO signal processing room over optical fiber, where they are mixed with four local oscillators (LOs) to produce four independently-tuned signal chains. After digitization (and fringe rotation and phase centering to the center of the primary beam), the signals are ingested by the digital signal processing backend, which provides a correlator, for imaging and beamformer calibration, and a beamformer.\n\nFor this project, signals from 20 dishes were digitized by RFSoC boards using two tunings, leading to the ability to record two 672 MHz tunings simultaneously. The beamformer was configured to create two spatially separated beams within the primary field of view, the on-beam placed at phase-center of the array and centered on the target, and the off-beam fixed at a constant 9 arcminutes away, producing high-frequency resolution filterbank data files for each beam (Lorimer 2011). The FWHM of the tied beam varies from → 3 arcminutes at the bottom part of the observed frequency band, to → 0.5 arcminutes at the top part. This corresponds to a separation of → 3 ↑ 18↓ FWHM between the on and off-beams, and an attenuation of at least 10 dB between them according to beam-pattern measurements. The entire"
    },
    {
        "id_": "6615dbe5-5557-4280-ad60-0bd4e63bf83b",
        "text": "# A n ATA S E T I S e a rc h o f T R A P P I S T - 1"
    },
    {
        "id_": "d37d36c7-1185-4937-8787-b354175f755a",
        "text": "# 5\n\nFigure 1. Frequency coverage (x-axis) by day (y-axis) of the TRAPPIST-1 system observations using the Allen Telescope Array at Hat Creek Radio Observatory in Fall 2022. The standard radio frequency bands are shaded in the background and labeled. These observations covered a continuous 0.9–9.3 GHz in radio frequency, over two weeks in October–November 2022.\n\nThe frequency range of the data was recorded in this way over 8 compute nodes with a coarse channel size of 0.5 MHz, a narrow channel resolution of 1 Hz and binned to 16 s over every integration, yielding a total data volume of 65 TB. The ATA RFSoC boards perform the coarse channelization using a polyphase filterbank before streaming the channlized voltages to the acquisition servers. Fine channelization is achieved by running a GPU-accelerated real-time →500k-point FFT on the data acquisition servers.\n\nThe ATA was used to search the TRAPPIST-1 system for narrowband radio emission over the dates and tunings shown in Table 1 and Figure 1. Each observation was conducted in 10 minute integrations for a total of 240 minutes per frequency band, one of which had to be broken up between 2 different observation days to be completed. These are treated separately in the analysis to account for temporal differences in the RFI environment."
    },
    {
        "id_": "4d7f91e4-0025-45e2-907c-b3c34543c156",
        "text": "# 2022 ATA Observations of TRAPPIST-1\n\n|Date (UTC)|Ranges (GHz)|Duration|Frequency|Total Hits|PPO Events|Event Duration|PPO Hits|Dish Diameter|Transmitter Power Range|EIRP|\n|---|---|---|---|---|---|---|---|---|---|---|\n|Oct 27, 2022|6.3 - 6.9 & 8.1 - 8.7|200 min|6767|de|23.0 min|38|3.4 cm|0.023 - 0.72 GW|2.17 - 69.1 TW| |\n|Oct 28, 2022|0.9 - 2.1|240 min|2167448|cf, cd|54.7 min|812|5.89 m|0.15 - 2.43 GW|2.55 - 40.8 TW| |\n| | | | | |77.8 min|694|3.4 m|0.46 - 7.29 GW| | |\n|Oct 29, 2022|2.1 - 3.3|240 min|774082|ge, dfb|95.0 min|537|4.81 m|0.15 - 3.32 GW|4.12 - 91.7 TW| |\n|Oct 30, 2022|3.3 - 4.5|240 min|3187921|gb|60.5 min|358|7.6 m|0.065 - 1.48 GW|8.40 - 190 TW| |\n|Nov 01, 2022|6.3 - 6.9 & 8.1 - 8.7|40 min|1147|-|-|-|-|-|4.28 - 137 TW| |\n|Nov 02, 2022|4.5 - 5.7|240 min|27903|hd|37.4 min|21|6.8 m|0.018 - 0.57 GW|2.9 - 92.8 TW| |\n|Nov 05, 2022|5.7 - 6.3 & 6.9 - 7.5|240 min|24422|bc|8.6 min|7|3.4 cm|0.090 - 2.88 GW|6.45 - 207 TW| |\n|Nov 09, 2022|7.5 - 8.1 & 8.7 - 9.3|240 min|5157|-|-|-|-|-|13.3 - 421 TW| |\n\nTotal: 0.9 ↑9.3 GHz, 28 h, 6194847, 7, 6.0 h, 2467, -, -, 2.17 - 421 TW\n\na The number of signals detected by turboSETI utilizing frequency scrunching and subsequently surviving spatial filtering across beam-formed beams.\n\nb This potential event was not counted, though a slightly smaller dish would have created a wider beam that would have triggered an event, as explained in §3.3.\n\nc The assumed dish diameter in these events is larger than the smallest dish needed in the most extreme misalignment scenario due to uncertainties described in §3.3 and illustrated in Figure 9. However, it is much smaller than the smallest dish needed in the most favorable alignment of the extreme case, and these events occur at less geometrically extreme orbital positions."
    },
    {
        "id_": "543f77c2-dd95-43b6-921d-6a7525362ac4",
        "text": "# 3. DATA ANALYSIS"
    },
    {
        "id_": "9d9b706f-c108-49f6-95bb-8ed87a545514",
        "text": "# 3.1. Signal Detection with turboSETI\n\nThe tree de-Doppler algorithm from turboSETI, an open-source software package developed by Breakthrough Listen (Enriquez et al. 2017), is the primary publicly available tool currently being used to search for drifting narrowband signals in high-frequency resolution filterbank data. We applied the algorithm to the TRAPPIST-1 data to identify signals or hits in both beams above a signal to noise ratio (SNR) of 10. Figure 2 shows diagnostic histograms for all of the signals detected over all."
    },
    {
        "id_": "cca5ccd5-267f-4b1b-ac39-f9b5bfafeb89",
        "text": "# A n ATA S E T I S e a rc h o f T R A P P I S T - 1"
    },
    {
        "id_": "2669d90b-6afd-45c5-beb5-5a3ca4d96790",
        "text": "# ALL obs"
    },
    {
        "id_": "2b0f4686-99e6-4d9a-8dab-e8f5c2ae04e0",
        "text": "# SNR Distribution"
    },
    {
        "id_": "17e19e25-0871-48b3-80c4-ee2296887920",
        "text": "# Frequency Distribution"
    },
    {
        "id_": "f1b0a42a-478c-400d-b30c-df7507ddd241",
        "text": "# Drift Rate Distribution\n\n|SNR|Frequency (GHz)|Drift Rate (nHz)|\n|---|---|---|\n|200|600|1000|\n|2000|40|6000|\n|8000| | |\n\nFigure 2. Distributions of the relevant signal parameters from all 8 observations combined. The SNR is truncated at 1000 for readability, but the data extends out several orders of magnitude, up to a maximum of 1.15 × 107 for a few (→1% of the data) powerful nearby signals. Most signals were detected at lower frequencies where the major bands are known to be more crowded with RFI. The drift rate distribution extends beyond the target maximum of 15 nHz due to bin doubling during the “frequency scrunching” process, but is still strongly clustered around 0 nHz due to an abundance of terrestrial RFI.\n\nThe observations covered different frequency ranges, leading to widely-varying RFI environments and, thus, numbers of hits. Unsurprisingly, the lower frequency bands, L and S, tended to have more hits than the higher frequencies, C and X.\n\nWithout knowing the transmitted frequency, a Doppler shift alone is degenerate between a transmitter frequency offset and a non-zero line-of-sight velocity between the source and the observer. However, the “drift rate” of a signal measures the rate at which a transmitted signal shifts through frequency space as it is observed on Earth due to the changing relative motion between the source and the observer. The drift rate is therefore more useful in identifying signals from distant sources with an expected acceleration relative to us as observers. The de-Doppler algorithm used by turboSETI calculates this drift rate in each signal it identifies. One limitation of this de-Doppler technique is its sensitivity loss at higher drift rates than the one-to-one pixel rate of the data due to power smearing over multiple pixels at higher drift rates (Enriquez et al. 2017).\n\nWe configured the “beamformer mode-h” data produced by the Breakthrough Listen Accelerated DSP Engine (BLADE) back-end to have a frequency resolution of 1 Hz and a time resolution binned to 16 seconds. Thus, any signals with drift rates higher than 1/16 Hz s-1 will have their power smeared over multiple pixels and the sensitivity of the tree summation in the deDoppler algorithm will be significantly reduced. The loss in sensitivity at these higher drift rates scales roughly as 1 ↑ ω/x, where ω is the pixel ratio, 1/16 Hz s-1 in this case, and x is the actual drift rate of the signal (Margot et al. 2021).\n\nRadio SETI searches must generally remain agnostic about the relative motion of the transmitter source, especially for systems without known planets. It has been shown that planetary systems with high accelerations, e.g., those with tightly orbiting planets or highly eccentric orbits, could produce narrowband signals with large drift rates due to their relatively high orbital motion, thus complicating the search for."
    },
    {
        "id_": "d9d077a7-b9e4-4907-8fa5-b01d0efa424e",
        "text": "# 8\n\nSuch signals (Sheikh et al. 2019; Li et al. 2023). The recommendation from Sheikh et al. (2019) suggested that drift rates up to 200 nHz (1 kHz s−1 at 5 GHz) should be considered in searches targeting stars with little prior knowledge on the orbital characteristics of planets within a given system. (The unit of nHz was there developed and has since gained traction in the field as a frequency-independent unit of drift rate and a measurement of the acceleration over the speed of light, a/c. The more traditional drift rate units of Hz s−1 are recovered by multiplying a/c, in nHz, by the observed frequency in GHz.)\n\nHowever, it is assumed that the TRAPPIST-1 planets are tidally locked due to their proximity to their host star and will have a negligible rotational contribution to the drift rate of a transmitter on their surfaces. Additionally, their orbital parameters are well constrained, making it possible to calculate the drift rate contributions from their orbital motion. Satellite transmitters in circular orbit around each planet could produce much higher drift rates, up to an additional →45 nHz on top of the contribution from the planet’s orbit around the star. However, we have chosen to limit our scope to analogues of our deep space communications, the strongest of which are surface transmitters to deep space probes. Although our space probes and satellites have transmitters that return data to Earth, these are typically significantly weaker in power, making it much more practical to search first for more powerful surface transmitter signals.\n\nRather than calculating the drift rate from a particular body based on the precise orbital configuration during the time of each observation, we determined a maximum drift rate of 15 nHz for a surface transmitter in the TRAPPIST-1 system using the methodology from (Li et al. 2023) for the innermost planet — this was used as a conservative value to ensure that our search is sensitive to accelerations from transmitters on any of the planetary surfaces in the system. A more rigorous calculation of the anticipated drift rate range during a PPO event and subsequent data analysis would be warranted in the event of an interesting signal candidate, but this extra consideration ultimately proved unnecessary.\n\nEven at the lower end of the frequency range of →1 GHz for these observations, the resulting maximum drift rate of →15 Hz s−1 is far above the 1/16 Hz s−1 pixel ratio where power loss could become a concern. In an attempt to recover some of the power loss during signal detection for these higher drift rates, we used a technique called “frequency scrunching” or “fscrunching.” Similar to the methods used by Siemion et al. (2013) and Sheikh et al. (2023b), fscrunching bins power over frequency channels to increase the one-to-one pixel ratio of the data, as described below.\n\nWe first ran the de-Doppler algorithm over an absolute value drift rate range of 0 to 1/16 Hz s−1. Although we typically only refer to positive drift rate ranges, the algorithm mirrors these values in the negative direction and searches the equivalent negative drift rate range as well, so it should be understood that the negative value range is included in the search. Then fscrunch was applied to bin adjacent frequency channels together, doubling the pixel ratio, and the deDoppler search was run again."
    },
    {
        "id_": "20bc6217-d62e-4534-bf6f-1bdb1c73a97e",
        "text": "# A n ATA S E T I S e a rc h o f T R A P P I S T - 1\n\nfrom 1/16 to 1/8 Hz s→1. This doubling of frequency bins was continued until the maximum drift rate of 15 nHz was covered for all frequencies. Up to 12 iterations of this technique were needed to include the maximum drift rate of 139.5 Hz s→1 at the highest frequency of 9.3 GHz, extending the search out to an actual maximum of 256 Hz s→1 or 27.5 nHz. The minimum number of iterations was 8 at the lowest frequency. The distribution of drift rates can be seen in Figure 2, although the vast majority of signals are found closer to 0 Hz s→1, as expected for a local RFI-dominated environment."
    },
    {
        "id_": "7e0c5501-c519-4f72-a154-7b8452cd32c3",
        "text": "# 3.2. NbeamAnalysis Pipeline\n\nWe developed the NbeamAnalysis1 pipeline as an open-source filtering tool for signals identified in beamformed filterbank data products at the ATA. Similar in purpose to the post-signal detection filtering functions of turboSETI, the NbeamAnalysis pipeline produces a filtered list of signals with their relevant parameters along with overall diagnostic plots for quick review of the results. The resulting list of filtered signals can then be fed into a versatile plotting tool to plot the dynamic spectra of individual signals for visual comparison across beams. The pipeline is designed to handle any number of beam-formed data products, though the data volume for N >2 may be prohibitive."
    },
    {
        "id_": "53114397-0324-4b34-828c-63e61ceec589",
        "text": "# 3.2.1. Spatial Filtering\n\nThe search strategy identified &gt;24 million signals across all observations. However, the majority of these hits were found with similar power at the same frequency (within 2 Hz) over the same frequency range in both beams. This indicates that they are likely local RFI, washing over the entire field of view, and not spatially distinct within the individual beams. Due to the sparse array configuration of the 20-element ATA, the synthesized beam possesses high sidelobe levels. Therefore, even a true sky-localized signal could appear in the off-target beam with only moderate power attenuation. From both analytical estimates and empirical tests on sky-localized X-band downlinks from orbiters around Mars (see Section 3.2.4), the minimum attenuation factor between the on- and off-beam was determined to be roughly 4. This attenuation requirement provides an additional RFI filter. By cross-referencing each hit in each beam, we identify hits having the same frequency as well as attenuation factors less than this factor of 4 as RFI. These hits were removed from further consideration and we refer to this rejection method as “spatial filtering.” Execution of the spatial filtering process reduced the total number of hits to &gt;6 million for further processing."
    },
    {
        "id_": "932648ba-ae88-4701-b65a-e39db11e684e",
        "text": "# 3.2.2. DOT\n\nWe developed and incorporated the DOT algorithm within the NbeamAnalysis pipeline as a novel filtering technique to identify candidate signals after the optional.\n\n1 https://github.com/SETIatHCRO/ATA-Utils/tree/master/NbeamAnalysis"
    },
    {
        "id_": "4ca6e98c-12ce-4d9e-90d1-25bddcb9b94e",
        "text": "# 3.2.3. Injection Recovery\n\nTo test the effectiveness of scoring signals with the DOT algorithm, we used setigen to inject artificial signals into the data (Brzycki et al. 2022). As a preliminary test, three signals were injected; The first was a strong signal injected in a region of pure noise; The second was injected on top of RFI with a signal strength much greater than the RFI signal detected by turboSETI; The third was injected on top of RFI with a signal strength comparable to the RFI signal strength. The pipeline was then run on the data with these injected signals.\n\nThe injection test indicates that a narrowband signal appearing in only one beam should produce scores very near 0, unless overlapping with much stronger RFI. Figure 3 shows the resulting waterfall plot of the two beams where a signal has been injected in a region devoid of obvious RFI in the target beam. The resulting correlation (DOT) score very near 0 demonstrates that a strong signal localized in one beam of a beamformed data product is easily identifiable.\n\nTypically, narrowband RFI shows up in both beams and produces correlation scores significantly closer to 1 than 0, even for signals with low SNR. Figure 4 shows that even for a powerful signal injected on top of relatively weaker RFI, the pipeline can..."
    },
    {
        "id_": "c73018bd-8b92-4ecf-854d-c8858fdf837e",
        "text": "# A n ATA S E T I S e a rc h o f T R A P P I S T - 1"
    },
    {
        "id_": "e33d3b1f-946b-49ab-a1a7-9ddbab5655b3",
        "text": "# 11"
    },
    {
        "id_": "25510c6e-d672-4148-ae70-02a9f56cd812",
        "text": "# Figure 3\n\nAn injection-recovery test using setigen used to score an isolated signal with the DOT algorithm. The isolated linearly-drifting signal seen in the target panel was injected in a region of frequency space known to contain only noise. The signal was given a width of 2 Hz, a drift rate of 0.07 Hz s-1, and an SNR of 42,000. turboSETI calculates SNR independently from the SNR input into setigen, but nevertheless indicates a relatively strong signal as intended. The low correlation score of 0.019 indicates that the signal detected in the target panel is distinct from the pure noise in the o! panel."
    },
    {
        "id_": "3739e178-bbee-4aad-b3bf-d30d386724b6",
        "text": "# Figure 4\n\nThe second injection recovery test using setigen to score a strong signal on top of weaker RFI. The added signal seen only in the target panel was injected on top of previously identified RFI, originally calculated by turboSETI as 42.25. The signal was given a width of 2 Hz, a drift rate of 0.07 Hz s-1, and an SNR of 1000 times that of the RFI. turboSETI calculates SNR independently from SNR input into setigen, but nevertheless indicates a relatively strong signal as intended. The RFI o!set from 0 in these frames shows why this was not removed by spatial filtering. The somewhat low correlation score of 0.276 could indicate an interesting signal for follow-up, depending on the user-defined cuto! value.\n\nRecover a relatively low score that may indicate to the user that further investigation is warranted. However, in the case of a signal comparable or weaker in power than the RFI it overlaps, as in Figure 5, the stronger RFI signal is keyed in on by turboSETI and the hits in both beams over this region are registered at the same frequencies. Thus, if spatial filtering is applied in the pipeline, this signal could be filtered out. Even without spatial filtering, the power from the RFI dominates the data slice and the resulting score is so close to 1 that the score alone is unlikely to flag this for further."
    },
    {
        "id_": "2efd51b3-3652-4f30-9931-0dc2bd2e8dd1",
        "text": "# 12"
    },
    {
        "id_": "6faabbd2-dfc2-440d-bcbe-e7fb5e4a6355",
        "text": "# Figure 5.\n\nThe third injection recovery test using setigen to score a weak signal on top of stronger RFI. The added signal seen only in the target panel was injected on top of previously identified RFI, originally calculated by turboSETI as 78.88. The signal was given a width of 2 Hz, a drift rate of 0.07 Hz s−1, and an SNR equal to that of the RFI. turboSETI calculates SNR independently from the SNR input into setigen, but the reported SNR is relatively close to the original RFI. The RFI centered on 0 in these frames shows why this was removed by spatial filtering. The very high correlation score of 0.983 is unlikely to indicate an interesting signal for follow-up investigation. The potential for true signals to be lurking in frequency space rejected by RFI is a pervasive problem in these kinds of searches. Recent attempts at employing machine-learning techniques have seen some success and may prove to be an effective tool in overcoming this problem (Ma et al. 2023, 2024)."
    },
    {
        "id_": "33a9a1af-0425-45cc-8290-c3634c08fd7f",
        "text": "# 3.2.4. Mars Probes\n\nAs an additional, practical test of the NbeamAnalysis pipeline, in mid-July and early August 2023, a series of high-frequency resolution observations targeting Mars were performed at the ATA utilizing the same beamforming process. Several deep space probes expected to be transmitting in the observed frequency range were catalogued for reference. The data collected during these observations were then processed with the NbeamAnalysis pipeline, and this test of the pipeline revealed that signals from deep space detected in the target beam were also being picked up in the off-target beam despite significant spatial separation. Through investigation of these data, we found that the application of the beamforming software was capturing power from the target beam in the off-target beam, with an attenuation factor of at least 4 between the beams. Therefore, sufficiently strong signals localized to a distant source within the target beam will not disappear in the off-target beam."
    },
    {
        "id_": "abceb351-410f-4b4b-a7fb-32c4edd2b2df",
        "text": "# Figure 6\n\nshows the results of including SNR-ratio (detailed in §3.2.5) as a discriminating parameter to measure attenuation between beams. In order to isolate the bulk of expected RFI within the 2D parameter space of DOT score and SNR-ratio, while accounting for an indeterminate amount of uncertainty, we designed a nominal cutoff as a power law relation based on an empirical description of the data. We define it as:\n\ny = 0.9A(x ↑ 0.05)1/3, (2)"
    },
    {
        "id_": "fbf8d159-c552-45fc-8f3e-11948b099154",
        "text": "# A n ATA S E T I S e a rc h o f T R A P P I S T - 1"
    },
    {
        "id_": "1fc48005-7eb5-4224-9e7e-f2557751e4b8",
        "text": "# Figure 6.\n\nResults of Mars test observations showing recovery of 37 Mars orbiter downlinks during the time of observation. 3 signals were classified as RFI below the nominal cutoff, and 1 false positive showed an attenuated signal at a known transmitting frequency for STEREO-A, which was not in either beam at the time. Signals that are powerful enough to show up in both beams, overwhelming the DOT scoring algorithm and trending toward 1.0, are still attenuated in the off-beam and identified as potentially interesting for follow-up. Candidate signals localized to a distant source may show up only weakly in the target beam at the limits of the telescope’s sensitivity, and are expected to appear in the top left of this kind of plot.\n\nwhere A is the attenuation value (assumed to be roughly 4 for the ATA’s current configuration), x is the DOT score and y is the SNR-ratio.\n\nDiscriminating the signals in this way allowed us to reject all the RFI and recover all of the true signals, including an additional “False Positive” that turned out to be the STEREO-A spacecraft in heliocentric orbit and not in the beams at the time of observation, likely being picked up through a side-lobe. For comparison with the synthetic signals in X-band, figure 7 shows a few representative spectra of signals that were recovered in this test, including the additional false positive from STEREO-A.\n\nThe variation in attenuation factor for the real signals is mainly due to differences in on-sky target positions between the observations. During each observation, the off-beam is fixed at a constant relative 9 arcminute separation from the target-beam, but these results comprise several observations where the target is located at different positions on the sky, leading to variations in the observed beam pattern. Discussion of ongoing work to account for this variability in future observations can be found in section §5."
    },
    {
        "id_": "3eed55a1-4fcc-428e-84d9-cf938f4e3407",
        "text": "# 3.2.5. SNR-ratio"
    },
    {
        "id_": "ea177f76-b24a-409b-a9b2-1058f16b1c43",
        "text": "# 14"
    },
    {
        "id_": "b90a082c-3abe-4826-a0e6-9e69d219a1ff",
        "text": "# Figure 7.\n\nThree representative signals in the on- and off-beams resulting from test observations of Martian probes that were subsequently filtered through the NbeamAnalysis pipeline. The detected frequency of these signals were cross-referenced with known transmission frequencies for various Martian probes to identify their source. The top panel shows a signal from the Emirates Hope orbiter. The middle panel shows a signal from the Mars Odyssey orbiter. The bottom panel shows the “False Positive” signal noted in figure 6 from STEREO-A, a heliocentric satellite. The colorbar indicates the amount of power in each beam, normalized to the peak of the target beam signal and displayed in a logarithmic scale.\n\nCalculation of the SNR-ratio between beams for a given signal was added to the pipeline as a second major filtering parameter based on tests explained in §3.2.4. For a given signal, there is an expected attenuation value of →4 between the target and off-target beams from the beamforming process employed to create these data. A sufficiently powerful signal coming from a distant target within the target beam should"
    },
    {
        "id_": "6528a814-89d4-4d6b-a98f-65bb16d14c00",
        "text": "# A n ATA S E T I S e a rc h o f T R A P P I S T - 1\n\nshow up at least 4 times weaker in the o!-target beam. Thus, by calculating the SNR within every data slice that contains a hit as well as the same frequency-sliced data in the o!-target beam, the SNR-ratio can be calculated and compared with the expected attenuation factor.\n\nTo calculate the SNR of a given data slice, we measured the standard deviation of the middle 90 percent of the pixels within the data as described in §3.2.2. We identified signal in each data slice as any power greater than 10↓ the standard deviation of the noise. The SNR for data slices not meeting this criteria was set to 1. In data slices where signal was identified, we then calculated the signal strength to be the median of the N highest power elements, where N is the number of time bins, which is 38 in the 10-minute integrations of the TRAPPIST-1 data. We determined the SNR by dividing the signal by the standard deviation of the noise, and then finally, the SNR for the on- and o!-beams was divided to produce the SNR-ratio for each hit."
    },
    {
        "id_": "c2e2fc77-ff0a-481a-9bd5-e973fc56218d",
        "text": "# 3.3. PPOs\n\nThorough analysis to determine the orbital parameters of the TRAPPIST-1 planets by Agol et al. (2021) suggests that the planets in this system are very co-planar and nearly edge-on, with some small degree of offset and uncertainty. But even a small deviation in the relative inclinations of the planets can turn a syzygy into a near miss.\n\nHowever, for the purposes of searching for radio spillover, we use a broader definition of PPOs that do not require syzygy. Here, a “PPO event” defines a window of time wherein Earth could receive radiation from a beamed radio signal from the further planet towards the nearer one. The range of valid geometries is based on the width of the opening angle, which itself depends on the frequency and dish diameter. Figures 8 & 9 provide cartoon illustrations of favorable geometries from different points of view.\n\nThe three points of the transmitting planet, receiving planet, and the Earth constitute a plane. In this plane, the radio transmission is beamed along a line between the two planets in an expanding cone with some opening angle, ε = 1. 15ϑ/D, where ϑ is the wavelength of transmission and D is the diameter of the transmitter dish. In this way, ε is defined as the FWHM of the beam. For the sake of simplicity and because we are only defining windows in which to focus our search based on notional dish sizes, we assume most of the power is contained within this angle and drops off steeply enough to be approximated as a top-hat function with the FWHM as its width. When half of that opening angle, ε, is larger than the angle between the central beam line and Earth, ϖ, there is a PPO event. In this way, syzygy is not required for a PPO event with a sufficiently large transmitted beam.\n\nThe DSN typically uses a 34 m dish to transmit to probes on Mars. The separation of planets in the TRAPPIST-1 system is an order of magnitude smaller than the distance between Earth and Mars, meaning that dish diameters can be an order of magnitude smaller than those used by the DSN to achieve the same gain and signal strength at a given power. We therefore started with an assumed dish diameter of 3.4 m for"
    },
    {
        "id_": "2e71d2c1-f27b-4a8b-8b03-1e1d948443d2",
        "text": "# Figure 8.\n\nA cartoon illustrating that PPO events, in this work, can occur in scenarios broader than strict occultation. Specifically, PPO events occur where the opening angle of the transmitted beam, ω/2, is greater than the angle ε between the line of the planets and the ↑ˆ z direction, toward Earth. The top panel shows the projected xy-plane view. The bottom panel shows a bird’s-eye, xz-plane view of the same scenario where a transmitter on the surface of planet b is sending a radio signal toward planet c. This sketch is not to scale, but it provides a visual reference for the geometry considered in calculating a PPO event."
    },
    {
        "id_": "a084df8b-61f4-4817-8883-11e2017f470b",
        "text": "# A N ATA S E T I S e a rc h o f T R A P P I S T - 1"
    },
    {
        "id_": "dc7c826b-5f0d-4c6f-a27e-ea35b339bf3e",
        "text": "# 17\n\nFigure 9. Sketch of the geometry of a PPO event where the effects on our observations due to uncertainties in the semimajor axis and inclination would be maximized. When the opening angle of the transmitted beam, ω/2, is greater than the angle ε between the line of the planets and the ↑ˆ direction, spillover emission from a PPO event could be detected.\n\nCommunication between neighboring planets and added an additional scaling factor. The DSN uses larger dishes for communication with our deep space probes further away, so we included a scaling factor to account for the possibility of larger dishes being used to communicate to planets further apart. This scaling factor was chosen as the square root of the difference between the numbered order of each planet. This choice was made to yield reasonably sized dishes and resulting beams that essentially vary with target distance and provide a reasonable constraint on a detectable transmitting beam width. The scaled dish diameter and the maximum frequency of each observation were used to calculate the opening angle of a transmitted beam, which determined whether that triggered a PPO event. The duration of each event was calculated by totaling the number of steps in the simulation, with a resolution of 2.9 minutes, where ε/2 > ϖ for the relative positions of that pair of planets with respect to Earth.\n\nA modified version of the NbodyGradient algorithm originally developed by Agol et al. (2021) was used to determine the orbital positions of the bodies in the TRAPPIST-1 system from August 23, 2015, 10:20:51.81 UT through the end date of the last observations for this project. Some of the modifications included adding radii of the bodies in the system, calculating an impact parameter to determine planet-planet occultations, and using smaller time steps (0.002 days down from 0.05 days) to ensure small timescale PPOs could be identified at any orbital phase. The modified code was tested to accurately replicate the results of the original NbodyGradient, which has been shown to predict mid-transit times based on transit timing variations for this particular system within microsecond agreement of similar N-body integrators, like TTVFast (Agol et al. 2021). At every time step, the algorithm calculates and records the positions of every body in the system. We assume these positions to be accurate outside of transit; the alignment of multiple bodies along the line of sight of the Earth was calculated during the times of these observations.\n\n2"
    },
    {
        "id_": "dadcabc8-5928-4fee-aeb2-4042acde7013",
        "text": "# Figure 10.\n\nSimulated potential PPO events during our observations. Online viewers will see a concatenated video of the orbital configuration of the system during each of the observations, including any potential PPO events that we found to occur during those windows. A still image of a PPO event during the observation on Oct 29, 2022 is included where the animation is not accessible. The top panel shows a bird’s-eye view of the system with planet radii scaled up for better viewing. The distances and beam sizes are to scale, assuming a beam created with a 3.4m dish at 3.3 GHz (the maximum frequency observed during this particular session) from the surface of planet g aimed at planet e. The bottom panel shows the edge-on view with planet sizes scaled with distance, showing how much of the beam spills over the planet toward the direction of Earth in the negative z-direction. The red dashed lines in the illustrated beam is the inner angle blocked by the occulting planet, e. The blue dashed lines show the outer angle of the beam that would spill over the planet. The window for this event lasted roughly 95 minutes.\n\n| |0.05|0.04|0.03|0.02|0.01|0.00|-0.01|-0.02|-0.03|-0.04|-0.05|\n|---|---|---|---|---|---|---|---|---|---|---|---|\n|3|0.01|0.00| | | | | | | | | |"
    },
    {
        "id_": "aca46869-f801-4fcd-b1b8-b16a6988f053",
        "text": "# A n ATA S E T I S e a rc h o f T R A P P I S T - 1"
    },
    {
        "id_": "6c69f430-2058-4553-8572-f1c5b96e30c2",
        "text": "# 4. RESULTS\n\nUncertainties in the inclination, i, and semi-major axis, a, of the planets could still lead to alignments that disallow a PPO event. Figure 9 shows the geometry for which uncertainties in a and i have the maximum effect on observability of spillover radiation. The most extreme case was calculated for each pair of planets during a potential PPO event. In most cases, the maximum dish diameter that could have been assumed and still created a PPO event at the frequencies observed was much larger than the dish diameter assumed.\n\nThe orbital configuration of the system during the time of observation based on the output of the NbodyGradient code was simulated as animated gifs. Figure 10 shows a concatenation of the gifs, and the representative still frame captures the PPO event on October 29, 2022. The duration of the 7 PPO events during the 28 hours of observations ranged from 8.6 minutes to 99.4 minutes. Additional simulations of this system outside these windows indicate that over the course of just a few days many PPOs are likely to occur with a similarly wide range of durations, showing good agreement with previous studies, and offering encouraging results as a search strategy (Luger et al. 2017; Ashtari 2023).\n\nThe NbeamAnalysis pipeline does not output a definitive identifier of ETI, but instead maps each signal in the data onto a 2D parameter space that can be used as a guide for sorting and filtering the list of signals as candidates for follow-up. The two parameters are the DOT score, which scores similarity of signals in each beam, and the SNR-ratio, which measures the attenuation of signal power in each beam. The expectation is that true-positive, sky-localized signals will tend to have low DOT scores and high SNR-ratios, while local RFI will tend to have high DOT scores and low SNR-ratios.\n\nThe 2D parameter space for each observation of the TRAPPIST-1 data is plotted in Figure 11, showing that the vast majority of signals, over 99.8% of the combined data, are identified as RFI. Each observation is treated separately to account for any temporal dependence in the RFI environment at the time of observation.\n\nAfter filtering and scoring the list of signals, the pipeline also contains a plotting tool to show comparison dynamic spectra (waterfall plots) of each beam for a given signal, with the color scale representing the signal power and normalized to the power in the target beam. For practical considerations, the default configuration plots up to 500 of the most interesting candidate signals, though this number is adjustable as an input parameter. A nominal cutoff, defined in §3.2.4, is first used to identify obvious RFI with high DOT scores and low SNR-ratios, and if still more than 500 signals remain, the default plotting scheme will plot up to the lowest 500 scoring candidates above the default attenuation value.\n\nIn the case of the TRAPPIST-1 observations specifically, 11127 candidate signals were plotted for visual inspection, of which 1627 were found to be within the PPO."
    },
    {
        "id_": "9cd303bc-2b3e-41a9-948d-6377e99ff27b",
        "text": "# 20"
    },
    {
        "id_": "2eef13c6-e0b0-4610-a437-4e238375b2f5",
        "text": "# Figure 11.\n\nSNR-ratio vs. DOT scores for each day of the TRAPPIST-1 observations. Each observation was analyzed independently to account for temporal variability in the RFI environment. The red dashed line represents a conservative cutoff defined by an empirical power law designed to isolate the bulk of the RFI. RFI is expected to have high DOT scores and low SNR-ratios while true signals are expected to trend toward lower DOT scores and higher SNR-ratios. All signals above the cutoff are plotted as individual black points while signals captured below the cutoff are represented as a heatmap, with the colorbar showing the base 10 exponent of the number of signals represented in a given region."
    },
    {
        "id_": "f7060b60-9d1f-4076-97f8-228ff2daebf3",
        "text": "# A n ATA S E T I S e a rc h o f T R A P P I S T - 1"
    },
    {
        "id_": "01cb189c-6e4b-4639-8272-4ee49a9e327b",
        "text": "# 21"
    },
    {
        "id_": "229e92ea-1077-4aec-b73c-a6ffebe4a9e4",
        "text": "# Figure 12\n\nAn example of some one-off “blip” results. The red framed central panel is the 10-minute integration from the observations taken on Nov 05, 2022 in which the signal was found, showing reasonable attenuation but lacking the drifting narrowband morphology and persistence in time expected from a true signal in this kind of search. It appears to mimic other confirmed RFI in morphology, though at a distinct and isolated frequency. The observing time progresses from the bottom to the top of each panel. The bottom and top rows show adjacent integrations at the same frequency.\n\nWe do not see a notable difference in the number of signals detected during PPO windows, and none of the signals indicated a definitive technosignature detection of non-human origin, though a handful warranted extra consideration."
    },
    {
        "id_": "a73b8fae-fd82-4796-a9c7-c99e664d656d",
        "text": "# Figure 12\n\nshows an example of a one-off “blip” occurring over a timescale less than the 16-second time bins in the recorded data. Figure 13 shows the most enigmatic example of various signals with an unexpected morphology. Many of these blips and morphologically interesting signals recovered by the pipeline were easily discounted as RFI when looked at more carefully, but a small subset, like the one shown in Figure."
    },
    {
        "id_": "03cb528b-a6b4-405f-9215-ee7db3911148",
        "text": "# 22"
    },
    {
        "id_": "ecd2679e-bfe8-4bb0-8618-7197cf3d1c7d",
        "text": "# Figure 13.\n\nAn example of unique and unexpected RFI in the primary panel framed in red. The observing time progresses from the bottom to the top of each panel. The other rows show adjacent integrations at the same frequency. The apparently alternating pings in the primary frame explain the low correlation score and spark curiosity. However, the low SNR-ratio, small drift rate, and bright features in later integrations all suggest that the source of the signal is likely not localized to the TRAPPIST-1 system."
    },
    {
        "id_": "832a930a-3016-416b-9e25-fe39278392b0",
        "text": "# A n ATA S E T I S e a rc h o f T R A P P I S T - 1\n\n12 held too little information and dissimilarity to other signals in nearby frequency space. It may be worth searching for these signals in future observations. However, like the famed “Wow!” signal (Kraus 1979), it seems imprudent to assign confidence to signals that do not persist and could easily be attributed to an increasingly crowded and complicated RFI environment.\n\nFrom this null result, we can calculate an upper limit on the signals that we were sensitive to in this search. The narrowband form of the radiometer equation from Enriquez et al. (e.g., 2017) provides the spectral flux density Smin,narrow in terms of the SNR, System Effective Flux Density (SEFD) of the instrument, the transmitter bandwidth #ϱt, the channel width #ϱ, the number of polarizations npol, and the total integration time per scan, ςobs:\n\nSmin,narrow = (SNR)SEFD√npol ςobs#ϱt√#ϱ\n\nThe majority of these values were chosen when determining the data dimensions and survey design, however the SEFD must be calculated separately for each tuning and observing day as a measure of the sensitivity of the ATA under those particular conditions.\n\nWe follow the same SEFD derivation procedure as Sheikh et al. (2024). Briefly, each observing session began with a 10 min calibrator scan of a flux calibrator — one of 3C286, 3C48, 3C295, and 3C843. We used the measured gain values from the calibrator scan and the expected flux values for each calibrator (generally from Perley & Butler 2017, except in the case of 3C84), to determine the SEFD of each antenna-polarization combination, and then average these values to get the SEFD of the beamformer as a whole.\n\nWe thus calculate Smin,narrow for each session-tuning combination using SNR = 10, #ϱt = #ϱ = 1 Hz, npol = 2, ςobs = 10 min, and the SEFD for that session-tuning combination. We can then convert this spectral flux density into a required transmitter Equivalent Isotropic Radiated Power (EIRP) by using the following equation:\n\nEIRPmin = 4φd2 Smin #ϱt\n\nand plugging in d = 12.5 parsecs, we find a range of potential EIRPs that we might be sensitive to, as reported in Table 1."
    },
    {
        "id_": "23210e91-0ad5-4e39-aee9-315c466d94fe",
        "text": "# 5. DISCUSSION & CONCLUSION\n\nTRAPPIST-1 is inarguably an excellent laboratory for high precision multi-planet transiting exoplanet science. And by extension, it is perfect for refining targeted technosignature search strategies for leaked radio emission. The observational data\n\n3C84 is actually suitable for gain calibration, but not generally for flux calibration. In this case, for the first observing session only, 3C84 was accidentally used as the calibrator. In Summer 2023, we derived a set of coefficients for flux calibration with the ATA — these values were used to use 3C84 as a pseudo-calibrator for this dataset."
    },
    {
        "id_": "40edaa73-8353-4a6a-b4e5-4111c000dd67",
        "text": "# 24\n\npresented here provide a useful reference for this system and the current RFI environment. The pipeline developed to search for and filter interesting signals in beamformed data at the ATA performs as well as current single dish search strategies, with similar limitations. However, long stares at every nearby multi-planet edge-on system is impractical.\n\nPPO events comprised roughly 21% of the total observation duration in this experiment. And, while the TRAPPIST-1 system is one of the most favorable systems for PPOs, having 7 closely aligned known transiting planets, most other planetary systems where PPOs could plausibly occur are likely to have far fewer PPOs, leading to a smaller percentage of total time when it would be optimal to observe. Therefore, observing during predicted PPO events would significantly enhance the efficiency of targeted searches for leaked transmission in these systems.\n\nThe DSN transmits continuously as it tracks space probes, and frequently schedules tracking for several hours at a time. We cross-referenced recent scheduling from the Canberra station4 with a recent NASA audit of the DSN5 that includes tracking hours for the most subscribed satellites to estimate how often the DSN is transmitting toward a particular target. Focusing just on Mars transmissions and adjusting the reported time by 80% to account for target acquisition and other set up overhead, we estimate that the DSN transmits to Mars about 30-35% of the time over a given period of months, typically for several hours at a time.\n\nThe PPO event durations are significantly shorter than typical DSN transmissions and each PPO event found during these observations constitutes a unique pairing of planets. We treat each PPO event as an individual probability event within the scope of the entire observations and assume the duration of each PPO event does not significantly contribute to the overall probability of detecting an equivalently intermittent DSN. Therefore, we estimate the probability of having intercepted a transmission during one of these events to be roughly 33% per PPO event. To have a significant chance of intercepting leaked emission from an intermittent transmission source similar to the current DSN, one would want to observe for a minimum of 3 PPO events for each pairing of planets.\n\nThere are of course many caveats to this consideration, as it does not account for all possible factors that could affect the probability of detection from an equivalent ETI DSN. We cannot guess at the true nature of an alien communication system, so we offer this calculation as a first order approximation based entirely on the primary system in use by the only currently known species to communicate through deep space: the human-made DSN. We leave the inclusion and refinement of additional factors that may better inform search strategies along this vein to future research.\n\nThe TRAPPIST-1 system has many advantages that have led to the feasibility of determining and predicting PPO events, but the same process remains difficult and\n\n4 https://www.cdscc.nasa.gov/Pages/trackingtoday.html\n\n5 https://oig.nasa.gov/docs/IG-23-016.pdf"
    },
    {
        "id_": "68fa6710-b093-4a6c-a0e1-9993f1ac1145",
        "text": "# A n ATA S E T I S e a rc h o f T R A P P I S T - 1\n\nMJD: 59879_18519 || fmax: 8647.378070 MHz || Drift Rate: 0.061 Hzls (0.007 nHz) || Correlation Score: 0.495 || SNR ratio: 6.791 || SNR: 11.703\n\n|Beam|SNR|\n|---|---|\n|Target Beam|11.703|\n|Off Beam|1.723|\n\nCentered at 8647.377945 MHz\n\nFrequency [kHz]\n\nMJD: 59879_18519 || fmax: 8647.428070 MHz || Drift Rate: 0.061 Hzls (0.007 nHz) || SNR: 11.703 || Correlation Score: 0.872 || SNR ratio: 1.123\n\n|Beam|SNR|\n|---|---|\n|Target Beam|11.703|\n|Off Beam|10.425|\n\nCentered at 8647.377945 MHz\n\nFigure 14. Original plot of a signal over the expected frequency span based on drift rate in the top row, and the same signal zoomed out in frequency in the bottom row. The true morphology of this broadband signal can be seen over a wider bandwidth and is reflected in the increase in correlation (DOT) score. This demonstrates how small slices of broadband signals are often misinterpreted by current de-Doppler algorithms as narrowband signals.\n\nTime-intensive for other systems. Future work will include adapting such techniques to other applicable systems, especially as higher-precision orbital data becomes available for similar, co-planar systems.\n\nWhile great strides have been made to automate the process of detecting signals and filtering out obvious RFI in very large datasets with very high resolution like this, some challenges remain difficult to overcome. As mentioned in §3.2.3 and shown in Figure 5, low-power signals from a distant source overlapping with much stronger RFI at the same frequency may easily be missed with this and other similar search and filter algorithms.\n\nAnother confounding problem is broadband RFI as illustrated in Figure 14. Slight fluctuations in power between beams often presents as different power signatures in narrowband channels over smaller scales than the true width of the broadband signal. In some cases, this may be erroneously interpreted as distinct narrowband signals by the search algorithm. This can also lead to low correlation (DOT) scores in the filtering pipeline. Although the signals are easily discerned as part of the same broadband feature when zoomed out to larger bandwidths, identifying and classifying."
    },
    {
        "id_": "a393a877-c6d7-43b8-b49f-a0d6819cc196",
        "text": "# 26\n\nThese structures as broadband interference is a poorly defined problem and difficult to automate.\n\nRecent attempts at employing machine-learning techniques have seen some success in retrieving previously undetected signals in non-AI driven pipelines (Ma et al. 2023, 2024). Machine learning algorithms have proven very effective as classifiers and identifying key features in image data, in certain instances. It is very possible that some adaptation of these techniques may be useful for mitigating these problems of broadband characterization and signals hidden behind RFI.\n\nThe plotting software in the NbeamAnalysis pipeline offers the ability to stack integrations, which can help track persisting signals and provide additional information for identifying the nature of the signal. However, as seen in Figure 12, many signals occur over shorter timescales than the 16s time binned data, which provides almost no information on its drift rate unless the signal pings again. Preserving the sampling at shorter timescales without binning may help, but this would significantly increase an already dense data volume.\n\nSimilarly, along the orthogonal axis, this project attempted to apply frequency binning (fscrunching) as a potential solution to help recover power lost at higher drift rates. But, when applying the fscrunching technique, the de-Doppler algorithm as currently implemented with turboSETI is run anew on the frequency binned data. Therefore, the algorithm will sometimes trigger on and assign a higher drift rate to the same signal at wider frequency ranges. So, many of the hits, particularly at higher drift rates, are seen to be duplicates of the same signal upon further inspection. Attempting to recover weak signals at high drift rates may be better handled through direct integration of frequency binning into the de-Doppler algorithm from the start, if not an entirely new process to recover signals at high drift rates without substantial loss of power in the signal.\n\nThe limits of the DOT algorithm on ATA data need to be better characterized, including determining a more quantitative cut-off value for future searches. This should be paired with a more robust injection-recovery analysis. In this project, a simple beam-localization procedure was used: the on-beam was always at the phase-center of the array, and the off-beam was always placed a constant separation, of 9 arcminutes, from the phase center within the primary beam. However, the beam isolation would be improved by using a variable off-beam location, adjusted to fall within a “null” of the on-beam’s pattern. Work is ongoing to incorporate a model of the beamshape that would also allow for a more precise determination of the attenuation in the off-beam (not just the threshold value of 4 used in this work), reducing the number of false positive signals that need to be manually vetted.\n\nThe analysis of the observations presented here demonstrates that precise characterization of ideal systems, like TRAPPIST-1, enabling orbital dynamical modeling and prediction of PPO events offer practical application for leaked emission searches. This provides SETI a powerful new observational tool and search strategy. As signal"
    },
    {
        "id_": "3cfaeaa3-c170-4fd2-b524-1f32b7a79aea",
        "text": "# A n ATA S E T I S e a rc h o f T R A P P I S T - 1\n\ndetection and RFI mitigation pipelines improve, the inclusion of PPOs to provide narrow search windows may make it more feasible to increase time resolution and sensitivity at higher drift rates.\n\nThe minimum detectable transmitter power by the ATA during these observations, listed in Table 1, show that much greater sensitivity is needed to detect transmissions with power on the order of the DSN, which typically operates at tens of kiloWatts of directed transmission, and →10 GW EIRP(Derrick & Isaacson 2023b). It is technically feasible that an Arecibo-like transmitter—operating at 20 TW EIRP—would be detectable by the ATA at low to moderate drift rates, but such powerful transmitters are generally seen as overkill, especially in the compact TRAPPIST-1 system, and not regularly used as part of the DSN for interplanetary communication. However, future observatories, such as the Square Kilometer Array may provide the sensitivity required to detect levels of leaked emission comparable to the DSN (Braun et al. 2019). Detection of leaked radio emission from nearby planetary systems may be on the horizon."
    }
]