[
  {
    "id_": "4458f66f-385d-4de1-9c06-03f1ba7e8f52",
    "text": "# Chiral patterning of rough surfaces with vortex laser beams: from structured polarization to twisted forces"
  },
  {
    "id_": "5864d7ba-515b-431d-9be9-998db03b3d82",
    "text": "# I. INTRODUCTION\n\nThe interaction of intense laser radiation with surfaces of solids leads to the emergence of laser-induced periodic surface structures (LIPSS), which significantly modify both the topographical and functional properties of the irradiated materials [1]. These periodic undulations, first observed in the mid-1960s [2], have seen a surge in research interest following the advent of ultra-short laser pulses [3]. LIPSS can be viewed as surface ripples with varying depth and periodicity, the formation of which is influenced by the spatiotemporal coherence and polarization of the laser pulse [4, 5]. The process of LIPSS formation and their properties are affected by a number of parameters, including pulse duration [6], laser fluence [7], polarization direction [5], wavelength [8, 9], and the number of applied pulses [10]. LIPSS can be generated on the surface of a wide variety of materials, including metals [11–13], semiconductors [3, 8, 14, 15], glasses [16, 17] and polymers [18–20], demonstrating the versatility and broad applicability of LIPSS in various areas of materials science. Coherent irradiation of multiple points on a rough surface initiates a complex interaction between various physical mechanisms, ranging from interference between scattered waves [21] to near-field enhancement effects [22], optical resonances [22, 23] such as surface plasmons [24, 25], and activation of hydrodynamic instabilities [26]. As a result of these processes, local temperature gradients arise, which, through a thermo-mechanical response, lead to the formation of a modulated surface relief with certain axes of symmetry. Traditionally, LIPSS are divided into two classes: low-spatial-frequency LIPSS (LSFL), which often occur near the ablation threshold, and high-spatial-frequency LIPSS (HSFL), which are driven by thermo-convective effects [27]. Typically, these surface structures have only one axis of symmetry, which is determined by the polarization of the laser pulse. However, recent experiments have demonstrated that using multiple time-delayed laser pulses, it is possible to produce surface structures with two or even three axes of symmetry, creating complex patterns such as cross-hatching or hexagonal lattices [28]. In addition to the pursuit of maximum miniaturization, one of the central challenges of laser surface processing has become the creation of new surface structures with unusual geometry [25, 29]. The compelling question now is: can we go beyond conventional symmetry and create surface structures with fully asymmetric patterns, independent of laser polarization direction? Typically, chiral patterns lacking mirror symmetry naturally possess these geometric properties and thus compare favorably with currently created LIPSS. It is conceivable that such chiral patterns could be produced using laser pulses that have their own intrinsic chirality. In turn, the intrinsic chirality of laser pulses is closely related to the ability of light to have angular momentum. Light can carry angular momentum in two forms: spin angular momentum (SAM) and orbital angular momentum (OAM) [30, 31]. SAM is associated with circular polarization of light and manifests itself in the form of two discrete states: left-hand and right-hand circular polarization, where the polarization handedness determines the sign of the angular momentum. In contrast, OAM has a continuous range of values determined by the so-called topological charge, which can be any positive or negative integer. The laser pulses carrying the OAM have a doughnut-like shape and a spiral wavefront [30]. Although SAM has received much more attention in LIPSS research, studying the effects of OAM may reveal new patterns and lead to new functional surfaces. For further study of chiral interactions of light and matter, it is ex-"
  },
  {
    "id_": "f7001d9d-e8af-47e8-a73e-97b8bfd6b588",
    "text": "# Footnotes\n\n∗ v.y.fedorov@gmail.com\n\n† jean.philippe.colombier@univ-st-etienne.fr"
  },
  {
    "id_": "d81dfacb-ba30-41cd-8376-c682974c7dea",
    "text": "# II. THE NUMERICAL MODEL\n\nTo study the interaction of structured light pulses with rough surfaces, we numerically solve the following system of Maxwell equations using the FDTD method [49]:\n\n∇ × E = − ∂t B, ∇ × H = ∂t D, (1)\n\nwhere E(r, t) and H(r, t) are the electric and magnetic field vectors, r = {x, y, z} is the coordinate vector and B = μ0 H, with μ0 being the vacuum permeability. The medium response can be expressed through the displacement field D(r, t) written in the frequency domain as Dr, ω = ε0ε(ω) Er, ω, where ε denotes the temporal spectrum, ε0 is the vacuum permittivity and ε(ω) is the frequency-dependent permittivity of the medium.\n\nAs the source of radiation, we consider a laser pulse launched from an xy plane in the -z direction (like in an experiment, from top to bottom). We can express the electric field vector E of such laser pulse through its Ex(r, t) and Ey(r, t) components as:\n\nEx = Ex0 cos θ − Ey0 sin θ, (2a)\n\nEy = Ex0 sin θ + Ey0 cos θ. (2b)"
  },
  {
    "id_": "115cf893-c22a-49c2-addd-03b7413963bc",
    "text": "# 3\n\nwhere at λ0 = 1.03 μm has the real and imaginary parts equal to n′ = 3.02 and n′′ = 3.51 with the corresponding skin depth l = 1/(2n′′ω0/c0) = 23.34 nm.\n\nSince LIPSS originate from the interference of incoming light and light asymmetrically scattered at surface inhomogeneities [21], as well as from contributions of nonradiative field enhancement on roughness [50], it is essential to account for the rough surface of the stainless steel sample. To enhance realism, we assume that the rough surface has a continuous distribution of heights that can be statistically described. In particular, the surface roughness is represented by the function R(x, y), which defines the random deviations of the surface height relative to a reference plane [51].\n\nTo express the statistical properties of the surface roughness we use the correlation function C(X, Y) = ⟨R(x, y)R(x + X, y + Y)⟩/σ2 where ⟨. . . ⟩ denotes the spatial averaging and σ = p⟨R2⟩ is the root-mean-square (rms) surface height. The correlation function C(X, Y) describes the spatial coherence between surface heights at different points separated by the distance d = √(X2 + Y2).\n\nIn our simulations we assume the Gaussian correlation function C(X, Y) = σ2 exp(−(X2 + Y2)/ξ2), where ξ is the correlation length. For details on converting this correlation function into an actual roughness function R(x, y), refer to [52–54]. In our simulations we use the rms height σ = 50 nm and the correlation length ξ = 100 nm, which are approximately ten times smaller than the laser wavelength. These values correspond to a well-polished surface with subwavelength inhomogeneities required for HSFL observation.\n\nIn our simulations we assume that the laser pulse can be represented by a plane wave with the temporal envelope defined as a one period of sin2 function:\n\nA(x, y, t) = A0 sin2(πτ0,2 t)\n\nwhere A0 is the peak amplitude of the electric field and τ0 is the full width at half maximum pulse duration. Since the beginning and the end of the sin2 pulse in time are well-defined, we can save a significant amount of computation time by avoiding modeling slowly rising pulse front and tail, like, for example, in the case of the Gaussian envelope. To take into account that any phase ϕ(x, y) other than flat one changes the amplitude distribution in time, we also apply the temporal transformation where in Eq. (4) we replace the time t by t + ϕ(x, y)/ω0 (see Appendix A).\n\nIn our simulations we do not consider any intensity-dependent effects of laser-matter interaction and, therefore, without loss of generality, we take A0 = 1 V/m. Additionally, we assume the pulse duration τ0 = 100 fs and the central wavelength λ0 = 1.03 μm.\n\nBelow the radiation plane, we place a semi-infinite stainless steel medium. To model the dispersive response of stainless steel we apply the auxiliary differential equation method [49] assuming the Drude permittivity ε(ω) = 1 − ωp2/ω2 and the damping rate γ/(ω2 + iωγ) with the plasma frequency ωp = 19.2 × 1015 1/s and γ = 9.15 × 1015 1/s [50]. With these parameters the complex refractive index n = n′ + in′′ of stainless steel can be calculated as the integral of W(x, y, z) over all z layers of the surface: Q(x, y) = ∫−∞∞ W(x, y, z)dz. Finally, the total laser energy Qtot absorbed by the surface can be obtained as Qtot = ∫−∞∞ Q(x, y)dxdy."
  },
  {
    "id_": "f96438f2-559b-4a25-baaf-38e4b2c34134",
    "text": "# 4\n\nthat, compared to the type-s features, oriented along they (μm) kx direction, the type-r features, oriented along the ky direction, consist of spectral components with higher frequencies. Considering that smaller shapes in space correspond to higher spectral frequencies, we can conclude that the spots of absorbed energy are indeed, on average, compressed in the y direction and stretched in the x direction. The spatial spectra of Q(x, y) also provide information on the typical size of the absorbed energy spots. We can use this information to estimate the period of the resulting LIPSS and to distinguish LSFL from HSFL. The spectral components of Q(x, y) located at spatial frequencies close to or less than k0 are responsible for the formation of LSFL since they correspond to large spots with characteristic sizes less than or equal to the laser wavelength λ0. In turn, the spectral components of Q(x, y) at spatial frequencies much larger than k0 correspond to the small-scale sub-wavelength spots responsible for the formation of HSFL. In Fig. 2(d) we see that the highest frequency components of Q(x, y) spectrum lie in the region of 5k0 which means that the minimum size of the absorbed energy spots is approximately five times smaller than the laser wavelength λ0. Thus, we can predict that the minimum period of the resulting LIPSS will be λ0/5.\n\nNext, let us consider the same linearly polarized laser pulse but with the polarization rotated by 45 degrees relative to the x axis (θ = 45◦ in Eq. (2)). Figures 2(b) and (e) show the corresponding distribution of absorbed energy Q(x, y) and its spatial spectrum. From the comparison of Figs. 2(d) and (e) we see that the spectrum of Q(x, y) in Fig. 2(e) is rotated by 45 degrees, which means that the orientation of the corresponding absorbed energy spots is also changed. A closer look at the absorbed energy spots in Fig. 2(b) shows that they are indeed elongated along the polarization direction. Thus, our simulations confirm the known fact that the orientation of LIPSS follows the direction of laser polarization."
  },
  {
    "id_": "4e25b4fb-7cda-4a9b-975d-d132adf52ffa",
    "text": "# III. SEARCHING FOR CHIRAL LIPSS"
  },
  {
    "id_": "6d88468f-8fb5-42a3-a96e-aed70305bfae",
    "text": "# A. Linear and circular polarizations\n\nAs a starting point, let us consider a laser pulse that has linear polarization oriented along the x direction (ϵ = 0 and θ = 0◦ in Eqs. (2) and (3)). Figure 2(a) shows the distribution of the laser energy Q(x, y) absorbed by the stainless steel sample irradiated by such laser pulse. The surface roughness causes the distribution of Q(x, y) to resemble a chaotic pattern of absorbed energy spots. However, upon closer inspection we find that the regions of high absorption are elongated in the direction of laser polarization. Taking into account that the regions of high losses act as a seed for LIPSS growth, we can expect that the resulting LIPSS will be also oriented in the x direction — parallel to the laser polarization.\n\nTo obtain more information about the orientation and size distribution of the absorbed energy spots, we calculate the spatial spectrum of Q(x, y). Figure 2(d) shows the spectrum of Q(x, y) in the spatial-frequency coordinates kx and ky normalized by the wave number k0 = ω0/c0. We see that the spatial spectrum of Q(x, y) has a well-recognizable shape with spectral features known as \"type-s\" and \"type-r\" [26]. We also see that for all three polarization cases the total amount of absorbed laser energy Qtot is the same (the difference is less than numerical errors). We also checked that for a circularly polarized laser pulse with the opposite direction of polarization rotation (ϵ = −1) the distribution of absorbed laser energy Q(x, y) does not have any preferred orientation and the corresponding spatial spectrum is symmetrical about the origin."
  },
  {
    "id_": "718d18ad-d96b-4ea5-b9f7-d9a85589922f",
    "text": "# Linear (θ = 0◦)"
  },
  {
    "id_": "77c6827c-e9d9-4a7a-8aad-401dc6ebb25d",
    "text": "# Linear (θ = 45◦)\n\n|y (μm)|Circulark/ky|\n|---|---|\n|6|a|\n|4|b|\n|2|c|\n|0| |\n|−2| |\n|−4| |\n|−6| |"
  },
  {
    "id_": "fa9a0158-fff8-488c-bb0e-e16c384cb256",
    "text": "# FIG. 2.\n\nThe distributions of absorbed energy Q(x, y) (a,b,c) and their spectra (d,e,f) for laser pulses with linear polarization rotated by θ = 0◦ (a,d) and θ = 45◦ (b,e), and for a circularly polarized laser pulse (c,f). The arrows in (a–c) show the direction of the laser polarization. The arrows in (d) mark the characteristic spectral patterns known as ”type-r” and ”type-s” features.\n\nThe distribution of absorbed energy Q(x, y) changes insignificantly, while the total losses Qtot remain unchanged, indicating the absence of circular dichroism. Thus, we can conclude that the morphology of resulting LIPSS does not depend on the polarization handedness and, consequently, on the sign of the SAM."
  },
  {
    "id_": "ed72b656-12ea-45b5-b9fe-bcbf88083a4e",
    "text": "# B. Inhomogeneous polarization distribution\n\nAs we have just seen, for linearly polarized laser pulses the distribution of absorbed laser energy Q(x, y) looks like a set of elongated spots aligned along the polarization direction, which allows us to assert that the laser polarization determines the orientation of the resulting LIPSS. We can exploit this dependence on the polarization direction to obtain LIPSS with complex morphology. For this purpose we can use laser pulses with inhomogeneous polarization distribution, where the local polarization direction will determine the orientation of LIPSS at a given point. As an example, let us consider three laser pulses with the radial, spiral, and azimuthal polarization patterns. In terms of Eqs. (2) and (3) such laser pulses are defined by the linear polarization with ϵ = 0 and the spatially-dependent polarization angle θ(x, y) = arctan(y/x) + ψ, where ψ ∈ [−π/2, π/2] determines the angle between the polarization direction and the radius vector of a given point with the coordinates x and y. In particular, ψ = 0 and ψ = ±π/2 correspond to the radial and azimuthal polarization patterns, respectively, while the intermediate values of ψ define the spiral polarization patterns of different vorticity (the sign of ψ allows us to switch between the left-handed and right-handed rotation of the spiral). Experimentally, such laser pulses can be generated, for example, using so-called q-plates [56]. Figure 3 shows the distributions of absorbed laser energy Q(x, y) and their spectra obtained for laser pulses having the radial (ψ = 0), spiral (ψ = π/4), and azimuthal (ψ = π/2) polarization patterns as a result of their interaction with the rough stainless steel surface. The arrows in Figs. 3(a)–(c) allow us to visualize the distribution of the polarization for each of the patterns. Figures 3(a)–(c) show that, as expected, locally the spots of absorbed laser energy are oriented along a given polarization direction, forming a distribution that repeats the polarization pattern; the central region with zero absorption appears due to the zero on-axis intensity caused by the polarization singularity at this point. Since the regions"
  },
  {
    "id_": "a35aa101-0dcc-4834-bef1-ee6ece8765e9",
    "text": "# 6"
  },
  {
    "id_": "426de498-958c-4f33-ad3d-647acd9068d8",
    "text": "# Radial (ψ = 0)"
  },
  {
    "id_": "f73b773a-150b-4189-991e-6cfa78da4594",
    "text": "# Spiral (ψ = π/4)"
  },
  {
    "id_": "d7f1bbf0-404a-4237-b593-7d6c3ad4d97b",
    "text": "# Azimuthal (ψ = π/2)\n\n|y (μm)|k/ky|0|\n|---|---|---|\n|6|a| |\n|4| | |\n|2| | |\n|0| | |\n|−2| | |\n|−4| | |\n|−6| | |\n\n|x (μm)|0.0|\n|---|---|\n|−6| |\n|−4| |\n|−2| |\n|0| |\n|2| |\n|4| |\n|6| |"
  },
  {
    "id_": "9788c855-8d98-4493-9224-280117024fd9",
    "text": "# FIG. 3.\n\nThe distributions of absorbed energy Q(x, y) (a,b,c) and their spectra (d,e,f) for laser pulses with inhomogeneous polarization distribution defined by the polarization rotation angle θ(x, y) = arctan(y/x) + ψ with ψ = 0 for the radial (a,d), ψ = π/4 for the spiral (b,e), and ψ = π/2 for the azimuthal (c,f) polarization patterns. The arrows in (a–c) indicate the direction of the laser polarization in a given point.\n\nof high losses act as seeds for the formation of LIPSS, the resulting LIPSS will be organized in accordance with the polarization pattern. Such intricate LIPSS formations, obtained using complex polarization states, have already been observed in several experiments [38–40]. Thus, the laser pulses with spiral polarization distributions allow us to create LIPSS patterns with controllable vorticity.\n\nInterestingly, Fig. 3(d)–(f) show that the spectra of Q(x, y) for the radial, spiral, and azimuthal polarization patterns are practically identical and resemble the spectrum obtained for the circularly polarized laser pulse (see Fig. 2(f)). We can explain this observation by the fact that for each of the three polarization patterns there are regions in the beam cross section containing all possible orientations of linear polarization. As a result, the final spectrum can be seen as a set of Q(x, y) spectra for a linearly polarized laser pulse (see Figs. 2(d) and (e)), averaged over all possible angles of polarization.\n\nDuring the simulation, we did not find any significant difference in the total absorbed energy Qtot between the laser pulses with the radial, spiral, and azimuthal polarization — the maximum difference did not exceed 0.5%. We also verified that the value of Qtot does not change by any noticeable amount for laser pulses having the spiral polarization with an opposite handiness given by θ(x, y) = arctan(y/x) − π/4. Thus, we can conclude that the total amount of absorbed laser energy is insensitive to the polarization vorticity."
  },
  {
    "id_": "70d24d68-a952-4b62-984f-a11bb7a508d6",
    "text": "# C. Orbital angular momentum\n\nIn the previous section we saw that it is possible to create chiral LIPSS formations using inhomogeneous polarization states. Let us now explore the possibility of creating chiral LIPSS patterns using laser pulses carrying OAM. According to the Sipe’s theory [21] LSFL arise as a result of interference between incident laser radiation and surface electromagnetic waves generated by scattering on a rough surface. Therefore, we can expect that for laser pulses with OAM, their interference with the light scattered on the surface will form a pattern of interference maxima which will inherit the helical structure of the wavefront and which, being imprinted on the surface in the form of regions of high absorption, will lead to emergence of chiral LIPSS. In order to explore this possibility we consider a linearly polarized laser pulse (ϵ = 0 and θ = 0◦ in Eqs. (2) and (3)) with a helical phase."
  },
  {
    "id_": "01545246-3dd7-4736-af19-862692623551",
    "text": "# Optical angular momentum (ℓ = +1)"
  },
  {
    "id_": "76f7883c-b9cb-4203-86ac-dca474fed186",
    "text": "# FIG. 4. The distribution of absorbed energy Q(x, y) (a) and its spectrum (b) for the linearly polarized laser pulse carrying OAM with the topological charge ℓ = +1.\n\nThe arrows in (a) show the direction of the laser polarization.\n\n| |0|2|4|6|8|10|\n|---|---|---|---|---|---|---|\n|−6|0.0|0.2|0.4|0.6|0.8|1.0|\n|−4|0.0|0.2|0.4|0.6|0.8|1.0|\n|−2|0.0|0.2|0.4|0.6|0.8|1.0|\n|0|0.0|0.2|0.4|0.6|0.8|1.0|\n|2|0.0|0.2|0.4|0.6|0.8|1.0|\n|4|0.0|0.2|0.4|0.6|0.8|1.0|\n|6|0.0|0.2|0.4|0.6|0.8|1.0|"
  },
  {
    "id_": "9551c17e-8246-41f7-a93e-25f67df4abaf",
    "text": "# FIG. 5. Geometry of the fractal structure on the surface of stainless steel used to study the response of a surface with its own chirality.\n\nThe line plots show the cross-sections of the fractal structure at y = 0 (top) and x = 0 (right).\n\nϕ(x, y) = ℓ arctan(y/x), where ℓ is an integer number known as the topological charge. The magnitude of ℓ dictates the number of rotations the wavefront undergoes in one period of the laser pulse, while the sign of ℓ indicates the direction of this rotation.\n\nFigure 4 shows the distribution of absorbed laser energy Q(x, y) and its spectrum for the laser pulse having the OAM with ℓ = +1. In Fig. 4(a) we see that the Q(x, y) distribution does not show any traces of vorticity and is very similar to the distribution obtained for a linearly polarized laser pulse with a flat phase (see Fig. 2(a)): the only difference is the region of zero losses in the center, corresponding to the zero on-axis intensity caused by the phase singularity at that point. In turn, a comparison of Fig. 4(b) with Fig. 2(d) shows that the spectra of the laser pulse with OAM and a conventional linearly polarized laser pulse are practically identical.\n\nIn our studies we also considered laser pulses with higher values (up to 10) and different signs of the topological charge ℓ. However, the shape of the resulting distribution of absorbed laser energy did not show any traces of chirality. Thus, we can conclude that the presence of OAM in the laser pulse does not affect the distribution of absorbed laser energy and, therefore, does not change the geometry of LIPSS."
  },
  {
    "id_": "f4c81b51-f088-4e18-9a5c-aaee73a998a4",
    "text": "# D. Fractal surface structures\n\nAs we saw above, contrary to our expectations, when a laser pulse interacts with a rough surface, the presence of OAM does not change the distribution of the absorbed laser energy. However, how might the surface’s own chirality affect the interaction with the rotating wavefront in a hypothetical context of helical dichroism? From experiment we know that at least individual chiral nanostructures are capable of responding differently to the sign of the OAM in the incoming laser pulse [57]. Therefore, we can expect that the distribution of absorbed laser energy on a surface containing some chiral structures will be different for laser pulses with different OAMs.\n\nBut what kind of chiral structures should we choose to maximize the response to incoming laser pulses? Of course, we could conduct a parametric study by playing with the size, shape, and arrangement of an array of chiral nanoparticles deposited on the surface. However, we decided to simplify the problem by taking a surface with a fractal chiral structure applied to it. As such fractal structure we consider the Julia set J(f) defined from the function f(z) = z² + c with c = −0.5125 + 0.5213i and protruding 100 nm above the flat surface. Figure 5 shows the resulting geometry of the fractal stainless steel surface used in our simulations. We see that the fractal nature of the Julia set allows us to obtain a surface structure consisting of chiral elements whose scale starts at a few wavelengths and gradually decreases to sub-wavelength sizes."
  },
  {
    "id_": "0e94f9d3-71b9-49d8-823c-bbe5de24acc6",
    "text": "# 8\n\n|Without OAM (ℓ = 0)|With OAM (ℓ = +1)|\n|---|---|\n|||\n|||\n\nFIG. 6. The distributions of absorbed energy Q(x, y) (a,b) and their spectra (c,d) for linearly polarized laser pulses interacting with the fractal surface structure. (a) Laser pulse without OAM (ℓ = 0) and (b) with OAM of topological charge ℓ = +1. The arrows in (a,b) show the direction of the laser polarization.\n\nscan a whole range of chiral structures of different scales, some of which will have to be in resonance with the incident radiation.\n\nFigure 6 shows the distributions of absorbed energy Q(x, y) and their spectra obtained as a result of the interaction with the fractal surface of linearly polarized laser pulses without (ℓ = 0) and with (ℓ = +1) OAM. In Figs. 6(a) and (b) we see that, apart of the central region in Fig. 6(b) with zero losses caused by the phase singularity, both distributions of Q(x, y) do not contain any significant differences visible to the naked eye that could distinguish the cases of ℓ = 0 and ℓ = +1. In Fig. 6(c) and (d) we see that the spectra of Q(x, y) contain more high-frequency spectral component compared to the case of a linearly polarized laser pulses interacting with the rough surface (see Fig. 2(d)). This is because, compared to a rough surface, the fractal structure consists of much smaller scatterers. The only visible difference between the spectra in Fig. 6(c) and (d) is observed in the region of zero frequencies and is due to the presence of a zero-loss spot in Fig. 6(b). We verified that changing the sign of the topological charge ℓ does not lead to any visible changes. We also tested laser pulses with OAM of higher topological charges (up to ℓ = ±10), but did not find any effect of OAM. Additionally, our simulations show that the total absorbed energy Qtot is insensitive to the sign of the topological charge ℓ, independently of the amplitude of ℓ. Thus, we can argue that the presence of chiral structures on the surface does not guarantee that the absorbed energy distribution, and therefore the geometry of resulting LIPSS, will sense the presence of OAM. Furthermore, in the context of positive feedback from repeated laser pulses at the same location, there should be no enhancement of the chiral effect."
  },
  {
    "id_": "52ef5b4b-b23c-4155-9d7c-8f255d5ef5d2",
    "text": "# E. Spiral intensity distribution\n\nSo far, we have not identified a configuration where a laser pulse with OAM produces chiral distributions of absorbed laser energy that could induce the formation of chiral LIPSS. However, instead of seeking a direct OAM effect, we can exploit OAM indirectly to create a spiral intensity distribution. We can expect that such intensity distribution, being imprinted on the surface, will lead to a spiral arrangement of LIPSS. To obtain the spiral intensity pattern we can superimpose a focused OAM laser pulse with a second one having a plane wave front [58, 59]. To recreate such a combination of laser pulses in our simulations, we use the sum of"
  },
  {
    "id_": "940e1ca4-0b73-4ce3-8467-93b19f5fd256",
    "text": "# FIG. 7. The distributions of absorbed energy Q(x, y) (a,b,c) and their spectra (d,e,f) for linearly polarized laser pulses with spiral intensity distribution obtained using OAMs with topological charges ℓ = +1 (a,d), ℓ = +5 (b,e), and ℓ = +10 (c,f). The arrows in (a,b,c) show the direction of the laser polarization.\n\n|ℓ = +1|ℓ = +5|ℓ = +10|\n|---|---|---|\n||||\n\na plane-wave x-polarized laser pulse (ϵ = 0 and θ = 0° in Eqs. (2) and (3)) and a laser pulse with the phase given by ϕ(x, y) = ℓ arctan(y/x) − k0px² + y² sin δ, where the first term defines the helical wave front associated with the OAM and the second term describes a conical phase intended to simulate tight focusing with a convergence angle of δ. We assume that δ = 20°, which corresponds to the focusing with the numerical aperture NA = sin δ = 0.34."
  },
  {
    "id_": "344d8750-74ed-47fe-aef0-4bea18e6c684",
    "text": "# Absorbed energy (arb.u.) Spectrum (arb.u.)\n\nFigure 7 shows the distributions of absorbed energy Q(x, y) and their spectra for the laser pulses with the spiral intensity distribution obtained with OAMs having the topological charges ℓ = +1, +5, and +10. In Fig. 7(a,b,c) we see that the spiral intensity pattern of the incident laser pulse is imprinted on the rough stainless steel surface in the form of large-scale spiral regions where absorption occurs. We can control the geometry of these spiral arrangements by changing the amplitude of the topological charge ℓ, which determines the number of spiral arms, and by its sign, which is responsible for the direction of the spiral twist. Within each arm of the spiral regions we see a chaotic distribution of absorbed energy spots aligned along the polarization direction, similar to that observed in the case of linearly polarized laser pulses (see Fig. 2(a)). The spatial spectra of Q(x, y) in Fig. 7(d,e,f) also resemble the spectrum obtained for a linearly polarized laser pulse with a flat phase (see Fig. 2(d)) with the difference that the large-scale spiral formations generate many spectral components at near-zero frequencies. Thus, we see that we can use OAM indirectly to create large-scale controllable arrangements of chiral LIPSS by generating spiral intensity distributions with given parameters."
  },
  {
    "id_": "1b9e710f-6937-40de-9858-bbf0ecc39f84",
    "text": "# IV. TWISTING OPTICAL FORCES"
  },
  {
    "id_": "1c78773e-299e-45a6-bc5f-a73d83b48ef5",
    "text": "# A. When orbital angular momenta do work\n\nIn the previous section we observed that despite our extensive efforts, we were unable to detect any direct effect of OAM on the distribution of absorbed laser energy during the interaction of laser pulses with rough surfaces. Therefore, there is a high probability of making a premature conclusion that OAM can not provoke the appearance of LIPSS with chirality. As we know from the literature, in certain situations, the laser pulses carrying OAM can sculpture chiral material structures [47, 60]."
  },
  {
    "id_": "e3de1d53-7d36-46da-ae2d-0cce7ca99a8f",
    "text": "# 10\n\nample, when a surface is irradiated by a nanosecond laser pulse with OAM, nanoscale twisted needles form in the region where the beam has the phase singularity. The twisting direction of these needles can be reversed by altering the sign of the topological charge ℓ. These observations have been made across various materials, including tantalum [45, 48], aluminum [61], copper [60], silicon [62], silver and gold thin films [46] and even azopolymers [63]. Interestingly, chiral surface relief formation was only observed when the handedness of the circular polarization aligned with that of the optical vortex. In contrast, it was suppressed when their signs were opposite [64]. This behavior highlights the effects of constructive and destructive coupling between SAM and OAM to achieve spiral surface reliefs. In these studies, optical radiation force has been widely invoked as the driving force for mass transport that occurs during the melting process.\n\nAccording to Eq. (5) only the first term on the right-hand side contributes to ⃗ftot, since the time integral of the second term, containing the time derivative, is equal to zero. We can see this from the following simple considerations. Since the electric ⃗E and magnetic H fields oscillate at ⃗ the same frequency, both of them can be described by the same harmonic function. In turn, the time derivative of ⃗E results in a shift of half a period (e.g., the derivative of a sine is a cosine and vice versa). Therefore, ∂⃗E/∂t × ⃗H is an odd function of time whose temporal integral has to be zero. Thus, the total force ⃗ftot can be simply written as ⃗ftot = −ε0χR ∞−∞(⃗∇ · E)E dt. In what follows we consider only the transverse optical forces given by the first intensity-dependent term in Eq. (5)."
  },
  {
    "id_": "3f114115-0df6-411a-be5f-aaa09dcb11ab",
    "text": "# B. Expression for optical forces\n\nTo understand in which cases laser pulses with OAM can transfer their vorticity to matter, let us consider the optical forces with which laser pulses act on the medium. In case of a single particle of charge q moving with velocity ⃗v, the electromagnetic field of a laser pulse acts on this particle with the Lorentz force determined by the expression q(⃗E + ⃗v × ⃗B). Therefore, if we have a material of volume V with the charge density ρ, then the overall force acting on this material from the electromagnetic field will be equal to RV ρ(⃗E + ⃗v × ⃗B) d3r = RV(ρ⃗E + ⃗J × ⃗B)d3r, where ⃗J = ρ⃗v is the current. According to this equation, the force ⃗f acting on a unit volume of the material is given by ⃗f = ρ⃗E + ⃗J × ⃗B. Therefore, if we have a bulk material with an induced polarization ⃗P, where the density of charges ρ = −⃗∇ · ⃗P and the current ⃗J = ∂⃗P /∂t, then the force applied to a unit volume of such material will be ⃗f = −(∇ · ⃗P)E + ∂⃗P /∂t × ⃗B.\n\nConsidering a medium with a linear response, we can write ⃗P = ε0χ⃗E, where χ is the material susceptibility. Using this expression for the polarization ⃗P together with the equality ⃗B = μ0 ⃗H, we can finally express the force ⃗f acting on a unit volume of the medium from the electromagnetic field of the laser pulse as:\n\n⃗f = −ε0χ(⃗∇ · E)E + ε0μ0χ ∂⃗E × ⃗H."
  },
  {
    "id_": "62cbabf9-2e07-4898-8b90-4989f64afe52",
    "text": "# C. Linear and circular polarizations\n\nFirst, to give an intuitive idea of optical forces, let us consider a linearly polarized laser pulse (ϵ = 0 and θ = 0° in Eqs. (2) and (3)). Figure 8 shows the x components of the electric field, intensity, the snapshots of the transverse optical force at several points in time and the corresponding total force for the Gaussian and Laguerre-Gaussian beam shapes. The distributions of instantaneous optical force are presented at times t = −T /4."
  },
  {
    "id_": "21c029d0-2a26-4612-a500-69037ecda643",
    "text": "# 11"
  },
  {
    "id_": "fd211222-e59c-4a33-bf7f-f3dc72fd1f5d",
    "text": "# (a) Linear polarization, Gaussian beam\n\n|(μm)|(μm)|(μm)|(μm)|(μm)| | | | | |\n|---|---|---|---|---|---|---|---|---|---|\n| | | | | |Intensity|1.0|0.8|0.6|0.4|\n|0|−20| | | | |0.2|0.0|−15| |\n|−10|−5|Time t (fs)|5|10| | | | | |\n|15|t = −T /4|−T /8|0|T /8|T /4| | | | |"
  },
  {
    "id_": "77812400-a6a3-4f3e-9e04-27c91e225b47",
    "text": "# Total force\n\n|1.0|0.8|0.6|0.4|0.2|0.0|\n|---|---|---|---|---|---|\n|−20|0|20|−20|0|20|\n|−20|x (μm)|0|20|−20|0|"
  },
  {
    "id_": "ac192c71-2952-4f93-be07-92103994b94d",
    "text": "# (b) Linear polarization, Laguerre-Gaussian beam\n\n| | | | | |Intensity|1.0|0.8|0.6|0.4|\n|---|---|---|---|---|---|---|---|---|---|\n|0|−20| | | | |0.2|0.0|−15| |\n|−10|−5|0|5|10| | | | | |\n|15|t = −T /4|−T /8|0|T /8|T /4| | | | |"
  },
  {
    "id_": "e555b547-a217-4240-b4c7-772792a51044",
    "text": "# Total force\n\n|1.0|0.8|0.6|0.4|0.2|0.0|\n|---|---|---|---|---|---|\n|−20|0|20|−20|0|20|\n|−20|x (μm)|0|20|−20|0|\n\nFIG. 8. Electric field Ex (isovalues at levels ±0.1 V/m), intensity, the snapshots of optical force at times t within half an optical period T (the exact times are shown by minor ticks on the time axis) and the total force ⃗ftot for linearly polarized laser pulses with the Gaussian (a) and Laguerre-Gaussian (b) beam shapes. The arrows on the total force plot show the direction of laser polarization. The complete time evolution of optical forces is shown in the supplementary movies: movie8a.mp4 for (a) and movie8b.mp4 for (b).\n\n−T /8, 0, T /8, T /4, that is within half the optical period T = λ0/c0. We visualize the force distributions only during one half of the period because, according to Eq. (5), the transverse optical force given by the first term depend on the intensity and thus have a periodicity of T /2. In Fig. 8 we see that the vectors of optical force are directed along the polarization direction, while their magnitude oscillates with the electric field, reaching its maximum at the field crests. We also observe that the optical force vectors, while remaining parallel to the polarization, point away from regions of high intensity. In particular, for the Laguerre-Gaussian beam, there are force components directed toward the dark core of the beam. Despite the oscillation of the force amplitude in time, the total force ⃗ftot for the both beam shapes mirrors the instantaneous force distributions.\n\nIntensity (arb.u.) Force (arb.u.) Intensity (arb.u.) Force (arb.u.)\n\nNext, we consider the optical forces produced by circularly polarized laser pulses (ϵ = 1 and θ = 0◦ in Eqs. (2) and (3)). Figure 9 presents the x components of the electric field, intensity, the snapshots of the transverse optical force together with the total force for both beam shapes: Gaussian and Laguerre-Gaussian. Here we see that the amplitude of the optical force do not fluctuate with the field, but the force vectors, following the instantaneous direction of laser polarization, rotate along with the electric field vector. As a result of this rotation, the total force ⃗ftot becomes averaged over all possible angles. For the Gaussian beam shape, the vectors of ⃗ftot point in all directions from the beam center. In turn, for the"
  },
  {
    "id_": "2853d4b2-188c-4e82-b488-cf15c736d057",
    "text": "# 12"
  },
  {
    "id_": "ece21f74-4539-45e0-88c4-f181b6f082a2",
    "text": "# (a) Circular polarization, Gaussian beam\n\n|(μm)|(μm)|(μm)|(μm)|(μm)|\n|---|---|---|---|---|\n|Intensity|1.0|0.8|0.6|0.4|\n|0|−20|0.2|0.0|−15|\n|−10|−5|Time 0 t (fs)|5|10|\n|15|t = −T /4|−T /8|0|T /8|\n|T /4|Total force|1.0|0.8|0.6|\n|0|−20|0.4|0.2|0.0|"
  },
  {
    "id_": "b2b59e2b-2a5e-4c6b-8940-8c7a0595a819",
    "text": "# (b) Circular polarization, Laguerre-Gaussian beam\n\n|Intensity|1.0|0.8|0.6|0.4|\n|---|---|---|---|---|\n|0|−20|0.2|0.0|−15|\n|−10|−5|Time t (fs)|5|10|\n|15|t = −T /4|−T /8|0|T /8|\n|T /4|Total force|1.0|0.8|0.6|\n|0|−20|0.4|0.2|0.0|\n\nFIG. 9. Electric field Ex (isovalues at levels ±0.1 V/m), intensity, the snapshots of optical force at times t within half an optical period T (the exact times are shown by minor ticks on the time axis) and the total force ⃗ftot for circularly polarized laser pulses with the Gaussian (a) and Laguerre-Gaussian (b) beam shapes. The arrows on the total force plot show the direction of laser polarization. The complete time evolution of optical forces is shown in the supplementary movies: movie9a.mp4 for (a) and movie9b.mp4 for (b).\n\nLaguerre-Gaussian beam shape, the vectors of ⃗ftot, which different configurations of such laser pulses, defined using Eqs. (2) and (3): (i) a linearly polarized laser pulse with ϵ = 0 and ℓ = +1, (ii) a circularly polarized laser pulse with ϵ = 1 and the same topological charge ℓ = +1, and (iii) a circularly polarized laser pulse with ϵ = 1 and the opposite topological charge ℓ = −1. Figure 10 shows the x components of the electric field together with the laser pulse intensity, as well as the distributions of the optical force (both the time snapshots and the total force) for all three laser pulse configurations. In Fig. 10(a) we see that for the linearly polarized laser pulse the optical force vectors remain parallel to the polarization direction. However, the helical wavefront caused by OAM results in a distinctive rotation of the overall force distribution. Nevertheless, this rotation averages out over time, and"
  },
  {
    "id_": "2d4848da-db86-43cf-a77c-1203ac18069a",
    "text": "# FIG. 10. Electric field Ex (isovalues at levels ±0.1 V/m), intensity, the snapshots of optical force at times t within half an optical period T (the exact times are shown by minor ticks on the time axis) and the total force ⃗ftot for laser pulses carrying the OAM with the topological charge ℓ:"
  },
  {
    "id_": "ceebcdf6-277b-4976-8804-eb269815a38e",
    "text": "# (a) Linear polarization, OAM (ℓ = +1)\n\n|y (μm)|x (μm)|Intensity|\n|---|---|---|\n|20|0.8|1.0|\n|0|0.6|0|\n|-20|0.4|0.0|\n|-15|0.2|0.0|"
  },
  {
    "id_": "ed6f4953-168c-4235-a292-589cc8e78863",
    "text": "# Time t (fs)\n\n|t|Total force|\n|---|---|\n|-T /4|1.0|\n|-T /8|0.8|\n|0|0.6|\n|T /8|0.4|\n|T /4|0.2|"
  },
  {
    "id_": "ba88d3ef-f958-4749-b4bb-427572b54c5a",
    "text": "# (b) Circular polarization, OAM (ℓ = +1)\n\n|y (μm)|x (μm)|Intensity|\n|---|---|---|\n|20|0.8|1.0|\n|0|0.6|0|\n|-20|0.4|0.0|\n|-15|0.2|0.0|"
  },
  {
    "id_": "758e9197-342c-4366-8e80-a0037cd5c6ab",
    "text": "# Time t (fs)\n\n|t|Total force|\n|---|---|\n|-T /4|1.0|\n|-T /8|0.8|\n|0|0.6|\n|T /8|0.4|\n|T /4|0.2|"
  },
  {
    "id_": "f5a0a663-d80a-413e-978c-56daf52af756",
    "text": "# (c) Circular polarization, OAM (ℓ = −1)\n\n|y (μm)|x (μm)|Intensity|\n|---|---|---|\n|20|0.8|1.0|\n|0|0.6|0|\n|-20|0.4|0.0|\n|-15|0.2|0.0|"
  },
  {
    "id_": "b0ddaec3-eccd-42b5-852e-70a85fde200d",
    "text": "# Time t (fs)\n\n|t|Total force|\n|---|---|\n|-T /4|1.0|\n|-T /8|0.8|\n|0|0.6|\n|T /8|0.4|\n|T /4|0.2|"
  },
  {
    "id_": "3882ec1c-1322-4747-9cee-398560985d94",
    "text": "# 14\n\nIn the figure showing the total force distribution, there is no indication of the presence of OAM (compare with the total force distribution for a simple linearly polarized laser pulse in Fig. 8(b))."
  },
  {
    "id_": "2e346be2-f089-4766-a55d-81208aa1ce0a",
    "text": "# Fig. 10(b)\n\ndepicts the distributions of the optical force for a circularly polarized laser pulse, where the rotation of the polarization and wavefront occurs in the same direction (ϵ = 1 and ℓ = +1). As in the case of a circularly polarized laser pulse with a plane wave front (see Fig. 9(b)), we observe a comparable rotation of the optical force vectors, though with a different force distribution. In particular, we see that the force distribution has four distinct lobes. Also we note that there are no force components directed toward the dark core of the beam.\n\nAs a result, the total force distribution consists only of force vectors directed outward from the beam center. We also note the absence of the net twisting force."
  },
  {
    "id_": "07ea8802-533a-45a5-9a81-d807fb3b5eef",
    "text": "# Fig. 10(c)\n\nshows the distribution of optical force for the circularly polarized laser pulse where the helical wavefront rotates in the direction opposite to the direction of laser polarization (ϵ = 1 and ℓ = −1). As we can see, such combination of the polarization rotation and the wavefront twist results in the force distribution without the lobes, in contrast to the case of co-rotating polarization and the wavefront shown in Fig. 10(b). This behavior of the force distribution reflects the results of adding and subtracting SAM and OAM. In Fig. 10(c) we also see that the force amplitude oscillates over time. In particular, we observe the appearance of the alternating twisting force (see the force snapshots at times t = −T /8 and T /8). However, because the twisting occurs in opposite directions, the resulting twisting averages out, causing all vectors in the total force distribution to align along the radial direction. Unlike the previous case of co-rotating polarization and wavefront (see Fig. 10(b)), here we see that most of the force is directed towards the beam center. As in the previous case, the distribution of ftot do not contain any net twisting force.\n\nThe above examples show that laser pulses with OAM are capable of twisting matter within the laser pulse duration even in the case of linear polarization. However, they do not leave any twisting force in the wake of the laser pulse as it passes. Therefore, to create chiral material structures with such laser pulses, the pulses need to be long enough for the pulse front to melt the material and the tail to induce a vortex. A multi-pulse configuration, where the first pulse melts the surface and subsequent pulses twist the molten material, could potentially achieve this effect as well."
  },
  {
    "id_": "62b43292-34e0-4a19-b215-24877eb37ff3",
    "text": "# E. Focused laser pulses\n\nAbove, we found that although laser pulses with OAM can introduce the twisting force, they exert the corresponding torque on the matter only during the pulse duration. However, the formation of chiral material structures would be much more efficient if the laser pulse could create a net twisting force in its wake. In order to find such net twisting forces, let us consider focused OAM laser pulses. Note that in many LIPSS experiments the laser pulses are already focused on the sample surface, so adding external focusing in our analysis seems quite natural. Here we consider the same set of OAM laser pulses introduced previously (see Fig. 10): the linearly polarized laser pulse with ϵ = 0 and ℓ = +1, the circularly polarized laser pulse with ϵ = 1 and ℓ = +1 (co-rotating polarization and wavefront), and the circularly polarized laser pulse with ϵ = 1 and ℓ = −1 (counter-rotating polarization and wavefront). Similarly to the case of spiral intensity distribution, to model the external focusing we introduce the phase ϕ(x, y) = ℓ arctan(y/x) − k0px2 + y2 sin δ, where the first term is responsible for the OAM and the second one for the focusing. For better visual appeal we consider a very smooth focusing with the convergence angle δ = 1° corresponding to N A = sin δ = 0.017.\n\nFigure 11 shows the x component of the electric field, laser pulse intensity, and distributions of optical force (instantaneous and total) for the focused OAM laser pulses introduced above. As we can see from the plots of the electric field, the presence of the phase term responsible for the focusing leads to a distortion of the wavefront: the electric field located closer to the beam center turns out to be lagging in time relative to the peripheral one. Note that the wavefront distortion affects the periodicity with which the optical force changes. Therefore, in the figures with the focused laser pulses, we plot the distributions of the instantaneous optical force at the moments of time t = −T /2, −T /4, 0, T /4, T /2, that is within the full optical period T, rather than its half, as we did for the previous figures. The figures with the instantaneous optical force show that the external focusing results in additional vorticity of the corresponding force distributions. Nevertheless, in Fig. 11(a) we see that despite this additional vorticity, the distribution of the total force ftot for a linearly polarized laser pulse does not indicate the presence of any net twisting force. However, in both cases of a circularly polarized laser pulse, we clearly see that the distributions of ftot have a residual vorticity. Thus, we can conclude that in focused laser pulses with OAM, it is the circular polarization that leads to the emergence of net twisting force. This effect is likely related to the recent observations of clockwise and counterclockwise nanopillar arrays fabricated using left- and right-handed circular polarizations at ZnO surface [66].\n\nIn light of the above observation, the question arises as to whether it is possible to obtain the net twisting force in focused circularly polarized laser pulses without OAM. To answer this question let us consider circularly polarized laser pulses with the Gaussian and Laguerre-Gaussian beam shapes focused by some external focusing element. We model such pulses by setting ϵ = 0, θ = 0° and phase ϕ(x, y) = −k0px2 + y2 sin δ in Eqs. (2) and (3) together with a corresponding beam shape in Eq. (6)."
  },
  {
    "id_": "59780a92-14a5-40f0-89dd-f3f8ba0cc7eb",
    "text": "# FIG. 11. Electric field Ex (isovalues at levels ±0.1 V/m), intensity, the snapshots of optical force at times t within an optical period T (the exact times are shown by minor ticks on the time axis) and the total force ⃗ftot for focused laser pulses carrying an OAM with the topological charge ℓ:"
  },
  {
    "id_": "33197970-9e7a-41c6-a63c-bcf441ffa711",
    "text": "# (a) linear polarization with ℓ = +1\n\n|y (μm)|x (μm)|Intensity|\n|---|---|---|\n|20|0|1.0|\n|0|0|0.8|\n|−20|0|0.6|\n|−15|−10|0.4|\n|−5|0|0.2|\n|0|0|0.0|"
  },
  {
    "id_": "efa021d9-45ec-4a67-90ac-2f8e5ec6841e",
    "text": "# (b) circular polarization with ℓ = +1\n\n|y (μm)|x (μm)|Intensity|\n|---|---|---|\n|20|0|1.0|\n|0|0|0.8|\n|−20|0|0.6|\n|−15|−10|0.4|\n|−5|0|0.2|\n|0|0|0.0|"
  },
  {
    "id_": "209c016e-b3ff-4595-8538-d14bff8ed132",
    "text": "# (c) circular polarization with ℓ = −1\n\n|y (μm)|x (μm)|Intensity|\n|---|---|---|\n|20|0|1.0|\n|0|0|0.8|\n|−20|0|0.6|\n|−15|−10|0.4|\n|−5|0|0.2|\n|0|0|0.0|"
  },
  {
    "id_": "6004060f-a2df-4890-a974-468d8568863b",
    "text": "# V. CONCLUSIONS\n\nOur results demonstrate the potential of vortex laser beams to induce unique surface morphologies on rough metallic surfaces. By varying polarization, orbital angular momentum, and initial pre-structures with chiral properties, we assess the conditions under which these beams can generate chiral excitations that result in intricate patterns, such as spiral and helical structures. Unlike conventional beams, the distinctive phase and polarization distributions of vortex beams enable the formation of complex, asymmetrical surface structures, providing new insights into the formation of LIPSS.\n\nContrary to our initial expectations, OAM in a laser pulse does not alter the distribution of absorbed laser energy on a rough surface or induce chiral LIPSS. Additionally, the presence of chiral structures does not ensure that the absorbed energy distribution will reflect OAM effects, making positive feedback from repeated pulses unlikely to enhance these effects. While we did not identify a configuration where OAM directly produces chiral distributions, we demonstrated that OAM can indirectly create a spiral intensity distribution by interfering with a plane wave. However, this approach does not achieve resolution below the laser wavelength. To explore mechanisms effective at the subwavelength scales, we examined the features of twisting optical forces.\n\nLaser pulses with OAM exhibit varying behaviors based on polarization. For linearly polarized pulses with OAM, the optical force vectors align with the polarization but show a rotating distribution due to the helical wavefront, which averages out over time, leaving no net twisting force. Circularly polarized pulses with co-rotating OAM also show a rotation but lack force components directed toward the beam center, resulting in a radial force distribution. For counter-rotating OAM, the twisting force oscillates over time, leading to a net radial force with no residual twisting. Our investigation highlights that focused circularly polarized laser pulses, with or without OAM, are crucial for generating a net twisting force, which could influence subsequent thermo-mechanical processes.\n\nIn conclusion, the combination of orbital and spin angular momenta significantly enhances the flexibility of surface functionalization. Structured light interacting with material surfaces enables advanced material processing with a level of control that surpasses conventional methods. As a key contribution of this work, we highlight the possibility of manipulating LIPSS via spiral intensity distributions and applying optical torque forces, expanding the applicability of LIPSS to areas such as biomimetic design, chiral sensing or enantiospecific surface physical chemistry. While we have shown that structured light can break conventional symmetry and induce rotating surface deformations, the development of self-formed coherent structures with adjustable chiroptical properties will open up new possibilities for diversifying the morphologies of LIPSS and designing advanced nanoarchitectures. To fully realize these potential applications, especially in nano-manufacturing, refining these methods is crucial. Further investigation should focus on how structured light interacts with more sophisticated materials, including those with inherent helical dichroism, to improve control over surface structures and enhance the functional applications of these chiroptical effects."
  }
]
