[
    {
        "id_": "c7789000-7906-45fd-bcf8-14283b55d5ce",
        "text": "# 1. INTRODUCTION\n\nThe abundance, spatial distribution, rotation velocity, and sizes of low-mass galaxies (stellar mass M < 109 M☉) in the Milky-Way (MW) and similar galaxies in the local Universe (D < 100 Mpc) can inform the fundamental physics of a range of models for galaxy formation and the nature of dark matter (see Bullock & Boylan-Kolchin 2017; Sales et al. 2022 for reviews). A number of physical processes could potentially impact the properties of low-mass galaxies, including cosmic reionization photoionizing gas in low-mass (sub)halos and shutting down their star formation completely since z < 6 (Bullock et al. 2000; Somerville 2002); stellar feedback preventing further star formation and creating dark matter cores that make subhalos more prone to tidal stripping (Governato et al. 2012; Pontzen & Governato 2012; Zolotov et al. 2012; Jiang et al. 2021); alternative dark matter models suppressing the non-linear power spectrum curtailing structure growth on small scales (e.g., Bode et al. 2001; Nadler et al. 2021); the specific assembly history of the host galaxy such as a recently infalling Large Magellanic Cloud (LMC, Nadler et al. 2020) can all lead to significant changes in the abundance and radial distributions of satellites.\n\nHere, we systematically investigate a major contributing effect that could significantly alter the predicted abundance and radial distributions of satellites and their subhalos: the enhanced mass loss due to the strong tidal forces from the baryonic mass content (stars and gas) of their host galaxies. This effect was originally brought forward as a potential resolution to the small-scale challenges of the ΛCDM cosmological model, i.e. the missing satellite problem (Klypin et al. 1999; Moore et al. 1999) and the too-big-to-fail problem (TBTF, Boylan-Kolchin et al. 2011, 2012; Tollerud et al. 2014), that could mitigate the order-of-magnitude gap between predicted abundances of subhalos in dark-matter-only simulations and observations."
    },
    {
        "id_": "84c51c82-3b16-4ea7-9b4a-0ab06cbf6320",
        "text": "# WANG ET AL.\n\n(DMO) simulations (e.g., Springel et al. 2008; Kuhlen et al. 2009; Stadel et al. 2009; Garrison-Kimmel et al. 2014; Mao et al. 2015; Griffen et al. 2016; Nadler et al. 2023b) and the observed number of low-mass satellites in the Milky Way (e.g., McConnachie 2012).\n\nThe enhanced mass loss effect from the host galaxy is primarily studied using pairs of hydrodynamic simulations and DMO counterparts starting out from the same initial conditions, focusing on satellites around MW-mass halos (Sawala et al. 2013; Brooks & Zolotov 2014; Sawala et al. 2015; Wetzel et al. 2016; Zhu et al. 2016; Despali & Vegetti 2017; Sawala et al. 2017; Garrison-Kimmel et al. 2017; Graus et al. 2018; Samuel et al. 2020; Barry et al. 2023; Jung et al. 2024). It is revealed that significant suppression of satellite and subhalo abundances occur, especially near host centers for subhalos with smaller pericenters and more radially-biased velocities due to the addition of baryons (stars and gas) compared to the DMO case. Since this effect is primarily due to the central galaxy’s mass concentration, it is, in principle, agnostic towards the specific treatment of star formation and feedback physics in the hydrodynamic simulations.\n\nTo further isolate the pure gravitational effect of the central galaxy, several simulation works further combined analytic disk potentials with DMO zoom-in simulations (D’Onghia et al. 2010; Errani et al. 2017; Garrison-Kimmel et al. 2017; Kelley et al. 2019). These explorations also discovered similar levels of subhalo abundance suppression as hydrodynamic simulations when compared to their DMO counterparts. These studies interpreted reduced subhalo abundances as complete physical disruption and thus concluded that the central galaxy alone could potentially solve the missing satellites and TBTF problems.1 However, we will argue that reduced subhalo abundances above a peak (or present-day) mass threshold is not evidence of physical disruption; rather, it indicates enhanced mass loss which is in agreement with recent semi-analytic studies (Green et al. 2022). Furthermore, previous studies often implicitly assume that satellite galaxies hosted by subhalos would “disrupt” along with the subhalo itself, which is also an oversimplification as “orphan” galaxies out-surviving their subhalos are required to match observations (Behroozi et al. 2019) and depends on the specific resolution of the simulation used (Mansfield et al. 2023). Thus, we are motivated to revisit how disk potentials affect subhalo populations in both the MW and “typical” MW-mass halos.\n\nThe MW lives in a halo that has a virial mass of Mvir → 1012 M⊙ (Bland-Hawthorn & Gerhard 2016; McMillan 2017; Gaia Collaboration et al. 2018; Posti & Helmi 2019; Watkins et al. 2019; Cautun et al. 2020; Labini et al. 2023). All the DMO-embedded disk simulations mentioned above focused on MW-mass halos with Mvir → 1012 M⊙ and embedded massive disk potentials similar to M⊙, our Galaxy (Md ↭ 5 ↓ 1010 M⊙, Licquia & Newman 2015; Bland-Hawthorn & Gerhard 2016; McMillan 2017; Cautun et al. 2020). Furthermore, in simulations such as D’Onghia et al. (2010) (fixed disk-to-halo mass ratio) and Phat ELVIS (abundance matching M⊙ to Mvir, Behroozi et al. 2013a), the simplistic disk growth models adopted does not account for diversity in halo assembly and stellar mass growth in a correlated manner. Although Garrison-Kimmel et al. (2017) used more physical disk formation histories from their hydrodynamic runs, their sample size was limited to only two MW-mass hosts. Therefore, a large parameter space of disk-to-halo mass ratios and disk growth histories is yet to be explored for MW-mass halos in terms of their subhalo abundance suppression effects.\n\nIn this work, we aim to fill this gap by better quantifying subhalo abundances over a wider range of disk masses and disk formation histories in MW-mass halos. We present the EDEN (Exploring Disks Embedded in N-body) simulations where we re-simulate 45 Mvir → 1012 M⊙ MW-mass halos from the Symphony (Nadler et al. 2023b) zoom-in simulation compilation with embedded analytic disk potentials. Two technical highlights of this work are that: i) EDEN evolves disk growth according to the empirical galaxy–halo connection model UNIVERSE MACHINE (UM hereafter; Behroozi et al. 2019; Wang et al. 2021) that explicitly correlates the star formation history with the halo assembly history; ii) EDEN uses the state-of-the-art particle-tracking subhalo finder SYMFIND (Mansfield et al. 2023) to enable more robust subhalo tracking. We investigate the reduction in the abundance of subhalos as a function of host mass, subhalo mass, 3D and pericenter distances to their hosts, and infall times. As the disk mass has a dominant impact on subhalo mass loss rates over other factors like disk radius, scale height, and density profiles (Garrison-Kimmel et al. 2017; Green et al. 2022), we further re-simulate nine of our 45 zoom-in halos with ↓2.5 heavier disk potentials while keeping the form of their disk growth histories fixed. This subset of higher-disk-mass simulations, along with the main set of EDEN simulations, provides good sampling of subhalo abundance suppression over the full range of central galaxy stellar masses for typical Mvir → 1012 M⊙ MW-mass halos.\n\nBy more realistically modeling subhalos’ tidal evolution compared to DMO simulations, EDEN also provides the groundwork for a better understanding of how halo assembly drives satellite radial distributions and radial quenching trends. In the 101 observed MW-mass hosts from the Satellite Around Galactic Analogs (SAGA) Survey (Geha et al. 2017; Mao et al. 2021, 2024; Geha et al. 2024; Wang et al.\n\n1 The latter problem is addressed because heavier subhalos experience stronger dynamical friction and sink more quickly toward halo centers, where the disk effects are strongest."
    },
    {
        "id_": "d9568626-9689-47bc-8941-e74159ef60e1",
        "text": "# EDEN: EXPLORING DISKS EMBEDDED IN N-BODY SIMULATIONS\n\n2024), the average satellite radial distribution is less concentrated than the typical NFW (Navarro et al. 1996) host dark matter density profile (Mao et al. 2024). The UM-SAGA model (Wang et al. 2024) fit to SAGA satellite data also finds it hard to produce quenched satellite radial distributions as concentrated as the observed satellites. Both of these findings point to the potential effect of the baryonic disk significantly affecting satellite abundance radial distributions. However, in a smaller set of Local Volume (ELVES, Carlsten et al. 2021, 2022; Greene et al. 2023; Danieli et al. 2023) hosts that cover a broader host mass range than SAGA, Carlsten et al. (2020) found that their satellites have a more concentrated radial distribution than many DMO and hydrodynamic simulations, although being largely consistent with the top 25% concentration hosts in SAGA (Mao et al. 2024). This diversity in MW-mass host satellite radial distributions bolsters our emphasis on modeling subhalo populations in a way that accounts for the diversity in disk masses and formation histories, truly placing satellites in our Galaxy (McConnachie 2012; Brown et al. 2014; Weisz et al. 2014, 2015; Savino et al. 2023) in the cosmological context of more diverse MW-mass host environments surveyed in ELVES and SAGA.\n\nThis paper is structured as follows: in Section 2, we introduce the MW-mass halos from Symphony and how we embed disk potentials into these zoom-in simulations; in Section 3, we review the (mis)concept of subhalo “disruption” and discuss why we refrain from interpreting our results with such a term in this work; in Section 4 we present key results including the effect of disk-to-halo mass ratio on subhalo abundance, subhalo peak mass functions, 3D and peri-centric radial distributions, and subhalo infall time distributions; in Section 5 we discuss the various caveats of EDEN, as well as how to interpret our results in broader theoretical and observational contexts; in Section 6 we summarize our findings. We adopt a flat ΛCDM cosmology with H0 = 70 km s-1 Mpc-1, Ωm = 0.286, ΩΛ = 0.714, ns = 0.96, and σ8 = 0.82."
    },
    {
        "id_": "aa78f3fd-c22a-486b-abbb-13c302dc11b2",
        "text": "# 2. METHODOLOGY\n\nHere, we present the methodology for embedding disk potentials into the Symphony Milky Way DMO simulations. Section 2.1 summarizes basic properties of the Symphony compilation (Nadler et al. 2023b); Section 2.2 introduces how we apply the galaxy–halo model UM to Symphony and retrieve the stellar mass growth histories of the MW central galaxies. Section 2.3 summarizes the disk density components and how we embed them into EDEN host halos at z = 3; in Section 2.4 introduces the nine-host subsample that is re-simulated with 2.5× higher disk mass."
    },
    {
        "id_": "17493c9e-c4e0-4fc6-8b88-0c5a3850f2fe",
        "text": "# 2.1. Symphony Milky Way dark-matter-only zoom-ins\n\nThe Symphony compilation (Nadler et al. 2023b) is a set of cosmological zoom-in DMO simulations that focuses on 262 host halos across four decades in halo mass, covering Large-Magellanic-Cloud-mass (LMC for short), MW-mass (Mvir → 1012 M⊙ to 1014.5 M⊙) halos, Group-mass (Mvir → 1011 M⊙), and Cluster-mass (Mvir → 1013 M⊙). The zoom-in host halos are mostly isolated, and the simulations have, in principle, enough resolution to resolve all dark matter halos that host observable satellite galaxies in the Universe (down to Mvir,sub → 1.5 × 107 M⊙).\n\nIn this work, we focus on the 45 MW-mass host halos from Symphony. Originally, these halos were selected from the Chinchilla c125-2048 cosmological simulation (Mao et al. 2015) with masses Mvir /M⊙ ≈ 1012.1±0.03. Resolution is increased within ‘zoomed-in’ Lagrangian regions that contain particles within ≈ 10Rvir of the MW hosts at z = 0. The initial conditions for the zoom-in regions are generated with the public code MUSIC (Hahn & Abel 2011). Halos were then re-simulated from z = 99 using GADGET-2 (Springel 2005). All the simulations in this suite have particle masses of mDM = 4 × 105 M⊙ and adopt a comoving Plummer-equivalent force softening scale of ε = 243 pc in the high-resolution zoom-in region. This mass resolution is equivalent to having 81923 particles in the 125 h-1 Mpc parent box c125-2048. In EDEN, we re-simulate these systems with the same particle resolution and force softening while embedding disk potentials (see Section 2.3).\n\nHalos in Symphony were identified using the phase-space halo finder ROCKSTAR (Behroozi et al. 2013b). We use the Bryan & Norman (1998) virial overdensity definition, which is equivalent to an overdensity of Δc = 99.2 at z = 0. Halo merger trees are constructed using CONSISTENTTREES (Behroozi et al. 2013c). We use these CONSISTENTTREES catalogs to track subhalos before they cross into their hosts’ virial radii (Rvir,host). We use the SYMFIND (Mansfield et al. 2023) particle-tracking subhalo finder after subhalo infall for more reliable subhalo tracking, which is a major improvement of this work over previous non-particle-tracking halo finders used to analyze embedded-disk simulations (e.g., AHF, Knollmann & Knebe 2009, for Garrison-Kimmel et al. 2017 and ROCKSTAR for Kelley et al. 2019; Nadler et al. 2023b). All halo catalogs and merger trees for Symphony, including SYMFIND subhalo catalogs, are publicly available at https://web.stanford.edu/group/gfc/symphony/. The halo catalogs of the EDEN simulations presented in this work will be made public on the same website upon publication of this manuscript."
    },
    {
        "id_": "9d755194-81d3-4bf7-82d9-499bf7bc87e0",
        "text": "# 2.2. UniverseMachine star formation histories\n\nhttps://www-n.oca.eu/ohahn/MUSIC/\n\nhttps://wwwmpa.mpa-garching.mpg.de/gadget/\n\nhttps://bitbucket.org/gfcstanford/rockstar/src/main/\n\nhttps://bitbucket.org/pbehroozi/consistent-trees/src/main/"
    },
    {
        "id_": "6c21158d-048c-4f9d-899e-4acc2b997418",
        "text": "# WANG ET AL."
    },
    {
        "id_": "a437d185-dc7f-4e25-9539-48f692d37bb0",
        "text": "# Figure 1. Properties of EDEN host systems.\n\nLeft: Stellar mass–halo mass (SMHM) relation of the SymphonyMilkyWay hosts (blue dots, DMO) whose stellar masses are obtained using UNIVERSE MACHINE (UM). The blue-shaded regions are the 68% and 95% distributions of the global UM SMHM relation derived in the parent cosmological simulation of Symphony, Chinchilla c125-2048. The MW observations (red error bars) consist of stellar masses from Licquia & Newman (2015) (down triangle), Bland-Hawthorn & Gerhard (2016) (up triangle), McMillan (2017) (left triangle), Cautun et al. (2020) (right triangle) and halo masses from Bland-Hawthorn & Gerhard (2016); McMillan (2017); Cautun et al. (2020); Gaia Collaboration et al. (2018) (diamond), Posti & Helmi (2019) (pentagon), Watkins et al. (2019) (hexagon), Labini et al. (2023) (square). The magenta point shows M31 halo mass (Watkins et al. 2010) and stellar mass (Tamm et al. 2012) measurements. The observations indicate that the MW and M31 are ↭ 1ω above the typical stellar mass for an average Mvir → 1012 M↑ halo. Wherever only the halo or stellar mass of the MW is provided, we assign an arbitrary value to the other missing mass for clarity. The orange markers show previous embedded disk DMO simulations from Garrison-Kimmel et al. (2017) (crosses) and Phat ELVIS (diamonds, Kelley et al. 2019), which all target MW-like heavy disk systems.\n\nMiddle: UM-predicted stellar mass and stellar half-mass formation scale factor for the SymphonyMilkyWay hosts. Heavier disks also form earlier on average, with a Spearman rS = !0.50. The color bar shows the halo concentration of the MW-mass hosts, with earlier star-forming disks living in more concentrated halos.\n\nRight: Stellar versus halo half-mass scale factor for the 45 SymphonyMilkyWay hosts. Most of the MW halos have stellar masses that form later than their halo masses (the dashed line indicates a one-to-one relation). The color map is the same as the middle panel for halo concentration.\n\nWe use the UM-predicted stellar mass histories of MW host galaxies from Symphony (Nadler et al. 2023b). UM is a flexible empirical galaxy–halo connection model that predicts galaxy star formation rates (SFRs) given their host halo’s mass and assembly history. It is statistically constrained by observational data over a wide range of masses and redshifts (0 < z < 8), including stellar mass functions, galaxy quenched fractions, cosmic SFR densities, UV luminosity functions, and galaxy clustering. The latest version of UM, UM-SAGA, is additionally constrained by low-mass galaxy observations (M → ↫ 109 M↑) from the SAGA Survey and the Sloan Digital Sky Survey (SDSS, Geha et al. 2012).\n\nHere, MW stellar mass histories are derived using the zoom-in UM application method described in Wang et al. (2021), which uses the UM DR1 model (Behroozi et al. 2019) and joins together all 45 DMO zoom-in simulations for unbiased halo accretion rate ranking. We do not expect the choice to use the UM DR1 model vs. UM-SAGA to have any impact, since here we focus only on modeling the MW-mass host galaxies (M→ ↭ 1010 M↑), and the UM-SAGA update does not impact MW-mass galaxies (Fig. 5 in Wang et al. 2024).\n\nIn the left panel of Fig.1, we show the MW host halo masses (Mvir,host), the UM-predicted stellar (disk) masses for the MW galaxy (M→,Disk), the stellar half-mass formation scale factor (a→,1/2), and the halo half-mass formation scale factor (avir,1/2). We assume that the three-component disk potential (Section 2.3) contains the total stellar mass predicted by UM, and we use M → and M→,Disk interchangeably. Compared to the latest observational constraints on the MW’s halo mass (Bland-Hawthorn & Gerhard 2016; McMillan 2017; Gaia Collaboration et al. 2018; Posti & Helmi 2019; Watkins et al. 2019; Cautun et al. 2020; Labini et al. 2023), the SymphonyMilkyWay hosts have quite representative virial masses (mean Mvir → 1012.1 M↑). However, the MW has an atypically large (↭ 1ω) stellar mass (Licquia & Newman 2015; Bland-Hawthorn & Gerhard 2016; McMillan 2017; Cautun et al. 2020) for a halo of Mvir → 1012 M↑, and is larger than the average empirical SMHM relation from UM (Wang et al. 2021). We also show observational measurements of the halo mass (Watkins et al. 2010) and stellar mass (Tamm et al. 2012) of M31, which is even higher stellar-to-halo mass ratio. Previous embedded disk DMO simulations marked in orange from Garrison-Kimmel et al. (2017) and Kelley et al. (2019) all focused on MW-like high-disk-mass systems (↭ 1ω up scatter) for MW-mass halos around Mvir → 1012 M↑. Therefore, a large part of the M →,Disk /Mvir,host parameter space that the majority of MW-mass galaxies find themselves in has not yet been explored. EDEN aims to fill this important gap and provide a more comprehensive understanding of disk effects on subhalo abundances in MW-mass hosts with a range of galaxy formation histories."
    },
    {
        "id_": "c3a1dd1e-7ed4-4ddd-9110-36e93915c96c",
        "text": "# EDEN: EXPLORING DISKS EMBEDDED IN N-BODY SIMULATIONS"
    },
    {
        "id_": "202a618e-3667-487d-91ad-dcd7f8772abf",
        "text": "# 5"
    },
    {
        "id_": "91134731-2e50-4a2c-9233-cc1477f21632",
        "text": "# Figure 2. Stellar mass history of the disk in MW-mass systems.\n\nThe median history of the 45 SymphonyMilkyWay hosts (DMO) with UM-predicted stellar mass histories is shown (thick solid grey; shaded band indicates the [16%, 84%] distribution). The median history of nine halos with ↓2.5 higher disk masses, which are chosen randomly from the EDEN fiducial sample, is shown as dashed grey (Symphony M→,Disk ↓2.5); this sample is more consistent than the full Symphony suite with MW observations (left) and previous embedded disk simulations (right). The inferred MW SFHs in the left panel are from Garrison-Kimmel et al. (2017); Kelley et al. (2019), and the z = 0 M→ of the MW is from Cautun et al. (2020). Vertical dotted lines mark z = 3, when the disks are initialized.\n\nLeft panel: The thin gray lines indicate each individual Symphony host. Right panel: Our simulations are compared stellar mass histories in previous work, including two MW hosts in Garrison-Kimmel et al. (2017) (dashed orange curves), and Symphony hosts using abundance matching (AM, Behroozi et al. 2013a) (dashed turquoise). Phat-ELVIS (Kelley et al. 2019) used the same AM model; the dotted turquoise curve shows Symphony AM scaled to their final 10 M↑ mass of M→ = 5.9 ↓ 10.\n\nBesides covering a much broader range of disk-to-halo median stellar mass, which is consistent with the MW (M → = 1010.21 M↑ in Snaith et al. 2014 and M → = 1010.48 M↑ in Kruijssen et al. 2019), EDEN also accounts for the intrinsic scatter in disk formation histories due to the diversity in halo assembly. This is naturally achieved with the UM-predicted stellar mass growth histories of the disks, which includes a correlation between galaxy and halo growth.\n\nIn Fig. 1, we also show the wide distribution of star formation half mass scale (a→,1/2) ranging from 0.4 to 0.9, which anti-correlates with stellar mass and halo concentration cvir (middle panel), and are mostly later than their halo half-mass formation time scale (right panel). Disks with larger stellar masses also form earlier, giving them more time to tidally strip subhalos historically.\n\nIn Fig. 2, we show the UM-predicted stellar mass growth histories for each EDEN MW-mass host. We compare the host disk formation histories to observational constraints on the MW (Snaith et al. 2014; Kruijssen et al. 2019) in the left panel. The MW stellar mass growth histories are inferred from the chemical abundances of disk stars (red, Snaith et al. 2014) and the globular cluster age-metallicity relation (blue, Kruijssen et al. 2019). There are differences between the median EDEN star formation history and that of our Galaxy. This is mainly caused by the excessive early (lookback time ↭ 9 Gyrs) star formation in the real MW, making it more massive and earlier-forming than most EDEN hosts.\n\nIn the most recent nine Gyrs, EDEN hosts formed M → = 1010.33 M↑ values are placed at the population mean given their Mvir,host."
    },
    {
        "id_": "ea36a85a-67ae-44ae-ae69-4b0779809bcb",
        "text": "# 6 WANG ET AL.\n\nwithout resampling the intrinsic scatter. We also show a ‘scaled’ version of the Symphony AM model stellar mass growth histories that have their median M → normalized to the M →,Disk = 5.910 M↑ value adopted in Phat ELVIS. Compared to either FIRE-2 or Phat ELVIS, UM stellar mass growth histories cover a much broader range than previously adopted methods and especially better sample the low-M → and late-forming MW central galaxies (grey band). This crucial aspect of the present work helps us better place the MW’s disk in the context of a broader range of MW-mass halos.\n\nThese comparisons between disk growth models highlight the impact of employing UM stellar mass histories for EDEN: not only is the real MW biased towards higher disk masses and earlier star formation, but previous theoretical work has also left the wide range of disk masses and formation histories unexplored due to specific modeling choices. Therefore, EDEN, with its wider coverage of disk masses and formation histories, should provide a more comprehensive view of subhalo abundance in MW-mass halos."
    },
    {
        "id_": "1b0917c6-d117-4efe-892c-a205cb2d729d",
        "text": "# 2.3. Embedded disk potential setup\n\nWe initialize analytic disk potentials in the z = 3 snapshot of the SymphonyMilkyWay DMO simulations (similar to Garrison-Kimmel et al. 2017; Kelley et al. 2019). We restart the simulations from z = 3 and evolve the total equivalent mass of the disk potential in each host following their UM-predicted stellar mass histories (Fig. 2). We concatenate the output snapshots from the embedded disk simulations at z ↬ 3 with the z > 3 snapshots in their DMO counterparts for halo finding and merger tree construction.\n\nThe disk potential has three structural components:\n\n$(R, Z) = $ → (R, Z) + $ g (R, Z) + $ b (r),\n\nwhere $ → is the axis-symmetric stellar disk, $ g is the axis-symmetric gaseous disk, and $ b is the spherical bulge. Numerical tests in Garrison-Kimmel et al. (2017); Green et al. (2022); Santistevan et al. (2024) have shown that the disk mass is by far the most decisive factor in affecting subhalo abundances, hence our specific choices of disk geometry are sub-dominant compared to the disk mass (see discussions in Section 5.3). We choose the symmetry axis of the stellar and gaseous disks to be both fixed and aligned with the MW host halo’s spin at z = 0 throughout the simulation. In the following, we refer to the combined potential $(R, Z) when stating ‘disk potential’.\n\nFor the density profile of the stellar ($ → ) and gaseous ($ g ) disks, we assume that they both follow the commonly used Miyamoto–Nagai potential (Miyamoto & Nagai 1975):\n\n$ d (R, Z) = ! √(√ 2+ Z 2 + Rd) 2+ R2.\n\nHere, G is the gravitational constant, M d is the disk mass for stellar (0.60M → ) or gaseous (0.27M → ) disk, Rd is the disk scale radius (2.5 kpc for stellar and 7 kpc for gaseous at z = 0), and hd is the disk scale height (0.35 kpc for stellar disk and 0.084 kpc for gaseous at z = 0). The gas fraction is consistent with the latest empirical constraints on the HI to stellar mass ratio (Padmanabhan & Loeb 2020), which yields a gas-to-mass ratio of → 30% at z > 2 and → 15% at z < 1 for MW-mass halos (Fig. 1 in Padmanabhan & Loeb 2020). Our stellar disk scale radius is consistent with the MW’s thin (2.0 ± 0.2 kpc) and thick (2.6 ± 0.5 kpc) stellar disk constraints (Bland-Hawthorn & Gerhard 2016). The MW gaseous disk is less constrained with typically → 2↓ the radius of the stellar disk (Bland-Hawthorn & Gerhard 2016; Posti & Helmi 2019), indicating our assumption is reasonable. Our choice of the stellar disk scale height is representative of MW measurements that span from 140 to 430 pc using different stellar populations (McKee et al. 2015), while the gaseous disk scale height assumed is consistent with cold CO disk measurements of ↫ 100 pc (Heyer & Dame 2015). In addition to the CO disk, there is also a thin and a thick cold HI disk, both having radially varying scale heights (h > 200 pc, Valenti et al. 2016), and we do not model this subtlety in this work.\n\nFor the spherical bulge ($ b ), since it is only → 10% of the total disk mass, its specific density profile would not change our results significantly. Hence, without loss of generality, we assume a Hernquist potential profile (Hernquist 1990) for it:\n\n$ b (r) = ! r + r bGMb.\n\nHere, M b is the bulge mass (0.13M → ) and rb is the bulge scale radius (0.5 kpc). The stellar bulge mass measurement of the MW has large observational uncertainties (Robin et al. 2012; Nesti & Salucci 2013; Sofue 2013; Portail et al. 2015; Valenti et al. 2016; Portail et al. 2017), which gives a bulge-to-stellar mass fraction of 10 → 30%. Thus, our bulge fraction assumption of 13.1% is consistent with observational constraints. The bulge size choice follows from previous self-interacting dark matter simulations (Robles et al. 2019) that also implemented embedded disks. We note that this scale radius is consistent with the shorter axes of the MW bulge fitted using triaxial models (Launhardt et al. 2002; Robin et al. 2012), but larger than the → 0.1 kpc bulge radius fitted with spherical models (Nesti & Salucci 2013; Piffl et al. 2014).\n\nAt every snapshot, we assume 60%, 27%, and 13% of the total UM-predicted stellar mass to be distributed in the stellar disk, gaseous disk, and spherical bulge, respectively. The gaseous disk here is merely a more extended disk component. The combined disk potential has a mass that is a conservative lower bound of the central galaxy baryon mass as there is, on average, another 15% → 30% of gas mass in true galactic."
    },
    {
        "id_": "49957c9c-bcef-4928-a44a-5ab99edcb3f6",
        "text": "# EDEN: EXPLORING DISKS EMBEDDED IN N-BODY SIMULATIONS\n\ndisks. However, it is unclear if the effects of subhalo mass loss due to a true viscous gas disk can be well-approximated by an analytic potential without proper treatment of hydrodynamics. It has also been shown in previous embedded disk simulations (Garrison-Kimmel et al. 2017) and confirmed by our findings (Fig. 5) that a ↭ 30% change in disk mass does not create sizable differences in subhalo abundance that overcome the host-to-host scatter.\n\nIn our model, all characteristic sizes in the disk potential (Rd, hd, rb) evolve according to the mean mass-size relation evolution from 3D-HST (van der Wel et al. 2014), r ↗ (1 + z)0.75 M0.72 in their Table 2 for late-type galaxies with M → 1010. Apart from the redshift evolution of the total disk mass and physical sizes, we assume that the three components’ relative mass and size ratios in $(R, Z)$ are fixed throughout the simulation. We provide the detailed formulae of disk acceleration and density distribution in Appendix A.\n\nTo ensure that the embedded disk potentials are anchored to the MW host halo centers, we seed a ‘sink’ particle (Bate et al. 1995) at z = 3 in every halo when the disks are initialized. We move the low-resolution particle (mDM,low → 108 M☉ → 3 Mpc) to the halo center and initialize its velocity as the ROCKSTAR-defined halo velocity. We note that the sink particle mass is comparable to the disk mass at initialization and becomes < 1% of the disk mass at z ↫ 1. We modify GADGET-2 to self-consistently implement the additional gravity from the disk potential on the dark matter particles. At every time step, the sink particle location is first used to initialize the center of the disk potential. Then, the gravitational force from the disk potential is applied to every particle other than the sink, in addition to the N-body forces in between those particles. Finally, the net gravitational force from all other particles (N-body forces and back reactions on the disk) is exerted on the sink particle to advance its velocity and position. The large particle mass of the sink particle combined with the equivalent mass of the disk potential (already ↭ 103 than high-resolution particles at z = 3, Fig. 2) will keep the sink particle well-anchored to the MW center due to large dynamical friction (see Fig. 10). This procedure ensures a physical and stable implementation of the disk potential while adding negligible computational costs to the N-body simulation.\n\nUsing the disk potential, we can derive the corresponding density distribution from the analytic disk potential using the Poisson equation. We show an example 2D density distribution cross section in Fig. 3. We assume a total equivalent stellar mass of 2 ↓ 1010 M☉; the total disk density is shown in the top panel. In the bottom panel, we show the density ratio between the disk density and the underlying dark matter density to highlight where the disk dominates.\n\nTo explicitly isolate the effect of the disk mass, we randomly choose nine halos out of our suite of 45 EDEN halos and re-simulate them with ↓2.5 higher disk masses (con-"
    },
    {
        "id_": "5bf74424-f915-475a-ac4a-728835910159",
        "text": "# WANG ET AL.\n\nstant multiplicative factor) while fixing the shape of their disk growth histories. By doing this, we not only broaden our halo sample at high disk masses similar to our Galaxy, but we can also isolate the effect of varying disk masses on subhalo abundance. We show in Fig. 2 the median stellar mass growth history of the high-disk-mass subsample. They are more consistent with recent MW observations (top panel) and previous embedded disk simulations (bottom panel) than the full EDEN suite.\n\nIn the following, we refer to the set of 45 EDEN halos with UM-predicted M→ (z) as ‘EDEN fiducial’ (or EDEN for short) and the nine high-disk-mass subsample as ‘EDEN M →,Disk ↓ 2.5’; we refer to the DMO counterparts of ‘EDEN fiducial’, i.e. the 45 SymphonyMilkyWay halos, as ‘Symphony’; we refer to the nine DMO counterparts of ‘EDEN M →,Disk ↓ 2.5’ as ‘Symphony M →,Disk ↓ 2.5’."
    },
    {
        "id_": "603d9213-2248-4d13-b88f-5ee1f5bbe219",
        "text": "# 3. THE ALLURING MYTH OF “DISRUPTION”\n\nBefore presenting our results, we discuss some important issues related to their interpretation. The basic question is whether a reduction in subhalo peak (or present-day) mass functions should be interpreted as physical disruption—i.e., a reduction in subhalo abundances that would persist at any resolution level. Based on the recent literature, we argue that the safest and likely most accurate interpretation is instead that the disk enhances subhalo mass loss rates, such that objects are stripped below our resolution limit."
    },
    {
        "id_": "eb0943cc-0813-4800-bc70-c8c20f9db621",
        "text": "# 3.1. Background\n\nThe language that the field uses to describe mass loss in subhalos paints a picture in which subhalos are completely destroyed in a cataclysmic, discrete event: subhalos are said to “disrupt.” In previous embedded disk simulations (Garrison-Kimmel et al. 2017; Kelley et al. 2019), the abundance suppression in the subhalo peak mass function (SPMF) is used as a diagnostic for ‘disruption’ of subhalos instead of enhanced mass loss. The peak mass of subhalos do not change after infall, so if the subhalos only experience enhanced stripping and could still be tracked by the halo finder, there would be no suppression in the SPMF in the ideal case; whereas ‘disruption’ of subhalos would lead to objects no longer detectable and cause a reduction in the SPMF. However, this picture is not correct for DMO CDM subhalos, and the concept of disruption can conflate three distinct scenarios. Colloquially, a subhalo “disrupting” can mean any of the following:\n\n1. the point at which the subhalo is no longer self-gravitationally bound;\n2. the point at which the subhalo finding tools can no longer identify the subhalo; or\n3. the point at which the satellite galaxy the subhalo hosts has lost so much stellar mass that it would no longer be observable.\n\nAt first blush, meanings 1 and 2 may seem reasonable or even synonymous. Early CDM simulations and analytic arguments seemed to favor a picture in which subhalos could truly disrupt (e.g. Gonzalez-Casado et al. 1994; Hayashi et al. 2003). These arguments generally rely on comparing the characteristic energy injected into the subhalo by tidal shocks at pericenter to the total binding energy of the subhalo or by considering the properties of an isolated halo profile that was suddenly truncated. Although in detail these arguments break down (van den Bosch et al. 2018), even in modern simulations, individual subhalos can suddenly disappear from subhalo catalogs at high resolutions or can be seen to experience runaway mass loss while they are still resolved by the subhalo finder (e.g., Fig. 16 and Fig. 5 in Mansfield et al. 2023, respectively). But this apparent “disruption” is illusory for most subhalos. While it is true that high-mass subhalos experience so much dynamical friction that they sink to the centers of their host within a few orbits (often remaining self-bound even after the merger finishes: Han et al. 2016; Diemer et al. 2023; Mansfield et al. 2023), lower mass subhalos experience much less dynamical friction (e.g., van den Bosch et al. 2016). Idealized, high-resolution simulations show that low-mass subhalos with the high-internal-density “cuspy” profiles favored by CDM instead stay bound for much longer than the lifetime of the universe (Peñarrubia et al. 2010; van den Bosch & Ogiya 2018; van den Bosch et al. 2018; Errani & Peñarrubia 2020; Errani & Navarro 2021). This is true even for simulations that include embedded disk potentials (Green et al. 2022). The loss of high-resolution subhalos from simulation catalogs can be explicitly shown to be a combination of subhalo finder failures and numerical non-convergence (Mansfield et al. 2023), while being highly dependent on resolution and subhalo finder.\n\nThe near limitless durability of DMO subhalos in !CDM is caused by their density profiles; models that lower the inner density — for example, by modifying the nature of the dark matter particle — can accelerate mass loss rates and even lead to true, resolved unbinding (Nadler et al. 2021; Errani et al. 2023b; Yang et al. 2023; Nadler et al. 2023a; Du et al. 2024). This distinction makes it even more important to be careful about the term “disruption” in CDM contexts, as the term is a correct description of a physical process that is a hallmark of some alternative dark matter models. That said, even for non-!CDM models, it is worth being careful about what is and is not true disruption. The same processes that can numerically destroy DMO !CDM subhalos can accelerate the destruction of subhalos in other frameworks.\n\nThe third meaning above is on somewhat better theoretical footing for CDM subhalos: satellite galaxies can always"
    },
    {
        "id_": "eb83f1ae-e8dd-40ae-be00-0fd4576e5603",
        "text": "# EDEN: EXPLORING DISKS EMBEDDED IN N-BODY SIMULATIONS"
    },
    {
        "id_": "6028ed60-5052-4be1-b388-9d300911dfee",
        "text": "# 3.2. Interpreting EDEN Results\n\nThus, when evaluating the impact of the disk potentials on subhalo mass functions in our simulations, we do not say that decreased subhalo mass function amplitudes imply that the disk completely disrupts subhalos. Instead, we interpret this as evidence that disks accelerate subhalos’ mass loss rates.\n\nThis distinction holds even when we compare the subhalo peak mass function between DMO and Disk runs (Section 4.2). The peak halo mass Mpeak is the peak historical value of the halo virial mass Mvir, which reflects the pre-infall mass of subhalos before experiencing significant tidal stripping from their hosts. In the case of a suppressed SPMF, the increased mass loss rate causes subhalos to approach the numerical-driven limits of the sample more quickly. Given the discussion in Section 3.1, one may question the wisdom in evaluating SPMF at all: after all, at low masses, the SPMF is just the infall mass function minus subhalos that have either numerically disrupted or have been lost by the subhalo finder. Skepticism is warranted, but Mpeak-based measurements serve a legitimate purpose. The fact that subhalos must lose large amounts of dark matter mass prior to losing any stellar mass means that infall- and peak-based mass definitions tend to be better predictors of galaxy properties than the current halo mass (e.g., Reddick et al. 2013). In particular, Mpeak-selected subhalo samples have much higher small-radius number densities around their hosts than Mvir-selected samples (see review in Section 5.2 of Mansfield et al. 2023), in line with observations.\n\nIndeed, even when analyzed with SYMFIND, which is capable of tracing ↘ 90% of the subhalos at our minimum mass threshold to the mass scales at which galaxy disruption is likely to begin (Mansfield et al. 2023), the median value of Mvir/Mpeak in our sample is approximately 0.2 in both SymphonyMilkyWay and EDEN. This Mvir/Mpeak threshold is a factor of 2 to 4 higher than the masses that hydrodynamic simulations (Smith et al. 2016) and empirical models (Moster et al. 2018; Behroozi et al. 2019; Wang et al. 2024) predict that stellar mass loss should occur. Thus, the vast majority of subhalos considered in this paper would likely still host visible galaxies (if they had one to begin with). This means that the differences in Mpeak functions discussed below would likely qualitatively extend to stellar mass-selected samples, even if the quantitative translation would require significant modeling work (see Section 5.1 for further discussion)."
    },
    {
        "id_": "87a66ac7-90d1-44be-b2df-65f355af228f",
        "text": "# 4. RESULTS\n\nHere, we present the key results of EDEN. As we have reviewed in Section 3, there are important caveats regarding whether the reduction in subhalo mass functions in our disk simulations represents physical “disruption.” Due to these complications, we explicitly avoid the term “disruption” and instead describe how the disk suppresses subhalo peak and present-day mass functions; we also study the spatial and orbital dependence of these effects. In Section 4.1, we present the magnitude of subhalo mass function suppression due to the disk as a function of host stellar-to-halo mass ratio and demonstrate that a larger disk creates more subhalo mass loss; in Section 4.2 we present the subhalo peak mass functions; in Section 4.3 we present the subhalo radial distance and pericentric distance distributions; in Section 4.4 we present the subhalo infall time distributions."
    },
    {
        "id_": "ce2bb1e4-17e9-412f-a801-fb0123a16948",
        "text": "# 4.1. Disk-to-halo mass ratio as a critical factor for subhalo abundance\n\nTo intuitively visualize the effect of different disk-to-halo mass ratios on subhalo abundance, we show in Fig. 4 the projected dark matter density maps for four example halos from the EDEN and Symphony comparing their DMO and Disk counterparts. The four example halos fall in four quartiles of disk-to-halo mass ratios; this range creates a visually significant change in subhalo abundance. The larger the disk-to-halo mass ratios, the stronger the suppression of substructures, especially in the central regions of the host. We also note that the host central density becomes higher, and their shapes become rounder due to adiabatic contraction. The rounder halo shapes are qualitatively consistent with results from previous embedded disk simulations (Garrison-Kimmel et al. 2017; Kelley et al. 2019); we show the axis ratios in Appendix B.\n\nTo further quantify the effects of disk-to-halo mass ratio in subhalo abundance, Fig. 5 shows the subhalo count ratios within 100 kpc and Rvir,host between the EDEN fiducial Disk runs and their corresponding Symphony DMO runs."
    },
    {
        "id_": "50ecf8a3-3ea8-4ff1-8d4d-5a98c222e001",
        "text": "# WANG ET AL."
    },
    {
        "id_": "fd3d988e-8985-459a-b613-4a3e681bccbe",
        "text": "# Figure 4.\n\nDark matter density maps for four hosts in four quartiles of M→,Disk /Mvir,host increasing from top to bottom. The left column shows the SymphonyMilkyWay DMO halos and the right column shows their embedded disk counterparts in EDEN. The DMO and Disk density maps for each halo share the same color scales. The dashed circles mark out the virial radii and the scale bars denote 50 kpc h-1. It is apparent that subhalo abundance suppression becomes stronger with increasing M→,Disk /Mvir,host, especially in the inner regions of each host. The central density of the hosts also increases more from top to bottom due to higher adiabatic contraction with larger embedded disk potentials."
    },
    {
        "id_": "5355e21d-a842-4410-9f40-aed327b1ac1b",
        "text": "# EDEN: EXPLORING DISKS EMBEDDED IN N-BODY SIMULATIONS"
    },
    {
        "id_": "520e7e13-dc1d-4e93-b53a-db12a4d82070",
        "text": "# Figure 5\n\nThe top panel shows only subhalos within 100 kpc of their hosts, while the bottom panel shows all subhalos within the virial radii. Subhalo count ratios between EDEN Disk and Symphony DMO simulations for resolved subhalos with Mpeak ⊜ 300m DM.\n\nEach colored circle is a pair of Symphony/EDEN hosts, with M→,Disk /Mvir,host values from Symphony. The nine MW-mass hosts were re-simulated with M→,Disk ↓ 2.5 are shown with diamonds and lines connecting them with their EDEN fiducial runs. The color bar indicates the stellar half-mass formation scale factor.\n\nThe Spearman correlation coefficient between NDisk /NDMO and log 10 (M→,Disk /Mvir,host) for EDEN fiducial is r S = !0.60 for r < 100 kpc and r S = !0.74 for r < Rvir,host, which are statistically significant negative correlations. We also provide exponential fits to these relations whose best-fit parameters are shown in Table 1.\n\nThe Spearman rS and exponential fit are carried out on the combined set of EDEN fiducial and EDEN M→,Disk ↓ 2.5 simulations. The cyan crosses are the expected number ratio of subhalos in the absence of disk-induced mass loss due to adiabatic contraction (A.C.) from the disk potential.\n\nThe vertical red (MW, Cautun et al. 2020) and magenta (M31, Watkins et al. 2010; Tamm et al. 2012) bands mark the observational constraints for MW/M31. Orange crosses in the top panel denote the two DMO/Embedded-disk halo pairs from Garrison-Kimmel et al. (2017) whose hydrodynamic counterparts were simulated with FIRE-2 (Wetzel et al. 2023). Disk effects increasingly dominate over adiabatic contraction with increasing M→,Disk /Mvir,host."
    },
    {
        "id_": "14d6cee9-6431-4929-ad35-419900b3166e",
        "text": "# 12 WANG ET AL.\n\n(45). In both radial ranges, there are clear trends that subhalo abundance suppression is more effective in halos with larger M →,Disk /M vir,host. Since the halo mass range is quite narrow for the 45 SymphonyMilkyWay hosts (Fig. 1), the primary effect is of changing the disk mass; we have checked that we get almost identical results if we instead used M →,Disk (see also similar trends in hydrodynamic simulation FIRE-2, Fig. 6 in Samuel et al. 2020).\n\nAt low disk mass, M→,Disk /M vir,host ↫ 0.02, most EDEN halos demonstrate have ↫ 20% fewer subhalos than their disk-less counterparts within 100 kpc and ↫ 10% within Rvir,host. There are a few halos with NDisk /NDMO > 1. Physically, the addition of the disk can cause the adiabatic contraction of dark matter (Blumenthal et al. 1986; Ryden & Gunn 1987; Gnedin et al. 2004) and draw more subhalos into the host. Because the disk has two effects, one which increases subhalo abundance and another that decreases it, it is possible that if a low-mass disk’s effect on subhalo mass loss is weak, its host might end up having NDisk /NDMO > 1.\n\nWe apply the Blumenthal et al. (1986) adiabatic contraction model to the Symphony DMO hosts to quantify the expected enhancement in subhalo counts due to adiabatic contraction. This abundance represents the expected number of subhalos within 100 kpc or Rvir,host after including the disk as if the disk potential only contracts subhalo orbits and does not increase their mass loss rates. Assuming spherical symmetry, circular subhalo orbits, and conservation of angular momentum, we have:\n\nM DM (< r0 )r0 =[M DM (< r0 ) + M Disk (< r f )] r f.\n\nHere r0 is the distance to the MW host center in the DMO run, M DM (< r0 ) is the enclosed dark matter mass within r0, which is adiabatically contracted to a smaller sphere with radius r f after adding the disk potential. We assume that the location of the subhalos contract in the same manner as the underlying dark matter density profile of their host, such that subhalos located at r0 in SymphonyMilkyWay are expected to be at r f. We show the contracted subhalo count ratios within 100 kpc and Rvir,host in Fig. 5, which increases with increasing M →,Disk /M vir,host as expected. The EDEN hosts having NDisk /NDMO > 1 within 100 kpc all have low disk-to-halo mass ratios and their subhalo abundance increase are consistent with the predictions of the disk drawing more subhalos inwards due to adiabatic contraction.\n\nAt the massive disk mass end, where M →,Disk /M vir,host ↭ 0.02, NDisk /NDMO ≃ 1 and disk effects dominate over adiabatic contraction. The two EDEN halos with heavy disks that fall within the observational errors of the MW (blue band, Cautun et al. 2020), have 30 → 40% fewer subhalos within 100 kpc and 20 → 30% fewer subhalos within Rvir,host. We also show the subhalo count ratios for the nine halos in EDEN M →,Disk ↓ 2.5 and connect them with EDEN fiducial values. The average subhalo abundance suppression in the nine halos with heavier disks are more prominent in both radial ranges (side histograms), all having lower NDisk /NDMO with increasing M→,Disk /M vir,host. Three of these EDEN M →,Disk ↓ 2.5 hosts fall within the M31 disk-to-halo mass ratio range and two of them produces ↭ 50% subhalo abundance suppression within 100 kpc. The one outlier that shows a slight decreased subhalo counts at r < 100 kpc but an increased counts at r < Rvir,host after inserting a M→,Disk ↓ 2.5 disk is undergoing a major merger and experiences a boost in outskirt subhalo counts due to its infalling companion.\n\nApart from the effect of varying disk-to-halo mass ratio on subhalo abundance, a secondary trend with disk half-mass formation scale a→,1/2 is also present in the color coding of the data points in Fig. 5. This is a consequence of heavier disks also growing their disks earlier (Fig. 1), which could impact their subhalo populations longer and lead to more suppression as the disk preferably loses subhalos with earlier infall times (Fig. 8). Therefore, the additional variations in disk formation history could further enhance the suppression in subhalo abundance caused by varying disk masses.\n\nTo summarize our findings, disk effects on subhalo abundance is sensitive to the disk-to-halo mass ratio of the host. The MW and M31 are amongst the most efficient systems in subhalo abundance suppression due to their atypically large M→,Disk /M vir,host. Disk effect on subhalo abundances is weak for small M →,Disk /M vir,host ↫ 0.02 hosts. For large M →,Disk /M vir,host ↭ 0.02 hosts, disk effects dominate over adiabatic contraction and become stronger with increasing disk-to-halo mass ratios. We fit the log 10 (M →,Disk /M vir,host )-NDisk /NDMO relation jointly for the 45 EDEN fiducial halos and nine EDEN M →,Disk ↓ 2.5 halos, using an exponential functional form whose best-fit parameters are provided in Table 1. The Spearman rank correlation coefficients for these joint relations are rS = !0.60 within 100 kpc and rS = !0.74 within Rvir,host, both being statistically significant negative correlations between subhalo counts suppression and M →,Disk /M vir,host.\n\n**Table 1. Best-fit parameters for y = NDisk /NDMO as a function of x = log10 (M→,Disk /Mvir,host) shown in Fig. 5.**\n|Range|a|x0|\n|---|---|---|\n|r < 100 kpc|2.64 ± 1.05|0.61 ± 0.10|\n|r < Rvir,host|1.21 ± 0.39|0.67 ± 0.10|"
    },
    {
        "id_": "3da17c94-fdb7-45b8-8cec-bb59bbb22846",
        "text": "# EDEN: EXPLORING DISKS EMBEDDED IN N-BODY SIMULATIONS"
    },
    {
        "id_": "66d2b01e-5d76-4cb9-87a1-e7725a3d0c95",
        "text": "# 4.2. Subhalo peak mass functions\n\nFigure 6. The subhalo peak mass function (SPMF) for z = 0 surviving subhalos. Left and right panels show the SPMF functions within 100 kpc and Rvir,host, respectively. The bottom sidebars in each panel show the SPMF ratios relative to the median DMO SPMF in that radial range. In each panel, the solid curve is the median SPMF for Symphony (blue, DMO) and EDEN fiducial (red, Disk). The shaded region in each panel shows the 68% host-to-host scatter in Symphony or EDEN. The red dashed curves are the average SPMF for the nine hosts in EDEN M→,Disk ↓ 2.5, while the blue dashed curves are their DMO counterparts in Symphony. Subhalo abundance suppression is mass-independent only in the high-disk-mass subsample, and high-mass subhalos are preferentially lost in EDEN fiducial. The vertical dashed lines mark out the resolution limit of subhalos in this work (Mpeak ⊜ 300m DM → 1.2 ↓ 10).\n\nFurthermore, the SPMF of EDEN M →,Disk ↓ 2.5 is independent of the subhalo masses, in line with previous embedded disk simulations that targeted MW-like heavy disk systems (Garrison-Kimmel et al. 2017; Kelley et al. 2019). Comparing the median SPMF in Symphony and EDEN fiducial, the impact of the disk is stronger within 100 kpc than within Rvir,host, indicating radially dependent suppression (see Fig. 7). In addition to the change in amplitude, the slope of the SPMF is steeper in EDEN than in Symphony, indicating that the disk is more effective at removing mass from high-mass subhalos than it is for low-mass subhalos.\n\nWe also compare the median SPMF of the nine halos in the EDEN M→,Disk ↓ 2.5 subsample with their Symphony DMO counterparts. Their DMO counterparts, labeled as ‘Symphony M →,Disk ↓ 2.5’, show a similar median SPMF to the full Symphony suite, suggesting that this nine-halo subsample is an unbiased representation of the 45 Symphony halos. However, the SPMF of the EDEN M →,Disk ↓ 2.5 halos are more suppressed than the EDEN fiducial median SPMF at all resolved subhalo masses for both r < 100 kpc and r < Rvir,host, which is another manifestation of subhalo abundance suppression being sensitive to the disk-to-halo mass ratio (Fig. 5)."
    },
    {
        "id_": "12181b3d-aaf9-46ca-98a1-2c4428df1f2f",
        "text": "# 4.3. Subhalo radial distribution\n\nAs shown in Section 4.2, subhalo abundance suppression in our disk simulations is radially dependent, with most of the suppression happening at the inner 100 kpc. In this section, we show the subhalo radial distributions in terms of their final distances to their MW hosts’ center as well as their orbital pericenter distances."
    },
    {
        "id_": "1f58bb90-ba64-4621-b420-62bb10014a4e",
        "text": "# 14 WANG ET AL."
    },
    {
        "id_": "7887ae9b-2053-4d0e-bdc8-c0e648e88cca",
        "text": "# Figure 7. Subhalo radial cumulative distributions for resolved subhalos with Mpeak ⊜ 300m DM (1.2 ↓ 108 M↑).\n\nThe left panels show the subhalo abundance versus the z = 0 distance (r) to the MW host center, and the right panels show the radial cumulative function of their orbit pericenter distances (dperi). Solid curves show average subhalo radial distributions for the Symphony (blue) and EDEN (red); shaded regions with the same color denote the corresponding 68% host-to-host scatter. The dashed red curve shows the average subhalo radial distribution for the nine halos in EDEN M→,Disk ↓ 2.5, and the blue dashed curve shows the corresponding DMO subsample in Symphony. The lower side panels show the CDF ratio of each curve relative to Symphony. The triangles in the right panel denote the scale radii of the ‘stellar’ (S, 2.5 kpc) and ‘gaseous’ (G, 7 kpc) disks of the embedded potential. Subhalo abundance suppression becomes weaker for subhalos penetrating into the inner parts of the disk potential. We caution that these radial distributions may change significantly due to numerical resolution (Mansfield et al. 2023).\n\nIn the left panel of Fig. 7, we show the cumulative radial distributions of subhalo distances to their hosts at z = 0. The median EDEN fiducial CDF is more suppressed at all radii than the median CDF for Symphony, with slightly more suppression happening towards smaller radii (r ↫ 50 kpc). However, the lowering of the CDF median is within the 68% host-to-host scatter of the 45 halos. EDEN M →,Disk ↓ 2.5 magnifies the radial CDF suppression effect, with most of the subhalo abundance suppression happening at r ↫ 100 kpc relative to their Symphony DMO counterparts. These findings indicate that the surviving subhalo population may not have significantly altered radial profiles due to the disk unless in very high disk-to-halo mass ratio systems like in the MW or EDEN M →,Disk ↓ 2.5.\n\nIn the right panel of Fig. 7, we show the radial distributions for subhalo orbital pericenter distances. To derive pericenter distances, we use cubic splines to interpolate between the lookback time of simulation snapshots and the location of subhalos relative to their hosts. The interpolation is required since the snapshot cadence (→ 160 Myr at z = 0 and → 40 Myr at z = 3) is usually too coarse to resolve the time period near each subhalo’s pericenter. The interpolated subhalo and host halo trajectories were then evaluated on 10 Myr cadences during the period when both the subhalo and their host halo existed. The minimum distance between the subhalo and host halo on this 10 Myr grid is then defined as the pericenter distance.\n\nFrom Fig. 7, we can see most of the abundance suppression happens for subhalos with dperi ↫ 100 kpc. The pericenter distance CDF for EDEN fiducial has a larger suppression than in its radial distance CDF (left panel) and is → 1ω lower than the Symphony pericenter CDF. This reveals that the disk potential preferentially removes mass from subhalos that came closer to it during pericenter, whereas subsequent orbital motion smears out this signal in the radial CDF. Increasing disk-to-halo mass ratios creates an even larger suppression at fixed r as shown in the EDEN M →,Disk ↓ 2.5 CDF, with most of the additional suppression happening at dperi ↫ 50 kpc.\n\nTo summarize, halos with disks have fewer subhalos that fall on orbits with pericenter distances dperi ↫ 100 kpc. Increasing the disk mass increases subhalo abundance suppression strength, especially at dperi ↫ 50 kpc. We caution that these radial trends in subhalo abundances should be interpreted as qualitative instead of quantitative as subhalo radial distributions can change significantly (Mansfield et al. 2023)."
    },
    {
        "id_": "ba41889f-e12b-4169-a494-b3a6f65a333b",
        "text": "# 4.4. Subhalo infall times"
    },
    {
        "id_": "f944d981-6130-430b-bf5d-07ee48473a37",
        "text": "# EDEN: EXPLORING DISKS EMBEDDED IN N-BODY SIMULATIONS"
    },
    {
        "id_": "2fe1d22a-b438-4f21-ab09-be3bf9756e10",
        "text": "# Figure 8. Subhalo counts ratio as a function of their first-infall lookback-time into the MW host for resolved subhalos with Mpeak ⊜ 300 m DM (1.2 ↓ 108 M↑).\n\nThe left panel shows subhalos within 100 kpc, and the right panel shows subhalos within Rvir,host. The orange circles denote the EDEN fiducial halos, and the turquoise diamonds denote the nine halos in EDEN M→,Disk ↓ 2.5. The shaded bands are Poisson errors on the subhalo count ratios. The subhalos removed from our sample by the inclusion of a disk are preferentially those with earlier infall times.\n\nAs we have shown in the previous sections, subhalo abundance suppression in the presence of a galactic disk is sensitive to the disk-to-halo mass ratio, the subhalo peak mass, and subhalo orbit pericenter distances. As found in Phat ELVIS (Kelley et al. 2019), subhalos that fell in earlier to their hosts are more preferentially stripped than later-infalling subhalos (see also Fig. 1 in Jiang & van den Bosch 2017). The physical intuition behind this effect is that earlier-infalling subhalos fell in when their host halos were smaller and have systematically smaller pericenters (Wetzel & White 2010), leading to stronger tidal stripping from the disk that enhance their mass loss. In the following, we investigate if this effect is generic in EDEN as Phat ELVIS used a MW-like heavy disk mass (Fig. 1).\n\nIn Fig. 8, we show the subhalo counts ratio in EDEN versus Symphony as a function of the lookback time of the first-infall into their MW-mass hosts (r < 100 kpc in the left panel and r < Rvir,host in the right panel). In both radial ranges, subhalo abundance suppression mainly happens for early-infalling subhalos with tfirst,infall > 8 Gyrs, consistent with the findings in Phat ELVIS (Kelley et al. 2019). There are about → 10% of subhalos with r < 100 kpc and fell in from 4 → 8 Gyrs ago that are lost from disk tidal stripping. However, this suppression is not seen considering all subhalos within Rvir,host that fell in 4 → 8 Gyrs ago. This indicates that the additional subhalos brought in by adiabatic contraction (Fig. 5) that have not yet entered the central 100 kpc of the host have not been severely stripped and compensates for the central subhalo abundance suppression (Fig. 7). The nine halos in EDEN M →,Disk ↓ 2.5 further enhance the infall time distribution patterns of EDEN fiducial, with most of the additional suppression of subhalo abundance occurring with tfirst,infall > 8 Gyrs due to the increase in disk-to-halo mass ratio. These findings indicate that the MW disk predominantly loses early-infalling subhalos due to disk tidal stripping, and increasing the disk mass further enhances this effect."
    },
    {
        "id_": "1fac558d-802f-4d4b-8fc2-896be14a1a07",
        "text": "# 5. DISCUSSION"
    },
    {
        "id_": "98e6abfb-f039-4ad6-9fee-8a9ab10d2ec6",
        "text": "# 5.1. A user’s guide to interpreting the scope of theoretical subhalo disruption/mass loss studies\n\nFollowing on the discussion in Section 3, we outline several principles for interpreting the results of studies like our own, which analyze simulated subhalos and depend on how many subhalos have lost so much mass that they have dropped out of the sample (a process often colloquially referred to as “disruption”). We then outline where our current study fits relative to these points.\n\nQuantitative vs. Qualitative: The most important question in any subhalo study is whether its conclusions require that its results are quantitatively correct, or whether it is sufficient that the results are qualitatively correct. For example, a study claiming that observed satellite population statistics are in conflict with !CDM will almost always require quantitatively correct results, while for a study arguing that two quantities are correlated, qualitatively correct results may be sufficient. This distinction is important because quantitative studies require quantitative attention to the modeling points we bring up below, something that is quite difficult to do. In some cases, we consider such modeling to be an unsolved problem. Qualitative studies are not exempt from these concerns but can usually weather cruder modeling choices."
    },
    {
        "id_": "b961f37c-18ec-4763-b53f-97c3b7305e7a",
        "text": "# WANG ET AL."
    },
    {
        "id_": "c283eb89-ee19-4c75-94b1-4c2e7586d385",
        "text": "# Sample Selection\n\nWhen studying subhalo populations, one generally needs to select objects based on a mass proxy.7 Popular choices are to select by present-day halo properties such as virial mass Mvir and maximum circular velocity vmax, or to select by pre-infall mass proxies like Mpeak or vpeak, which are the historical maximum of Mvir and vmax.\n\nEach selection choice has its own considerations. First, they target different classes of observations: present-day measures of mass are good tracers of observations that directly probe present-day subhalo mass (e.g., stream gaps, strong lensing, rotation curves, etc.; Bechtol et al. 2022), while pre-infall proxies tend to be better tracers of satellite galaxies selected by stellar mass (e.g., Reddick et al. 2013). Second, population demographics can be very different for samples selected by pre-infall mass proxies than present-day mass proxies. This is particularly true for the radial distribution of subhalos, which is more concentrated in subhalos selected by peak mass than by present mass (e.g., Nagai & Kravtsov 2005; Han et al. 2016). Third, numerical concerns are different for different mass proxies (Mansfield et al. 2023): i) pre-infall selections have more stringent resolution requirements than present-day mass selections and may need to contend with aphysical fluctuations in mass as subhalos disrupt (see also van den Bosch 2017); ii) present-day mass measurements need to contend with the fact that different subhalo finders have different ways of separating the mass of a subhalo from its host and different schemes can bias masses by tens-of-percent; iii) maintaining unbiased vmax values in subhalo velocity profiles for subhalos undergoing mass loss requires almost an order of magnitude more resolution than maintaining unbiased Mvir values."
    },
    {
        "id_": "9e29a9ca-16c7-447b-9d5f-3b763766ef07",
        "text": "# Resolution\n\nA poorly resolved subhalo may not give accurate predictions for the ΛCDM model. As subhalos lose mass, they experience more classical two-body scattering (e.g., Power et al. 2003; Ludlow et al. 2019); they may further experience decreased durability due to their simulation’s force softening (van den Bosch & Ogiya 2018; Mansfield & Avestruz 2021), and can eventually encounter runaway mass loss due to discreteness effects (van den Bosch & Ogiya 2018). In a well-calibrated simulation, all three effects affect subhalos at similar resolution levels (Mansfield et al. 2023), but this may not be true in a simulation with excessively large or small force softening scales. Certain subhalo population statistics are strongly dependent on resolution, such as the abundance or radial distribution of subhalos selected at a fixed Mpeak."
    },
    {
        "id_": "0debb17e-7e61-431e-b0dc-6664caf2e298",
        "text": "# Subhalo finder\n\nSubhalo finders are imperfect tools and are often the dominant source of numerical biases in subhalo analysis. For example, the ROCKSTAR subhalo finder (Behroozi et al. 2013b) is one of the most widely used subhalo finders and generally performs at least as well as other major subhalo finders in comparative tests between tools (Knebe et al. 2011; Onions et al. 2012, 2013; Srisawat et al. 2013; Avila et al. 2014; Behroozi et al. 2014; Elahi et al. 2019). However, ROCKSTAR demonstrably loses track of even high-resolution subhalos after relatively modest amounts of mass loss (Griffen et al. 2016; Mansfield et al. 2023) and falsely converges (Mansfield et al. 2023), meaning that even as resolution is increased and the simulation’s subhalos are able to survive for longer, ROCKSTAR will continue losing track of subhalos after they have lost the same amount of mass. The strengths and drawbacks of every halo finder are different and it is important to understand what those weaknesses are in depth, even for qualitative studies. For some subhalo finders, these limitations have never been formally studied. We also recommend that one should generally be skeptical of reliability arguments based on subhalo finder comparisons or internal convergence tests, given that such tests had been performed extensively on the ROCKSTAR subhalo finder without identifying its aforementioned issues."
    },
    {
        "id_": "9eee254e-0951-4875-a1a7-3100c49897fa",
        "text": "# Galaxy Mass Loss/Orphan Model\n\nTo first order, particles can be stripped from a subhalo when they orbit close to that subhalo’s tidal radius, and a subhalo’s tidal radius gradually shrinks as it orbits its host. Because galaxies are small compared to their halos, low-mass satellite galaxies generally stay intact through their initial mass loss and begin to rapidly lose mass after passing a critical threshold in Mvir/Mpeak (Smith et al. 2013). Whether or not this rapid mass loss is qualitatively consistent with “disruption” depends on the stellar density profile of the satellite (Errani et al. 2023b). For subhalo finders that lose track of subhalos after this threshold is reached (e.g. SYMFIND, Mansfield et al. 2023), a galaxy mass loss model is needed, lest the finder over predict the abundance of satellite galaxies at a fixed stellar mass. For subhalo finders that lose track of subhalos prior to this threshold (e.g. ROCKSTAR, Mansfield et al. 2023) require both a galaxy disruption model and an “orphan” model, i.e., a model that creates post hoc galaxy tracers and evolves them forward based on heuristics. Several points to consider when evaluating these models are (a) that mass loss models calibrated on hydrodynamic simulations likely vastly overestimate mass loss rates due to numerical issues (e.g., Ludlow et al. 2019), (b) that dynamical friction is quite weak in low mass subhalos (van den Bosch et al. 2016) meaning that it is unlikely to be their primary disruption mechanism despite it being a popular prescription, and (c) that the popular choice of generating orphan galaxies during a subhalo’s last snapshot is questionable given that the subhalo recovered during this snapshot is often extremely unreliable."
    },
    {
        "id_": "94baa77b-3feb-4aef-9259-c1a5b2252300",
        "text": "# EDEN: EXPLORING DISKS EMBEDDED IN N-BODY SIMULATIONS"
    },
    {
        "id_": "a98473e7-5c19-42e4-a256-6794ca9ddb1d",
        "text": "# 5.2. Comparisons with previous embedded disk simulations\n\nWith this context, let us consider the current study. We are studying M peak-selected subhalo samples. The goal of this work is to use these M peak selected samples to qualitatively emulate the behavior of stellar-mass selected samples. We do this because we consider the work associated with producing a quantitatively reliable model of stellar mass loss to be beyond the scope of this study. We consider this a reasonable approximation at this level of accuracy because the majority of our subhalos have M vir /M peak high enough (↭ 0.2) that they are unlikely to have started galaxy disruption (see Section 3).\n\nThe interplay between the numerics of our simulations and our chosen subhalo finder, SYMFIND, have been extensively explored in Mansfield et al. (2023). SYMFIND is able to track subhalos well past the point where their galaxies have started to rapidly lose mass and will not be a limiting factor in analysis. However, some subhalos in the n peak ↫ 5 3 range will experience some degree of accelerated mass loss due to simulation resolution prior to the point when stellar mass loss should begin, although we do not currently have a model that can make quantitative estimates for how many subhalos will be missing in this range. The use of SYMFIND significantly increases the number of subhalos that we find relative to ROCKSTAR (see Appendix D), and the choice between subhalo finders is comparable in effect to the amount of suppression introduced by the disk itself. Much of this difference is due to ROCKSTAR losing track of subhalos early, but some unknown fraction of the difference may come from the fact that SYMFIND is holding onto subhalos so long that their satellite galaxies would have lost enough stellar mass to move outside the equivalent stellar-mass-selected sample. Future work on precise stellar mass loss models will help resolve this issue.\n\nTo begin with, conclusions on subhalo abundance suppression as described in Garrison-Kimmel et al. (2017) and Kelley et al. (2019) are largely consistent with the two EDEN halos with M →,Disk /M vir,host > 0.05 and the EDEN M →,Disk ↓ 2.5 suite that have MW-like heavy disk-to-halo mass ratios (Section 4). Both simulation works have → 10↓ higher numerical resolution than EDEN and presented disk effects for subhalos that reached an order-of-magnitude lower masses than our M peak ⊜ 1.2 ↓ 108 M↑. Therefore, we qualitatively compare these previous simulations with EDEN and emphasize the subhalo count ratios from Garrison-Kimmel et al. (2017), SPMF figure.\n\nIn Phat-ELVIS (Kelley et al. 2019), → 35% subhalos within 100 kpc are lost down to the EDEN resolution limit (see their Fig. 2, peak maximum circular velocity vpeak ⊜ 10 km s !1), which is consistent with EDEN (Fig. 5). However, subhalo abundance suppression for one of the two halos in Garrison-Kimmel et al. (2017) is significantly stronger than EDEN (Fig. 5 top panel, data taken from their Fig. 4 at M peak = 1.2 ↓ 10 8 M↑). This host in Garrison-Kimmel et al. (2017) has a lower M→,Disk /M vir,host than its sibling but is left only with 30% of subhalos within 100 kpc relative to its DMO run. This is counter intuitive, as its disk formed later than its sibling and always had smaller M →. It is very rare for a MW-mass halo in EDEN to lose > 60% of its subhalos, even when considering the largest M →,Disk /M vir,host hosts in EDEN M →,Disk ↓ 2.5 with → 2↓ larger disk-to-halo mass ratios.\n\nWe conjecture two possible factors that can potentially lead to the stronger subhalo abundance suppression seen in Garrison-Kimmel et al. (2017). One possibility is that the subhalo orbits of these two halos had smaller pericenters and were accreted more radially due to the large-scale environment of the host (e.g., accreting subhalos collectively from filaments). Another possibility is that the fragility of AHF halo finder used by Garrison-Kimmel et al. (2017) has even worse subhalo tracking issues than ROCKSTAR (Mansfield et al. 2023), leading to more heavily stripped subhalos being artificially lost track of in the presence of a disk potential. A similar effect could be applicable to AHF (Knollmann & Knebe 2009), the halo finder used in Garrison-Kimmel et al. (2017), such that it numerically enhances the suppression of subhalo abundance. Since only two halos were picked from FIRE-2 and they already happen to yield drastically lower NDisk /NDMO, the average mass-loss for subhalos in FIRE-2 is likely to be statistically stronger than that of EDEN (combining physical and numerical effects). We defer a more careful analysis of this issue to future work.\n\nRegarding subhalo radial distributions, EDEN qualitatively agrees with Garrison-Kimmel et al. (2017) and Kelley et al. (2019). However, there are a few quantitative differences we wish to highlight. Comparing EDEN with Garrison-Kimmel et al. (2017), the latter (see their Fig. 3) has a similar 3D radial distribution to EDEN M→,Disk ↓ 2.5 (Fig. 7 left panel) and loses > 2/3 subhalos within 30 kpc due to the added disk. The differences in 3D subhalo distances mainly come from the cumulative subhalo counts within 100 kpc being → 15% lower than EDEN M →,Disk ↓ 2.5 following discussion above. Comparing Phat ELVIS to EDEN, both Phat ELVIS and EDEN M →,Disk ↓ 2.5 do not have subhalos within 20 kpc of their hosts with the disk added with the suppression ratio decreasing at increasing distances (see their Fig. 3).\n\nThe more significant differences between EDEN and these works are the pericenter distance distributions. Symphony DMO has ↫ 15% subhalos with dperi < 10 kpc on average, and in EDEN 30% → 40% of subhalos within 10 kpc are lost due to the added disk. However, the two halos in Garrison-Kimmel et al. (2017) have ↭ 20% subhalos within 10 kpc and reach 50% at dperi → 20 kpc in their DMO run, having much tighter pericenters than EDEN to start with."
    },
    {
        "id_": "0cdc9b1e-2d70-4955-9761-c4f7def9ca75",
        "text": "# 5.3. Caveats with fixing the disk orientation\n\nAs mentioned in Section 2.3, we fix the disk potential axis to the MW host halo spin at z = 0 throughout the simulation. This choice follows previous arguments that the specific shape of the disk potential does not change the quantitative results of subhalo abundance suppression (Garrison-Kimmel et al. 2017; Green et al. 2022) and has been implemented similarly in Phat ELVIS (Kelley et al. 2019). However, this simplistic treatment means that the torque exerted by the disk potential on the subhalos is not back-reacted on the disk, which could otherwise cause the disk to precess and warp. Without this precession, embedded disk simulations set a preferred direction of collapse at halo centers and can create a more ellipsoidal central dark matter density distribution (↫ 10 kpc) than their hydrodynamic counterparts (e.g., Fig. 1 lower panel in Garrison-Kimmel et al. 2017).\n\nThe torque on the subhalos due to the assumed rigidity in disk direction may cumulatively influence the spin of the disk that may not keep it aligned with the host halo spin. Additional external torques from nearby structures outside the MW host may also contribute in addition to the subhalos, eventually concertedly shifting the 3D trajectory of the disk. Indeed, as we show in Appendix C, the EDEN hosts end up at locations that are on average ↭ 15 kpc from their Symphony DMO counterparts at z = 0, sometimes even deviating at → 40 kpc. These shifts in the host halo center do not have significant impacts on our conclusions as the disk (sink particle) is kept within 0.1 kpc of the halo center (Fig. 10) and the subhalo infall times are also largely unchanged as visible through the jumps in host mass growth histories (Fig. 12). This is consistent with the isolation criteria of SymphonyMilkyWay hosts as they are selected to be the most massive object within 4Rvir,host (Mao et al. 2015; Nadler et al. 2023b), which makes the ↫ 0.1Rvir,host shifts in their locations unlikely to cause significantly different infalling subhalo populations.\n\nThese effects indicate that although the disk direction fixture causes an artificial shift in halo trajectories and more ellipsoidal central densities, its impact on subhalo abundance suppression is negligible. The rigid disk assumption also represents an upper bound on the pure gravitational impact of the disk on subhalos, as the disk in our case cannot absorb orbital energy through precession or warping. This finding is also in line with numerical experiments in Santistevan et al. (2024), which indicate that the orientation of the disk, the density profile of the disk (axisymmetric or spherical), and..."
    },
    {
        "id_": "3341fd48-df06-4e1b-8ef0-8062ea97ee6a",
        "text": "# EDEN: EXPLORING DISKS EMBEDDED IN N-BODY SIMULATIONS"
    },
    {
        "id_": "aa436dd2-83e4-4d72-aa78-be504f9c5db2",
        "text": "# 5.4. Effects of numerical resolution\n\nAs mentioned in Section 4.3, the quantitative results in this work, such as the subhalo counts ratio, SPMF, and radial distributions, may be subject to change under different numerical resolutions. We show in Appendix D that, indeed, resolution matters, as well as the specific choice of the subhalo finder. We re-simulate five SymphonyMilkyWay hosts at 8↓ higher resolution. Higher resolution leads to a higher SPMF that boosts subhalo counts at all mass scales. The boost in subhalo counts due to higher numerical resolution is comparable to the magnitude of disk effects on subhalo abundances at the same fiducial resolution, further highlighting that the results of disk effects are sensitive to numerical resolution.\n\nTherefore, we advocate for future work quoting quantitative comparisons to EDEN to be conducted at similar numerical resolution and to apply the same halo finder (SYMFIND). As we have checked, the subhalo counts ratios shown in Fig. 5 are more consistent between SYMFIND and ROCKSTAR than the SPMF (Fig. 11) which is more sensitive to the specific halo finder choice. Qualitative comparisons between different simulations using different halo finders should prioritize subhalo abundance ratio (NDisk /NDMO) comparisons rather than absolute subhalo abundance (SPMF)."
    },
    {
        "id_": "b27a3e33-a6b5-4443-906b-5366f32a5a69",
        "text": "# 5.5. The Milky Way’s disk in a cosmological context\n\nThe most important finding in this work is that subhalo abundance suppression in MW-mass halos is sensitive to the disk-to-halo mass ratio, and thus the MW (as well as M31), with a larger-than-average disk, likely suppresses subhalos more efficiently (Fig. 5). This has profound implications for understanding the galaxy–halo connection of low-mass satellites around MW-mass hosts external to the MW. If one tries to constrain galaxy–halo connection on a broad set of MW-mass objects in the Local Universe from Surveys such as SAGA (Geha et al. 2017; Mao et al. 2021) and ELVES (Carlsten et al. 2022), the overall effect of subhalo abundance suppression across their host samples would be weaker than in the MW itself, due to the rareness (→ 1ω outlier) of a MW-like heavy stellar disk.\n\nFor instance, the MW is a ↭ 1ω larger-than-average host compared to the 101 hosts in SAGA (see Fig. 2 in Wang et al. 2024), consistent with EDEN hosts shown in Figs. 1 and 5. For the majority of SAGA-host, that coincides with M →,Disk /M vir,host ↫ 0.02, disk effects of → 10% within R vir,host and → 20% within 100 kpc are expected for subhalos according to EDEN (Fig. 5). In those cases, constraints on the low-mass galaxy–halo connection based on average number densities of satellites within Rvir,host is rather robust given the expected → 10% disk effects, but radial trends could change significantly especially within the central 100 kpc due to stronger suppression at smaller radii (↭ 20, Fig. 7). This indicates that EDEN might mitigate the limitation of UM-SAGA, which predicts fewer quenched satellites than SAGA observations within 100 kpc (Wang et al. 2024), by accounting for the additional tidal forces from the host galactic disk.\n\nHowever, if one focuses exclusively on low-mass satellites in the MW itself (e.g. Nadler et al. 2020), modeling subhalo abundance suppression properly becomes crucial due to the presence of a massive stellar disk that is more effective at stripping subhalos. In fact, Nadler et al. (2020) showed that the subhalo abundance suppression intensity8 of Garrison-Kimmel et al. (2017) is consistent with the luminosity, size, and spatial distribution of MW satellite galaxies but is not precisely constrained by the current data (though future surveys will help reduce uncertainties, e.g. see Nadler et al. 2024). Therefore, our embedded disk simulations, especially the EDEN M →,Disk ↓ 2.5 subsample, establish a novel platform for more realistically modeling subhalo abundances that is particularly important for interpreting the MW.\n\nIn the near future, we plan to extend the EDEN framework to the new ‘MW-est’ zoom-in simulations (Buch et al. 2024), a suite of 20 MW-like zoom-in simulations that have similar halo masses as SymphonyMilkyWay hosts but also have tailored Gaia-Sausage Enceladus (Belokurov et al. 2018; Helmi et al. 2018) and LMC (van der Marel et al. 2002; Besla et al. 2007; Kallivayalil et al. 2013; Vasiliev 2023) mergers. We also plan to use EDEN as the backbone to model Local Group low-mass galaxies (Weisz et al. 2014; Savino et al. 2023) along with SAGA satellites over the entire observable galaxy stellar mass range (M → > 102 M↑), setting the MW and M31 satellites in a broader cosmological context and constraining the process of cosmic reionization."
    },
    {
        "id_": "537f9f3c-47ec-4874-8c65-94189f9c800e",
        "text": "# 6. CONCLUSIONS\n\nIn this paper, we introduced the EDEN-Symphony simulation suite, a set of 45 MW-mass dark-matter-only (DMO) zoom-in simulations with analytic disk potentials embedded in the host halo centers to capture subhalo abundance suppression due to tidal stripping and mass loss under the influence of a central galaxy baryonic disk. The baseline DMO zoom-in simulations of these 45 MW-mass halos are part of the Symphony compilation (Nadler et al. 2023b). EDEN-Symphony enlarges the number of existing zoom-in simulations with embedded disk potentials in the literature by a factor of three.\n\nA novel feature of the work is that the analytic disk potentials grow self-consistently with their equivalent stellar masses predicted by the empirical galaxy–halo connection.\n\nImplemented using the random forest model introduced in Nadler et al. (2018)."
    },
    {
        "id_": "39b72f0a-fb1f-492d-90fb-f2183b4789a8",
        "text": "# WANG ET AL."
    },
    {
        "id_": "c7d919a3-ab65-41cf-91f3-ca286a430b18",
        "text": "# model UNIVERSE MACHINE\n\n(Behroozi et al. 2019) (Sec-tion 2). This ensures that the broad range of disk masses and disk formation histories are well-sampled in a correlated fashion with halo mass and halo assembly. Our simulation suite focuses on Mvir → 1012 M☉ halos and covers heavy disk systems like our MW (Fig. 2). We use the particle-tracking subhalo finder SYMFIND (Mansfield et al. 2023) to track subhalos down to Mpeak ⊜ 300mDM = 1.2 × 108 M☉ and quantify how the subhalo populations change in the presence of a central disk potential. We have also re-simulated nine embedded-disk halos with MDisk ↓ 2.5 heavier disks (EDEN MDisk ↓ 2.5) to explore the effect of disk mass while fixing the disk growth history. Our main findings are:\n\n1. Subhalo abundance suppression due to the disk is sensitive to the host’s MDisk/Mvir,host such that more suppression occurs in hosts with larger MDisk/Mvir,host (Figs. 4 and 5).\n2. Among MW-mass halos (Mvir,host → 1012 M☉), the MW and M31 (MDisk/Mvir,host ↭ 0.05) have particularly strong subhalo abundance suppression (↭ 30% within 100 kpc, Fig. 5) due to their ↭ 2ω up-scatter in stellar mass (Fig. 1) and early disk formation (Fig. 2).\n3. In EDEN fiducial hosts, subhalos with large peak masses (Mpeak ↭ 1010 M☉) are more likely to be lost than lower-mass counterparts with the inclusion of the disk. In the more massive disks of EDEN MDisk ↓ 2.5, however, subhalo abundance suppression is independent of subhalo peak mass (Fig. 6).\n4. Subhalos with small pericenters (dperi < 100 kpc, Fig. 7) and early infall times (lookback time ↭ 8 Gyrs, Fig. 8) are preferentially lost.\n\nThe most important findings of this work are the first two points mentioned above. It is clear from Figs. 1 and 5 that the MW has an atypically large disk for an average Mvir → 1012 M☉ halo. Previous simulation work (D’Onghia et al. 2010; Garrison-Kimmel et al. 2017; Kelley et al. 2019) with embedded disk potentials implementing MW-like heavy stellar disks (MDisk ↭ 6 × 1010 M☉) are potentially biased towards heavy disk systems and overestimates the average subhalo abundance suppression intensities in MW-mass halos. Subhalo abundance suppression is less significant in a broader range of MW-mass halos in the Universe, and suppression ratios obtained in previous models using heavy disk should not be naively generalized to the broader range of MW-mass halos."
    }
]