[
    {
        "id_": "bb31dab6-bccf-4fc1-a80b-ce3dfce0d5fa",
        "text": "# 1. INTRODUCTION\n\nStellar streams are a stunning example of the ongoing hierarchical assembly of the Milky Way via the gravitational interaction between our Galaxy and its satellites. They are the result of the disruptive tidal forces of the Galaxy on its companions such as globular clusters and dwarf galaxies. If the progenitor of a tidal stream is of low enough mass, the tidal debris that is liberated follows a path that is close to the orbit of its progenitor.\n\nLong tidal streams that extend over tens or even hundreds of degrees on the sky are of particular interest since they can be used to probe the global mass density profile, total mass and 3D shape of the Milky Way’s dark matter halo (e.g., Helmi 2004; Johnston et al. 2005; Law et al. 2009; Law & Majewski 2010; Koposov et al. 2010; Malhan & Ibata 2019; Vasiliev et al. 2021). A stellar stream is the result of tidal fields removing stars from the outskirts of a progenitor at a velocity dispersion close to the cluster velocity dispersion, with the tide at the stream pericenter creating an outward ordered angular momentum distribution that leads to orbital shearing and a wider orbital spread at apocenter. Since globular clusters (GCs) have small internal velocity dispersions (↭ 2 km s→1), unperturbed tidal streams produced by GCs are both thin and dynamically cold. Therefore velocity dispersion variations, density perturbations and gaps along a GC stream might hold clues to past fly-by interactions and impact from dark matter subhalos which can produce gaps and heating which results in broadening the streams over time. If the streams do not pass through the Galactic disk they may be especially good antennae for detecting such dark subhalos. Consequently observations of both the spatial and velocity substructure in tidal streams have elicited great interest as potential probes of dark matter substructure (e.g., Johnston et al. 2002; Ibata et al. 2002; Siegal-Gaskins & Valluri 2008; Carlberg 2012, 2013; Erkal & Belokurov 2015; Bonaca et al. 2019).\n\nThe GD-1 stellar stream, first identified by Grillmair & Dionatos (2006), likely originated as a GC (Koposov et al. 2010). It is located in the Galactic halo, and being both thin and very long (spanning at least 100↑), is a good candidate for exploring both the global distribution of dark matter in the inner Milky Way (e.g., Koposov et al. 2010; Bowden et al. 2015; Malhan & Ibata 2019) and for detecting dark subhalos from the analysis of gaps and velocity dispersion variations. The progenitor remains undetected, possibly having been completely disrupted (de Boer et al. 2018; Malhan et al. 2018; Price-Whelan & Bonaca 2018). GD-1 is of great current interest since Gaia DR2 data led to the detection of density variations, gaps and o!-stream structures e.g., a ‘spur’ a ‘blob’ and ‘wiggles’ (Price-Whelan & Bonaca 2018; de Boer et al. 2020) which have been claimed as evidence of possible impacts by dark matter subhalos (Bonaca et al. 2019). Since the stream does not pass through the inner disk region (it has a perigalactic (apogalactic) distance of → 14 (26) kpc, and inclination of 39 ↑ to the disk plane, Koposov et al. (2010)) it is unlikely to have been heated by encounters with giant molecular clouds in the inner disk. It has also been shown that GD-1’s orbit has a very low probability of impact with other (intact) GCs (Doke & Hattori 2022).\n\nAn alternative explanation for the gaps and density variations in the GD-1 stream has been proposed: regularly spaced gaps have been predicted to arise naturally due to epicyclic motions of stars along the stream (K¨upper et al. 2012, 2015). From an analysis of the spectrum of stream gaps and after accounting for artifacts in the Gaia DR2 scanning law and projection e!ects, Ibata et al. (2020) conclude that the density profile of the stream shows periodic gaps separated by → 2.64 ± 0.18kpc and that such a regularly spaced gap distribution can be produced via epicyclic motions in a smooth Galactic potential. However since the regularly spaced gaps arising from internal dynamics are not predicted to be associated with increased velocity dispersions, obtaining kinematic data is useful for distinguishing this process from the e!ects of perturbations.\n\nMalhan et al. (2019b) used Gaia DR2 data to show that the GD-1 stellar stream possesses a secondary diffuse and extended stellar component (→ 100 pc wide) that surrounds the previously identified thinner component of the stream. They named this broader component the “cocoon” and showed that it was detected at > 5ω confidence level. Similar broad and extended morphological and kinematic features have also been found in several other streams (e.g., Jhelum, Phlegethon, Malhan et al. 2020; Malhan et al. 2022a; Ibata et al. 2023; Awad et al. 2024). Simulated GC streams that form in dwarf galaxies and are then accreted into Milky Way like halos show complex morphological features (like gaps, “spurs”, “blobs”, “cocoons”). Such accreted GC streams have complex morphologies in both cosmological simulations (Carlberg 2018; Carlberg & Agler 2023) and controlled simulations (Malhan et al. 2020). These complex morphologies are produced via the tidal interactions between the GCs and the central dark matter distributions in the GC’s parent dwarf galaxy prior to their infall and subsequent accretion onto a massive host galaxy like the Milky Way. Furthermore it has been shown that the phase space structure of accreted GC streams could be used to obtain constraints on the dark matter distribution in the parent dwarf galaxy (Malhan)."
    },
    {
        "id_": "e7f8e992-0004-4ec6-8f05-e367d632f90e",
        "text": "# 4 Valluri et al.\n\net al. 2020; Malhan et al. 2022a), making the phase space structure of the cocoon important to determine.\n\nRecently (Dillamore et al. 2022a) showed that the GD-1 stream is extremely sensitive to perturbations from the Sagittarius dwarf galaxy (Sgr) especially if it was quite massive (↫ 4 ↑ 1010 M ↓) since the orbit of the GD-1 stream intersects with that of Sgr. They showed that a wide range of outcomes is possible with various types of substructures produced in and around the GD-1 stream (see their Fig 9). Interactions with the Sgr dwarf change the energy distribution of the GD-1 particles making it substantially broader; also the streams density profile is altered (affecting the surface brightness distribution along the stream) and its length is modified. While many of the induced perturbations are difficult to distinguish from the cocoon formation scenario above, the change in length is particularly interesting as this is a unique prediction of the heavy Sgr hypothesis.\n\nSince impacts from dark matter sub-halos which cross a stream also cause stream heating (in addition to producing short-lived gaps and off-stream features like ‘spurs’), it is particularly important to measure the velocity dispersions of robustly identified stream candidates. Thus the phase space structure of the GD-1 stream has the potential to improve our understanding of the nature of dark matter both within the Milky Way and in dwarf satellites that were accreted by our Galaxy.\n\nWhile Gaia photometry and proper-motions led to the detection of an extension to the stream as well as these various complex morphological features, there are fewer than 100 spectroscopically and chemically confirmed members from previous surveys with high radial velocity uncertainty of → 1 ↓ 2 km s-1 (Bonaca et al. 2020; Gialluca et al. 2021; Ibata et al. 2020). An additional → 200 spectroscopically confirmed members are available from the SDSS and LAMOST surveys but have lower radial velocity precision (→ 5 ↓ 20 km s-1). In this work we present 126 new spectroscopically confirmed members of the GD-1 stream obtained with the Dark Energy Spectroscopic Instrument (DESI) with → 1 ↓ 10 km s-1 velocity precision (median precision 2.7 km s-1) and → 0.2 dex metallicity precision. We also improve on 17 previous radial velocity measurements.\n\nStarting in December 2020 DESI carried out an approximately 6 month long “Survey Validation” (SV) phase. The data from SV were used to validate scientific requirements, specifically the target selection algorithms (DESI Collaboration et al. 2022). During the SV period, while testing and streamlining targeting algorithms and analysis pipelines, there was also an opportunity to observe specific targets. In this period, DESI took several observations in the GD-1 stream region. Since these data were obtained primarily as part of the SV program, the target selection criteria and exposure times were slightly different from the main survey. After the completion of SV, there have continued to be observations in the GD-1 stream area.\n\nIn this paper we introduce the spectroscopically identified stars associated with the GD-1 tidal stream from the DESI SV observations, which was recently released to the public (DESI Collaboration et al. 2023a; Koposov et al. 2024). Additional data releases are planned at regular intervals. In section 2, we briefly describe the DESI Survey Validation data set in the region overlapping GD-1. In section 3 we discuss how we identify GD-1 stream members from the DESI targets using cuts in the stellar color-magnitude diagram, Gaia parallax, Gaia proper-motions as well as radial velocity and metallicity [Fe/H]. In section 4 we discuss the phase space distribution of stars in the stream, focusing on the identification and kinematics of the broader region referred to as the cocoon. Finally, in Section 5 we summarize our findings and discuss the implications of these results. We also give a preview of what to expect from future DESI data releases on the GD-1 stream region."
    },
    {
        "id_": "5cd2b19b-462e-4a57-827f-9a5d006be3ea",
        "text": "# 2. DESI OBSERVATIONS OF THE GD-1 REGION\n\nThe Dark Energy Spectroscopic Instrument (DESI) is a robotic, fiber-fed, highly multiplexed spectrograph installed on the Mayall 4-meter telescope at Kitt Peak National Observatory (DESI Collaboration et al. 2022). A central feature of the instrument is the use of 5,000 robotic positioners that move individual optical fibers to pre-identified targets over a → 3↑ field of view (DESI Collaboration et al. 2016; Silber et al. 2023; Miller et al. 2023). The DESI survey is a five-year survey of about 14,000 square degrees to obtain spectra for approximately 40 million galaxies and quasars and over 10 million Milky Way stars (DESI Collaboration et al. 2016).\n\nDESI was installed in 2019 and commissioning and survey validation extended through May 2021 (DESI Collaboration et al. 2023b). Since May 2021, the 5-year DESI survey has been underway and has obtained an unprecedented number of galaxy, quasar and stellar spectra. The primary scientific goal of the survey is to use spectroscopic redshifts of galaxies and quasars to obtain the most precise constraints on the expansion history of the universe ever obtained using the baryon acoustic oscillation and other methods (e.g., redshift space distortions) (DESI Collaboration et al. 2016; Levi et al. 2013).\n\nOver the first 5-years of the DESI Milky Way Survey (Allende Prieto et al. 2020; Cooper et al. 2023) it is expected that spectra of ↔ 7 million unique Milky Way"
    },
    {
        "id_": "4a502911-2976-418f-9005-4bd7ca772b09",
        "text": "# The DESI view of the GD-1 Stream and Cocoon"
    },
    {
        "id_": "c5d7a25c-9c28-4b13-90f8-dd4fc183dab5",
        "text": "# Figure 1\n\nGD-1 stream in great-circle coordinates (ω1, ω2) with the stream along ω1. Grey scale shows 2D histogram of surface density of Gaia DR3 stars with a broad color-magnitude, and a proper motion selection as indicated in the legend. The GD-1 stream is clearly visible as an over-density at roughly ω2 = 0. Magenta curves show the DESI tiles observed during commissioning and Survey Validation.\n\nStars at Galactic latitudes |b| > 20 ↑ will be obtained during the main survey and millions more will be obtained during poor sky conditions (the “back up program”). The DESI-Milky Way Survey (MWS) uses a simple and inclusive target selection scheme focused on the thick disk and stellar halo. All targets are selected from the Gaia catalog (originally DR2, but subsequently DR3). Targets fall into three categories: MAIN-BLUE, MAIN-RED, and MAIN-BROAD, within the magnitude range 16 < r < 19. MAIN-BLUE prioritizes all Gaia point sources in this magnitude range with blue optical colors (g ↓ r < 0.7) in the DESI Legacy Imaging Surveys (Dey et al. 2019). The MAIN-RED selection applies Gaia proper-motion and parallax criteria to sources with redder colors (g ↓ r > 0.7) to increase the probability of observing distant halo giants. Sources with g ↓ r > 0.7 that do not meet the astrometric criteria are targeted at lower priority in the MAIN-BROAD category (Cooper et al. 2023).\n\nDESI-MWS is expected to achieve an average spectroscopic completeness of → 28% over the various MAIN target classes. The DESI-MWS is executed during bright-sky conditions (when high-redshift galaxy observations are inefficient) and shares the focal plane with a low-redshift Bright Galaxy Survey (BGS; Hahn et al. 2023), although BGS targets have higher priority for fiber assignment than MWS stars.\n\nThe DESI spectroscopic data presented in this paper were taken during the on-sky DESI SV from 2020/12/14 to 2021/5/14; the corresponding data (both spectra and the catalogs used in this paper) are now publicly available under DESI’s Early Data Release (EDR) https://data.desi.lbl.gov/doc/releases/edr/vac/mws/.\n\nDuring the SV, the DESI Collaboration carried out observations to evaluate the targeting pipelines, instrument and observatory readiness in three separate subprograms SV1, SV2 and SV3. The MWS target selection for SV was previously described in Allende Prieto et al. (2020). Other DESI SV programs are discussed in DESI Collaboration et al. (2023b). Each fiber configuration in a given field is referred to as a “tile”. Some of these tiles had a larger percentage of fibers dedicated to Milky Way stars than expected for the main survey and in some cases went to fainter magnitudes (for the SV, stars in the range 19 < r < 20 were also included at lower priority.) As discussed in Section 7 of Cooper et al. (2023), several fields in the GD-1 region were observed during SV1 but without any special prioritization of potential GD-1 targets. In addition, 22 tiles were observed during SV2, also without any special prioritization for GD-1 stars. In total 45 tiles in the GD-1 region were observed during Survey Validation. For more details on the observing conditions and various programs for SV, readers are directed to the MWS EDR Value Added Catalogue paper (Koposov et al. 2024).\n\nFigure 1 shows the GD-1 stream region in a coordinate system in which ε1 is the angle on the sky along the stream and ε2 is the angle perpendicular to ε1. The transformation from Gaia DR3 sky positions (ϑ, ϖ) and proper motions (μω, με) to this natural GD-1 frame was carried out using the coordinate transformation described in Koposov et al. (2010)1, which also yields proper motion in [ε1, ε2], hereafter referred to as μϑ1 and μϑ2 respectively. Most targets were also identified in the DESI Legacy Survey (DECaLs) (Dey et al. 2019), from which the g and r-band magnitudes for these stars were obtained.\n\n1 The pole of the great circle frame fitting the GD-1 stream has (RA, Dec)= (34.5987, 29.7331) in 2000 coordinates.\n\n2 Hereafter we drop the → and simply use μω and με to denote μω cos(ω) and με cos(ε2)."
    },
    {
        "id_": "3b333007-d8d5-4bf4-8cfb-36dc21fea2b3",
        "text": "# 6 Valluri et al.\n\nwere measured. The Legacy Survey magnitudes were de-reddened using dust maps (Schlafly et al. 2010) updated for the Legacy Survey and available on the Legacy Survey website https://www.legacysurvey.org. These data were cross-matched with the Gaia DR3 catalog for parallax and proper motion measurements which is similar to the function estimated by Koposov (Gaia Collaboration 2022). The Gaia DR3 proper motions were corrected for solar reflex motion using Astropy. We used Astropy’s default parameters for galactocentric frame defaults.set(‘v4.0’) (Reid & Brunthaler 2004; GRAVITY Collaboration et al. 2018; Drimmel & Poggio 2018; Bennett & Bovy 2019).\n\nDistances to individual stars were estimated using the distance modulus in Equation 1 below (also see Appendix). Gaia parallaxes were zero-point corrected following the prescriptions in (Lindegren et al. 2021a).\n\nThe 2D histogram in Figure 1 shows the surface density of Gaia DR3 stars with DECaLS 0.2 ↗ (g ↓ r) < 0.4 and 18 ↗ r < 20, ↓10mas yr →1 < μ ϑ 1 < ↓4mas yr →1 and |μ ϑ 2 | < ↓5mas yr →1. These selections are similar to and based on previous works (e.g., Price-Whelan & Bonaca 2018). The boundaries of the 45 DESI tiles in this region that were observed during SV are shown by magenta curves. The direction of motion of the stream is from positive ε 1 to negative ε 1.\n\nThe stellar spectra obtained by the DESI spectrograph are processed with the RVS pipeline, based on RVSpec (Koposov 2019), to measure each star’s line-of-sight (radial) velocity and stellar atmospheric parameters. The spectra are further processed by the SP pipeline based on FERRE (Allende Prieto et al. 2006)3, which measures [Fe/H] and [ϑ/Fe], among other properties. The RVS pipeline measures the radial velocity with a precision of ↗ 1 ↓ 10 km s →1 and [Fe/H] with a precision of →0.15-0.2 dex. For further details of the pipelines and their validation see Cooper et al. (2023) and Koposov et al. (2024)."
    },
    {
        "id_": "dd14ca35-25e7-47d6-af62-b085f02056a3",
        "text": "# 3. GD-1 STREAM MEMBERSHIP"
    },
    {
        "id_": "9edf286a-baea-4a6f-a2c4-17e610c3c104",
        "text": "# 3.1. Initial selection\n\nOur search for GD-1 stream members begins by restricting to the region (galactic coordinates: 210 ↑| < l < 90 ↑ , 20 ↑< |ε 2 < 3↑ , ↓85↑ ε 1 < 20↑ < b < 70 ↑). Given the above initial cuts as an input, we show that the data are well identified in a color-magnitude diagram (CMD) as shown in Figure 3. The stars are well matched to an isochrone of 12 Gyr with [M/H] = ↓2.0 from the PARSEC isochrone database (Bressan et al. 2012; Tang et al. 2014; Marigo et al. 2017; Pastorelli et al. 2019, 2020)4. Other authors have used similar isochrones selections (e.g., Ibata et al. 2020)."
    },
    {
        "id_": "8553fd16-0b22-485d-8c4d-de820e92d73c",
        "text": "# 3.2. Color-Magnitude Diagram selection\n\nWe also apply the same broad cut in color-magnitude space and proper-motion selections as used in Figure 1. These selections expand slightly on the limits set by Price-Whelan & Bonaca (2018) and Malhan & Ibata (2019).\n\n3 https://github.com/callendeprieto/ferre and supporting python code piferre https://github.com/callendeprieto/piferre\n\n4 https://people.sissa.it/~sbressan/parsec.html"
    },
    {
        "id_": "2b1e13af-2a0a-4eca-ad54-9e3a9e1972a1",
        "text": "# The DESI view of the GD-1 Stream and Cocoon"
    },
    {
        "id_": "1675c9aa-34f7-4097-89d4-19c5a73250f5",
        "text": "# Figure 2\n\nGaia-DR3 stars in the GD-1 region defined in the frame of reference of the stream [|ω2| < 3 ↑ , →85 ↑ < ω1 < 20 ↑ ] with a broad color-magnitude cut of 0.2 ↑ g → r < 0.4 and 18 ↑ r < 20.\n\n- (a) 2D histogram of με1 vs. ω1 with a spline (red curve) highlighting the GD-1 stream track.\n- (b) 2D histogram of με2 vs. ω1 with με1 within 2 mas/yr from red stream track in panel-(a). Cyan curve shows spline fit to stream.\n- (c) scatter plot of με2 vs. με1. Grey dots are all stars in panel-(b). Black points are stars with separation from red and cyan splines with εμε1 < 2 mas/yr and εμε2 < 2 mas/yr and parallax and broad color-magnitude cuts as described in the text.\n- (d) Selection in panel-(c) shown as a 2-D histogram in ω1 → ω2 (relative density in arbitrary units) with a spline representing stream track shown in red."
    },
    {
        "id_": "e7d0dd4b-35a3-4b22-901f-18cf40d41064",
        "text": "# Table 1: Knots for four stream-track splines\n\n|ω1 [↑]|με1 [mas/yr]|με2 [mas/yr]|ω2 [↑]|VGSR [km/s]|\n|---|---|---|---|---|\n|90.0|-3.00|-5.26|-0.70|79.79|\n|-70.0|-1.50|-7.08|-0.87|59.15|\n|-60.0|-0.72|-7.44|-0.70|27.61|\n|-46.0|-0.10|-7.43|-0.38|-21.66|\n|-37.6|0.05|-7.18|-0.21|-46.38|\n|-29.2|0.22|-6.78|-0.09|-66.70|\n|-20.8|0.21|-6.27|0.00|-93.19|\n|-12.4|-0.18|-5.66|0.08|-113.29|\n|-4.0|-0.84|-4.98|0.16|-131.91|\n|-15.0|-0.02|-5.85|0.06|-107.81|\n|0.0|-1.20|-4.64|0.20|-144.31|\n|20.0|-2.50|-2.90|0.50|-257.76|\n\nWith the stream defined by the cuts discussed in the previous subsections, we now examine the radial velocities of the selected stars. Figure 4 (a) shows the solar reflex-motion corrected line-of-sight velocities in the Galactic Standard of Rest frame VGSR as a function of ε1 for stars in the GD-1 region selected by parallax, proper-motion (as shown in Figure 2), CMD cuts discussed in the text and include only stars with |ϖε2| ↗ 3↑. Stars observed by DESI from the EDR catalog (DESI Collaboration et al. 2023a) are shown as black points. Stars observed by SDSS (Ahn et al. 2012) (blue) DR95 and LAMOST DR8 are shown by blue symbols. The 43 stars identified as GD-1 members using MMT-Hectochelle spectra (Bonaca et al. 2020) are shown by orange symbols. The selection of (Bonaca et al. 2020) only considered stars with velocities within 7 km s-1 from the stream track or the spur as GD-1 members, but we do not expand on this selection since none of their stars belong to the cocoon region we discuss later. All DESI-EDR measurement in Figure 4 (a) are given in a machine readable FITS file available at https://www.sdss3.org/dr9/ and http://www.lamost.org/dr8/."
    },
    {
        "id_": "8a04bef8-9560-4e76-80a1-b2e3cf433f1e",
        "text": "# 3.3. Radial Velocity Distribution"
    },
    {
        "id_": "edfa71b7-6260-4b9c-816e-6678436c49e7",
        "text": "# 8"
    },
    {
        "id_": "30df6da6-3a88-440d-aa00-027de8c089c7",
        "text": "# Valluri et al."
    },
    {
        "id_": "a6c281a3-ab72-4dd2-a558-90ede25c7cba",
        "text": "# Figure 3\n\nColor absolute magnitude diagram with the dereddened magnitudes from DECaLS. For this plot stars were selected with |εω2| &lt; 0.2deg from the stream track and both με1 and με2 within 0.5mas/yr from the respective splines in Figure 2. This selection is only used to define the color-magnitude selection. We use the distance modulus vs ω1 relation in Eqn. 1 to correct for distance gradient along the stream. Overlaid is an isochrone from the PARSEC Isochrone database with a metallicity [M/H] = -2.0dex and age = 12Gyr (red curve). The light red curves are at |g → r| = 0.1 from the red curve.\n\nzenodo.org/records/11638330, the first 3 rows of the table are shown in Table 4 in Appendix B.\n\nWe note that 18 stars from the SDSS and LAMOST datasets were also observed by DESI. Where there were duplicates we selected the measurement with the smaller velocity uncertainty. Except for one star DESI velocity uncertainties were always smaller than uncertainties from SDSS and LAMOST. There were no overlaps with GD-1 members in the MMT sample of Bonaca et al. (2020) primarily because the DESI-EDR observations did not have much coverage of the spur area. Of the remaining 153 SDSS+LAMOST stars 14 did not have [Fe/H] measurements and were therefore excluded.\n\nIn summary DESI has added 126 new spectroscopically confirmed radial velocities and improved RV measurements for 17 previously observed members. A spline fit to the stream is shown in red (see below for details of how this fit is obtained) along with dashed lines showing ϖV GSR = ±30 km s-1 from the stream track. Figure 4 (b) shows kernel density estimates of ϖV GSR (from the stream track in the left panel) of stars observed by DESI (black), SDSS+LAMOST (blue) and MMT (orange). All stars within ↓85 ↑ &lt; ε1 &lt; 20↑ are shown. A clear peak is visible identifying the GD-1 stream. In making the kernel density estimate we have used bandwidths 2.74 km s-1 for DESI (black curve), 7.25 km s-1 for SDSS+LAMOST (blue dot-dashed curve) and 1.5 km s-1 for MMT (orange dashed curve). The broader histogram corresponding to stars from SDSS+LAMOST reflects their larger measurement uncertainties, while the narrower MMT distribution reflects both the small uncertainties and the more restrictive selection of |ϖV GSR| &gt; 7 km s-1 imposed by Bonaca et al. (2020).\n\nIn order to measure the velocity dispersion of the stream we need to properly account for the uncertainties in the radial velocity measurements and account for background contamination. We use a mixture modeling approach to determine the velocity track and velocity dispersion of the stream. We use the approach previously adopted for other streams in Koposov et al. (2019, 2023). Focusing on the region along the stream of ↓55↑ &gt; ε1 &gt; 0↑, where the density of the stream and number of DESI RV measurements is the highest, we construct a model for the radial velocity distribution as a function of ε1 (only DESI measurements are used in determining the spline). We model the distribution as a Gaussian mixture where the center of the Gaussian representing the GD-1 stream is allowed to vary with ε1. The other Gaussian represents the background contamination. The variation of the radial velocity of stream stars is represented by a spline with 6 knots. The velocity dispersion of the stream is also allowed to vary and is represented by a spline with 4 knots. The mean and the velocity dispersion of the background contamination are fitted parameters. The specific likelihood function for the radial velocity conditional on ε1 is given in Equation 2 of Koposov et al. (2023). The model is implemented using the Stan probabilistic programming language (Carpenter et al. 2017) and is sampled using CMDstanpy package. The splines were implemented using the stan-splines package using code very similar to that provided in the supplementary material in Koposov et al. (2023). When computing the likelihoods of individual stars, we account for their radial velocity uncertainties by adding them in quadrature to the intrinsic velocity dispersions. The priors on model parameters are mostly non-informative. Velocity prior for individual spline knots is a normal distribution N (0, 300); the"
    },
    {
        "id_": "a4d356ad-7e53-40e1-84d1-d45ff575d9cf",
        "text": "# The DESI view of the GD-1 Stream and Cocoon"
    },
    {
        "id_": "e44cfbe9-4910-488d-a154-258d11370bff",
        "text": "# Figure 4\n\n(a) Line-of-sight velocities (corrected for solar reflex motion and transformed to GSR frame) for stars from DESI (black points), SDSS (Ahn et al. 2012) or LAMOST (Yan et al. 2022) (blue diamonds), MMT-Hectochelle (Bonaca et al. 2020) (orange triangles). All stars were selected with the parallax, proper motion, and CMD cuts discussed in the text and include only stars with |εω2| < . The stream is clearly visible and highlighted by the red curve which is a spline fit (see text). All DESI radial velocities and [Fe/H] measurements in this figure are given in Table 4 of Appendix B.\n\n(b) Kernel density distributions of stars with velocities within ±30 km s-1 (i.e. between dashed red lines) from the red stream track in left panel (→85 < ω1 < 20). The kernel band widths are 2.74 km s-1 for DESI (black curve), 7.25 km s-1 for SDSS+LAMOST (blue dot-dashed curve) and 1.5 km s-1 for MMT (orange dashed curve)."
    },
    {
        "id_": "62621424-3d56-4055-8b5a-48629660e039",
        "text": "# Table 2: Stream velocity dispersions\n\n|ω1|ϑV GSR|ϖ|ϑVGSR|\n|---|---|---|---|\n|-46.0|6.195|2.38| |\n|-32.0|4.24|0.99| |\n|-18.0|3.27|0.60| |\n|-4.0|0.97|0.88| |\n\nFigure 5 (top) shows the measured radial velocity VGSR vs. ε1 for all DESI targets within ±3 from the stream track. The middle panel shows the same points in grey and location of spline knots in black. The uncertainties on the velocities are not visible as they are 15 km/s. Red lines show posterior samples from radial velocity curves. The lower panel of Figure 5 shows the constraints on the velocity dispersion along the stream in the region ↓55 ↗ ε1 ↗ 0. The error-bars show the 1ω uncertainties determined from the posterior samples. The velocity dispersion measurements at different positions along the stream obtained with Stan are given in Table 2. The velocity dispersion in the →1 ↓40 ↗ ε1 ↗ ↓20 part of the stream is around 3-4 km s-1 measured with a small 0.6 km s-1 uncertainty. Higher velocity dispersion at ε = ↓46 is consistent with the same velocity dispersion within the errors. The measured dispersion selected using the proper motion, parallax, and CMD cuts using the selections described in Sections 3.1 and."
    },
    {
        "id_": "94070345-ca31-49cd-8065-6df267bad2a6",
        "text": "# 3.4. Metallicity distribution of stream stars\n\nFigure 6 shows the distribution of DESI [Fe/H] measurements (from the RVS pipeline) for all stars (grey) selected using the proper motion, parallax, and CMD cuts using the selections described in Sections 3.1 and."
    },
    {
        "id_": "2cc2ddac-e975-4af7-814e-fb7cd981f387",
        "text": "# 3.2.\n\nStars with the additional constraint that they lie within 30 km s−1 from the stream track in Figure 4 (Section 3.3) are shown in black. It is clear from the black histogram in Figure 6 that only 2 stars have [Fe/H] > −1.5 and one more has [Fe/H] < −3.5. We exclude these stars bringing the sample from DESI to 143 (126 new, 17 improved). With these metallicity cuts 139 GD-1 stars from SDSS+LAMOST remain, along with 43 stars from MMT (Bonaca et al. 2020).\n\nThe median metallicity of the entire DESI GD-1 sample as measured by the RVS pipeline is -2.49±0.16 (uncertainty determined by bootstrapping). Given the uncertainty of 0.1-0.2 dex in the [Fe/H] values recovered by the RVS pipeline, this is consistent with values from previous works: [Fe/H] = -2.24±0.21 (Malhan & Ibata 2019), [Fe/H] = -2.3±0.1 (Bonaca et al. 2020), and [Fe/H] = -2.47 recently reported by Ibata et al. (2023).\n\nThe DESI EDR dataset contains spectra for 507 stars that are also in the APOGEE DR17 catalog (Koposov et al. 2024). A detailed study of the random and systematic errors on DESI stellar atmospheric parameters compared with the corresponding APOGEE measurements is presented in section 5.1 of that paper. Their analysis shows that the median DESI metallicity has a median offset [Fe/H] DESI − [Fe/H] APOGEE = 0.06 → 0.18 + 0.13 dex for the RVS pipeline and a median offset 0.03 → 0.16 + 0.18 dex for the SP pipeline. The results of the RVS and SP pipeline for very metal poor stars have also been compared with follow up spectra with OSIRIS on Gran Telescopio Canarias presented by Allende Prieto et al. (2023) who show that the [Fe/H] values show excellent agreement with the OSIRIS values with a mean difference of 0.04 dex and a standard deviation of 0.14 dex. Since the DESI pipelines are still being improved and the systematic error likely depends on the stellar population, we do"
    },
    {
        "id_": "9a1b69cb-43ec-4073-baec-e32a05a496cc",
        "text": "# Figure 5.\n\nTop: DESI-observations in the GD-1 region. Middle measurement of velocities at spline knots is shown by black points with error bars. The red curves show the samples from the posterior distribution. The grey points show the stars used to obtain the spline fit. Bottom: The velocity dispersion of the GD-1 stream as measured by the spline model. The error bars show the 1σ uncertainties in the velocity dispersion measurements derived from the posterior samples at four points along the stream."
    },
    {
        "id_": "71e8653e-f762-4b4d-90cd-c594fa85f212",
        "text": "# Figure 6.\n\n[Fe/H] distribution for stars in the GD-1 stream using the proper motion cuts, parallax cut, CMD cut in the GD-1-region in previous figures (grey). Black histogram shows stars with the additional constraint that they have 30 km s−1 εV GSR < from the stream track in Figure 4(a). Only DESI measurements are used in this figure."
    },
    {
        "id_": "67ecd636-7b29-4065-b9ca-63d276190f05",
        "text": "# The DESI view of the GD-1 Stream and Cocoon"
    },
    {
        "id_": "cc9f8131-d33d-4648-b626-a17fbc6d1f84",
        "text": "# 4. IDENTIFICATION AND CHARACTERIZATION OF THE COCOON\n\nAs discussed in Section 1, an extended distribution called a “cocoon” has been identified surrounding the GD-1 stream and a few other tidal streams. While the origin of such cocoons is still uncertain (see Section 5), with the increased number of radial velocities provided by DESI it is now possible to identify and characterize the GD-1 cocoon in greater detail.\n\nOur final selection (after imposing the parallax, proper-motion, CMD, RV and metallicity cuts previously described) and with |ϖε2| ↗ 3↑ can be seen in Figure 7. This plot only shows observations with full 6-D phase space and metallicity information. Malhan et al. (2019b) identified the GD-1 cocoon primarily in the region ↓10 ↑ < ε1 < 0↑ based primarily on Gaia positional and proper motion data. DESI spectroscopic measurements confidently confirm the existence of the cocoon as a broad component in ε2 extending between ↓20 ↑ < ε1 < ↓5↑.\n\nWe now analyze the phase space distribution of the stars in the region identified by the orange box. In this work we restrict our analysis to this range of ε1 since it is where the majority of the DESI spectroscopic measurements exist. We do not claim that this is the full extent of the cocoon. Spectroscopic observations at other positions along ε1 and extending perpendicular to the stream in ε2 are required to confidently assess its full extent of the cocoon and will be presented in future work. The cocoon might well extend further down to ε1 → ↓38↑ but we have few DESI-EDR observations in this region. This region also includes the ‘spur’ feature (seen as orange triangles above the main stream track) and we choose to ignore it here since a specific model has been postulated for the origin of this structure (Price-Whelan & Bonaca 2018; Bonaca et al. 2019)."
    },
    {
        "id_": "456062c4-632d-496d-bbb5-dfaa37203865",
        "text": "# 4.1. Multi-Gaussian Analysis\n\nWe wish to separate the “thin stream” and “cocoon” components in order to separately examine their phase space distributions. We use a Gaussian mixture model to fit observed quantities with two univariate Gaussians (representing the displacement of stars from the stream track in ϖε2). One Gaussian represents the “thin stream” component N1(¯1, #1) while the other represents the cocoon N2(¯2, #2), with an unknown mixing fraction Q. We adapt the formalism of Equation 17 of Hogg et al. (2010) to write the likelihood function as follows, where xi refer to individual values of ϖε2. We assume that positional uncertainty on all ϖϑ2 values is zero since the Gaia positional uncertainty at G = 21 is much smaller (by a factor 107) than the spread in ϖε2. Q is the fraction of stars in Gaussian component N1 (“thin stream”). The likelihood function, assuming each component is well described by a Gaussian, is given by:\n\nL = ∏i=1N QN1(x |¯1, #1, ωxi) + (1 - Q)N2(x |¯2, #2, ωxi)\n\nL = ∏i=1N √(2πσ(#1)) Q exp(-((xi - ¯1)2)/(2 + ωxi2)) + √(2πσ(#2)(1 - Q)) exp(-((xi - ¯2)2)/(2 + ωxi2))\n\nWe estimate the five parameters in the above model (¯1, #1, ¯2, #2, Q) in two different ways. First, we use direct maximization of the likelihood in Equation 4 with the scipy.optimize package. We determine the distribution of the best-fit parameters by bootstrapping the observed sample 1000 times. Second, we generate the posterior distribution of the model parameters using the ensemble Markov Chain Monte Carlo sampling method emcee (Foreman-Mackey et al. 2013). We adopt uniform flat priors for all the parameters (¯1, #1, ¯2, #2, Q). The posterior samples are generated with 64 walkers until the convergence of the mean parameter values to 1%. Since the maximum autocorrelation length of the chain Ncorr ≃ 80 steps, we..."
    },
    {
        "id_": "b7eba0b9-d040-4381-bc9e-c620ee41c6af",
        "text": "# Valluri et al."
    },
    {
        "id_": "069b8f91-91bf-489b-a455-17016060db54",
        "text": "# Figure 7\n\nStars in the GD-1 region with |εω2| < 3↑ from the stream track with parallax, CMD, proper motion, metallicity (→3.5 <[Fe/H]< →1.5) colored by velocity relative to the velocity spline in Figure 4(a). Points show stars observed by: DESI-EDR (circles), SDSS-DR9+LAMOST-DR8 (diamonds), and MMT-Hectochelle (triangles). The orange box shows the region we analyze for the cocoon (where most of the DESI observations lie). Boundaries of DESI tiles (fields) are shown by magenta curves.\n\nUncertainties on all parameters in this table are 16th and 84th percentile credible intervals inferred from the posterior probability distributions.\n\nWe also fit the ε2 distribution and the VGSR distribution jointly with two bivariate-Gaussian distributions described by the likelihood function:\n\nL = ∏i=1QN1(x, y | ¯1, ¯1, #x1, #y1, ωxi, ωyi) + Ni N2(x, y | ¯2, ¯2, #x2, #y2, ωxi, ωyi),\n\nwhere both N1 (thin stream) and N2 (cocoon) are represented by 2D (bivariate) Gaussians N(ϖε2, ϖVGSR). The results of the Bayesian MCMC analysis of the bivariate Gaussian model (9 parameters and their uncertainties) are also given in Table 3."
    },
    {
        "id_": "0d62c3c2-c7d9-4ccf-8ec4-69b653f0f34f",
        "text": "# Figure 8\n\nDistribution of DESI stars in εVGSR and εω2. The centrally concentrated component of the GD-1 stream and the broader cocoon component are clearly visible. The standard deviation of the Gaussian fit to the thin component #εϑ2,thin = (0.15 ± 0.014) ↑ implies a FWHM of the “thin stream” component in ε2 to be 2.355↑ωϑ2,thin = 0.353 ↑ ≃ 55 pc at the distance of 9 kpc) while the cocoon component is much broader with standard deviation #εϑ,cocoon2 = (1.245 ± 0.117) ↑ or FWHM ≃ 2.931 ↑ ≃ 460 pc.\n\nFor the distribution in VGSR the bivariate analysis gives velocity dispersions #VGSR,thin = (2.60 ± 0.65) km s−1 and #VGSR,cocoon = (8.06 ± 0.98) km s−1 for the thin stream and cocoon respectively, with the fraction of stars in the thin stream Q = 0.60 ± 0.05.\n\nThe standard deviations in ϖε2 of the thin stream and cocoon obtained both by only modeling ϖε2 versus by..."
    },
    {
        "id_": "28d19787-2717-4c9b-a1b7-b30ccce01e82",
        "text": "# The DESI view of the GD-1 Stream and Cocoon"
    },
    {
        "id_": "f38ee08f-7e5f-4d24-a87e-90de760cdbf9",
        "text": "# Table 3: Results of Univariate and Bivariate multi-Gaussian analysis\n\n|Parameter|Univariate|Univariate|Bivariate|Bivariate|\n|---|---|---|\n| |Thin|Cocoon|Thin|Cocoon|\n|εω2 [deg]|→0.118 ± 0.017|→0.149 ± 0.161|→0.109 ± 0.017|→0.165 ± 0.154|\n|” ϖε2 [deg]|0.149 ± 0.013|1.265 ± 0.122|0.150 ± 0.014|1.245 ± 0.117|\n|εVGSR [ km s−1 ]|. . .|. . .|→1.37 ± 0.49|1.23 ± 1.24|\n|” ϖVGSR [ km s−1 ]|. . .|. . .|2.60 ± 0.65|8.06 ± 0.98|\n|Q thin|0.63 ± 0.05|. . .|0.60 ± 0.05|. . .|"
    },
    {
        "id_": "f0fbbe40-32a8-4bc1-bb3b-384522e1d3fe",
        "text": "# Figure 9\n\nStars from region in the orange box in Fig. 7 with the same selections. DESI observations are in black, SDSS+LAMOST in blue (no MMT stars lie in the cocoon region). In each scatter plot and histogram it is clear that there are both narrow and broad components in εω2, εVGSR and εμε1. The overall width in εμε2 (perpendicular to the stream track) is smaller than in εμε1 (along the stream track)."
    },
    {
        "id_": "7616f896-55f4-4452-8edb-bf7cf135b1ac",
        "text": "# Figure 10\n\nTop: Relative radial velocity εVGSR vs. εω2. Points show the thin and lower velocity dispersion stream stars (black) and thick and higher velocity dispersion cocoon stars (red) as determined by the bivariate double-Gaussian model. The vertical lines are at εω2,thin ± ” ϖε2,thin and include the majority of the thin stream stars identified as members of the thin component by both position and velocity. Bottom: Kernel density estimates of in εω2 for all stars in the orange box in Figure 6 with Gaussians representing the thin stream (black curve) and cocoon (red curve) as estimated by the bivariate analysis.\n\nJointly modeling ϖε2 and ϖVGSR yields nearly identical results for the angular widths of the thin stream and cocoon. Both methods also give Q → 0.6 for the fraction of stars in the ‘thin stream’ component."
    },
    {
        "id_": "ff1e3c3c-e0f8-4329-b6b3-ce61c0ee95a9",
        "text": "# 14"
    },
    {
        "id_": "6f4705fa-8cfd-4a21-bc0f-78795fad76d1",
        "text": "# Valluri et al.\n\nFigure 11. Relative radial velocity and both components of proper motions of the stars from stream (left column) and cocoon (right column) using membership probabilities from the bivariate Gaussian model to define thin and cocoon components.\n\nFigure 10 (upper panel) shows the stars belonging to the “thin stream” with probability pthin ⇐ 0.5 as determined by the bivariate analysis considering both position and velocity ϖV GSR. The vertical lines are located at ϖε 2,thin ± # εϑ 2,thin from the bivariate analysis in Table 3 and include the majority of points determined to be members of the “thin” component by both univariate and bivariate analyses. The vertical lines are not used in subsequent analysis and only meant to guide the eye. Figure 10 (lower panel) shows the kernel density estimate of all the stars in the orange box in Figure 7. Overplotted as black and red curves are the Gaussians in ϖε 2 for the thin stream and cocoon respectively (as determined by the bivariate Gaussian analysis).\n\nFigure 11 shows various phase-space projections of the thin stream (left) and the broader cocoon component (right) with membership defined by the individual probabilities obtained from the bivariate analysis. It is clear that the cocoon has a much greater spread in ϖμ ϑ 1 and ϖV GSR than in ϖμ ϑ 2. Although the “thin stream” component defined in this way has a very narrow central component in ϖμ ϑ 1, some stars show significant velocity and proper motion deviations. The “thin stream” component also appears to have both narrow and broad components in ϖV GSR. Both the thin stream and cocoon are represented by a much broader Gaussian in velocity truncated at ϖV GSR = ±30 km s−1 (the velocity cut shown by the dashed lines in Fig. 4a). The mean and velocity dispersion of the background contamination are fitted parameters. The likelihood function is similar to that given in Equation 4."
    },
    {
        "id_": "76636ada-5289-4b85-ab98-f305280e7636",
        "text": "# 4.2. Accounting for contamination by background stars\n\nIn the above analysis we have not explicitly modeled the background population. Adding a third bivariate Gaussian component to represent contamination by a background population adds 5 additional parameters. Given the small number of stars in total in this region of the stream we did not attempt such a model. Instead we use the fact that both of the previous analyses yielded consistent values for the width of the thin stream. We use the probabilities of membership to the ‘thin stream’ and cocoon based on the univariate analysis in Section 4.1 to define each component. We then model each component’s velocity distribution with a univariate Gaussian component for the velocity of the thin stream (cocoon)."
    },
    {
        "id_": "d10a3efe-858b-4bff-aac7-7ac215c04581",
        "text": "# The DESI view of the GD-1 Stream and Cocoon"
    },
    {
        "id_": "9eddcd21-ece6-4f37-89e8-6615163b1cba",
        "text": "# 4.3. Metallicity of thin stream and cocoon components\n\nAs one would expect if some fraction of the higher velocity stars in both the ‘thin stream’ and cocoon are classified as belonging to the background, the velocity dispersions of these two components would decrease.\n\nThis model yields a velocity dispersion of 2.24 km s-1 with the fraction of stars assigned to the background found to be 0.15 ± 0.04. This velocity dispersion for the thin stream component is consistent (within the uncertainties) to the dispersion obtained from the bivariate multi-Gaussian analysis in the previous section.\n\nWhen applied to the members of the cocoon component we find that the cocoon has a smaller velocity dispersion of 4.94 km s-1 and the background fraction in the cocoon is estimated to be 12%.\n\nTo assess whether this background fraction is reasonable we counted the number of stars (after applying the same cuts used to select stars in the orange box in Fig. 7) in three separate o!-stream regions with the same size as the orange box. The number of stars in these 3 regions compared to the number of cocoon stars varied from 4-8% suggesting that the number of background stars in the cocoon could be somewhat lower than in the above estimate of 12%.\n\nThe analyses in this subsection and the previous one both imply that the physically thin stream has a velocity dispersion of 2.2 km s-1, while the cocoon has a velocity dispersion between 5-8 km s-1.\n\nAdditional cocoon stars overlaps significantly with the distribution for thin stream stars. Figure 12 shows the [Fe/H] distribution functions for the thin stream component (grey/black) and the cocoon component (red), where the membership probability from the bivariate analysis was used to assign memberships.\n\nData from future DESI data releases will enable us to determine if the cocoon is an extended structure found along the entire stream or if it is more localized. It will also enable us to derive a more robust estimate of the velocity dispersion of the cocoon.\n\nOur measurement of the dispersion of the ‘thin’ stream component (ωV GSR,thin → 2 km s-1) is consistent with previous estimates of both other GC streams and the GD-1 stream itself (Gialluca et al. 2021).\n\nIn contrast, the larger velocity dispersion of the broader cocoon component of ωV GSR,cocoon → 5-8 km s-1 is comparable to the velocity dispersion of classical dwarf spheroidal galaxies like Carina, Draco, Fornax, Leo I etc.\n\nThis measurement is also comparable to the velocity dispersion of other dwarf galaxy streams (e.g., Li et al. 2022) which have velocity dispersions that range from 4-20 km s-1 with a mean value of around 11 km s-1 and are significantly larger than the dispersions of known GC streams (e.g., Li et al. 2022).\n\nA Kolmogorov-Smirnov 2-sided test yields p = 0.15, implying that we are unable to reject the null hypothesis that the two distributions are drawn from the same parent distribution.\n\nAnother way to assess if the cocoon velocity dispersion in Section 4.1 is inflated by background/foreground halo stars is to examine the metallicity distributions of the cocoon component."
    },
    {
        "id_": "1e4a1c39-e2a4-4d82-aabb-086acf5b0569",
        "text": "# 16"
    },
    {
        "id_": "99146958-069c-4f54-b188-a5f55d75e88b",
        "text": "# Valluri et al.\n\nintrinsic metallicity dispersion of GD-1 can be com-\n\npletely explained by the current systematic floor in the\n\nuncertainty of [Fe/H] measurements resulting from the\n\nRV pipeline. Cooper et al. (2023) showed that [Fe/H]\n\nmeasurements with DESI for several GCs (M13, M92,\n\nNGC 5053) showed significant spreads of 0.3 dex or\n\ngreater and often had mean metallicities that were sys-\n\ntematically lower by 0.2 to 0.4 dex relative to literature\n\nvalues.\n\nWe caution that the DESI EDR metallicity values\n\nshould be treated as preliminary until ongoing improve-\n\nments to the spectroscopic pipelines are completed.\n\nSome of the improvements in progress including machine\n\nlearning based methods are expected to yield more ac-\n\ncurate metallicities and abundances from the low reso-\n\nlution, low S/N DESI spectra (J. Han, & DESI Collab-\n\noration, in prep, M. Haiger, & DESI Collaboration, in\n\nprep)."
    },
    {
        "id_": "dac39e4b-c370-4c88-b6e6-3015d796a0a5",
        "text": "# 5. DISCUSSION AND CONCLUSIONS"
    },
    {
        "id_": "cc506b25-1036-4bd0-b94a-bce066c26512",
        "text": "# 5.1. Summary of results\n\nWe have spectroscopically identified 126 new mem-\n\nbers of the GD-1 tidal stream and improved RV mea-\n\nsurements for 17 more using observations with Dark\n\nEnergy Spectroscopic Instrument (DESI Collaboration\n\net al. 2016, 2022).\n\nWe identify stars associated with the GD-1 stream\n\nby selecting in position |ϖε2| < 3 ↑, and proper motion |ϖμϑ1| < 2 mas yr-1, |ϖμϑ2| < 2 mas yr-1 relative to the\n\nstream track. Next we apply a selection using a PAR-\n\nSEC isochrone with [M/H] = ↓2 and age = 12 Gyr and\n\nselecting stars with |ϖ(g ↓ r)| < 0.1 from this isochrone.\n\nAfter this selection we identify and fit a spline to the\n\nstream-track in ε1 VGSR coordinates using a Gaussian\n\nmixture modelling approach, accounting for contamina-\n\ntion by a background population, following the approach\n\ndescribed in Koposov et al. (2023). Rejecting two stars\n\nwith [Fe/H] > ↓1.5 and one more with [Fe/H] < ↓3.5\n\nbrings the total number of DESI observations of GD-\n\n1 members to 143 of which 126 are new members and\n\nfor the remaining DESI has decreased the radial veloc-\n\nity uncertainty. Slightly relaxing the cuts we made in\n\nproper motion, color-magnitude, and the choice of the\n\nstellar isochrone used, can all increase the numbers of\n\nstars by 10-30 stars depending on the specific choices\n\nmade. We consider our selection to be conservative.\n\nWith these new data we spectroscopically identify a\n\nbroad cocoon structure surrounding a thinner and kine-\n\nmatically colder stream in the region ↓25 ↑ ↗ ε1 ↗ ↓5↑\n\nof the GD-1 tidal stream (where the majority of our ob-\n\nservations were obtained). This cocoon was first identi-\n\nfied by Malhan et al. (2019b) using primarily Gaia po-\n\nsitions and proper motions and was recently confirmed\n\nby Ibata et al. (2023).\n\nUsing a bivariate Bayesian mixture modeling algo-\n\nrithm and assuming that the thin stream and cocoon\n\nare described by Gaussians, we determine their an-\n\ngular widths to be #εϑ,thin2 = 0.150 ± 0.014 ↑ and"
    },
    {
        "id_": "ba60a444-5ff3-47ff-83e7-4f75605cb14b",
        "text": "#εϑ2,cocoon = 1.245 ± 0.117 ↑. Since our DESI fields\n\nare restricted to |ϖϑ2| → ±3 ↑ from the stream track\n\nthis could be an under-estimate of the width of the co-\n\ncoon. The velocity dispersions of these two components\n\nare #VGSR,thin = 2.60 ± 0.65 km s-1 and #VGSR,cocoon = 8.06 ± 0.98 km s-1.\n\nAn analysis of the velocity disper-\n\nsions of the thin stream and cocoon components defined\n\nby membership probability using ϖε2 only, but allowing\n\nfor contamination by a background population gives a\n\nnearly identical velocity dispersion for the thin stream\n\ncomponent but a somewhat lower velocity dispersion\n\nof → 5 km s-1 for the cocoon component. A bivariate\n\nanalysis also including a background would benefit from\n\nmore data and is deferred to a future work.\n\nDESI spectroscopy yields mean [Fe/H] values of\n\n⇒[Fe/H]thin = ↓2.50 ± 0.03 dex and ⇒[Fe/H]cocoon = ↓2.48 ± 0.03 dex respectively, with intrinsic metal-\n\nlicity dispersions ω [Fe/H]thin = 0.27 ± 0.02 dex and\n\nω [Fe/H]cocoon = 0.29 ± 0.03 dex respectively. Our mea-\n\nsurements of the mean metallicity are consistent with\n\nprevious estimates of [Fe/H] for the whole GD-1 stream\n\nand also imply that the cocoon and the thin stream\n\nprobably originated from the same progenitor. The mea-\n\nsured metallicity dispersions are likely overestimated\n\nand will be improved."
    },
    {
        "id_": "ef4395c8-053e-421f-996e-bee86174890f",
        "text": "# 5.2. Origin of the “cocoon”\n\nWhile its low metallicity, retrograde orbit and the\n\nthinness and coldness of the most visible part of the\n\nstream clearly imply that the progenitor of the GD-1\n\nstream was an accreted GC, the origin of the cocoon is\n\ncurrently uncertain. At least four possibilities exist.\n\n1. The cocoon could comprise GC stars that were\n2. tidally stripped from the GC while it was still in-\n3. side its parent dwarf galaxy (pre-accretion tidal\n4. stripping);\n5. it could be a tidal stream from a very metal poor\n6. dwarf galaxy, while the thin component could be\n7. the stream from an associated nuclear star cluster\n8. or GC;\n9. a thin tidal stream generated from the GC pro-\n10. genitor could have been heated by multiple inter-\n11. actions with dark subhalos in the MW;"
    },
    {
        "id_": "00b39299-41e5-4ac5-a602-fa9daa6d7cdf",
        "text": "# The DESI view of the GD-1 Stream and Cocoon"
    },
    {
        "id_": "15721106-178f-41b4-81ac-fed0e64cc462",
        "text": "# 4.\n\nA thin tidal stream generated from the GC progenitor could have been perturbed and heated by a massive Sagittarius dwarf galaxy.\n\nWe now describe each of these possible origins in turn and discuss how one might distinguish between them with future spectroscopic data."
    },
    {
        "id_": "49eaabac-9332-47d6-8214-039321c1c7ed",
        "text": "# Cocoon stars originated from pre-accretion tidal stripping of the progenitor GC:\n\nSimulations show that star clusters can experience the strongest tidal force in the first few hundred Myr after formation (Meng & Gnedin 2022). Once the parent dwarf galaxy is accreted onto the Milky Way and is tidally disrupted, the pre-accretion tidal debris forms the cocoon while the intact GC is also liberated from the parent dwarf galaxy and continues to be tidally stripped forming the thinner GC stream (Carlberg 2018; Malhan et al. 2019b; Malhan et al. 2020; Carlberg & Agler 2023).\n\nThe structure and kinematics of cocoons so formed may be important probes of the central dark matter distribution of the parent dwarf galaxy. (Malhan et al. 2020) carried out a suite of over 100 controlled N-body simulations of dwarf galaxies and their GCs falling into a Milky Way-like potential. They showed that accreted GCs born in dwarf galaxies with cored dark matter halos exhibit fewer morphological peculiarities (e.g., gaps and off-track stream structures like the spur and blob) than their counterparts born in dwarf galaxies with cuspy dark matter halos. They argue that for a parent halo of a given mass, the physical width, radial and tangential velocity dispersions and spread in angular momentum averaged along an accreted GC stream can serve as diagnostics of whether the parent host galaxy had a cusp or a core.\n\nMalhan et al. (2020) showed that if considering dwarf galaxies of halo mass 109 M☉, the gentler tidal fields in a cored dark matter halo would result in tidal stream with a velocity dispersion of ~2-5 km s-1, while a dwarf galaxy with a cuspy halo would produce a stream velocity dispersion of order 8-12 km s-1.\n\nIn this pre-accretion tidal stripping scenario a cocoon velocity dispersion of ~8 km s-1 would imply that GD-1’s parent dwarf galaxy had a cuspy dark matter halo while ~5 km s-1 would imply the parent dwarf had a cored halo. Additional observations along a larger stretch of the stream are required to draw definitive conclusions since this formation scenario predicts that cocoons are not restricted to short segments of the stream."
    },
    {
        "id_": "958064c0-c1ac-4a80-bafe-c0fc0b26968c",
        "text": "# Cocoon stars originated from the parent dwarf galaxy:\n\nA second possibility is that the cocoon comprises the stars of GD-1’s parent dwarf galaxy. The velocity dispersion of the cocoon as well as the metallicity are reasonably consistent with those of other Local Group dwarf galaxies. If the cocoon is the debris of the parent dwarf galaxy, the metallicity of the cocoon would imply that the parent had a stellar mass of ~104 to 106 M☉ (Kirby et al. 2013). Using the stellar mass - halo mass relation for low mass halos (Zaritsky & Behroozi 2023) this would imply a parent dwarf galaxy of halo mass ~2 x 109 M☉.\n\nDwarf galaxies tend to show greater metallicity dispersions than GCs but the metallicity distributions of the thin stream and cocoon components are currently statistically indistinguishable, although improved [Fe/H] measurements are needed to make a definitive statement. Nuclear star clusters do show large metallicity dispersions (e.g., Alfaro-Cuello et al. 2019; Nogueras-Lara 2022), but all known nuclear star clusters are more metal rich than GD-1.\n\nGD-1’s low metallicity and retrograde orbit are strong indicators that progenitor was accreted from a dwarf galaxy. Previous work based on the location of GD-1 in action space relative to known GCs and halo stars suggests a possible association with debris from accreted dwarf galaxy(ies) such as ‘Sequoia/Arjuna/I’itoi’ (Myeong et al. 2019; Bonaca et al. 2021; Malhan et al. 2022b). Accreted GCs which are about 60% of the GC population (Choksi et al. 2018; Choksi & Gnedin 2019; Creasey et al. 2019) tend to be on more radial orbits and tend to be found at larger radii (Chen & Gnedin 2022, 2023; Belokurov & Kravtsov 2024). In contrast, in situ GCs are more metal-rich and lie deeper in the Galactic potential (at more negative energy). GD-1 is peculiar because it is quite deep in the potential but rather than being on a radial orbit it is on a retrograde and nearly tangential (high angular momentum) orbit. A possible explanation is that it was brought in by a fairly heavy dwarf galaxy that experienced significant dynamical friction (Binney & Tremaine 2008).\n\nFollow-up high-resolution spectroscopy to obtain abundance data will be particularly useful in determining whether the cocoon has abundance signatures characteristic of GCs or dwarf galaxies. For example, a sodium-oxygen anti-correlation is seen in high-resolution spectra of most GCs (e.g., Marino et al. 2011) but not in dwarf galaxies."
    },
    {
        "id_": "b23a0939-9e56-4374-8748-00148fc77756",
        "text": "# Cocoon produced by dark matter subhalo impacts with a thin GC stream:\n\nThe third possible origin for the cocoon is heating by impacts from multiple dark subhalos with masses in the range 107 to 108 M☉ (e.g., Johnston et al. 2002; Ibata et al. 2002; Siegal-Gaskins & Valluri 2008; Carlberg 2012, 2013; Erkal & Belokurov 2015; Sanders et al. 2016; Banik et al. 2018; Bonaca et al. 2019; Banik et al. 2021; Carlberg & Agler 2023). Simulations provide insight into the origins of the broad cocoon-like structure."
    },
    {
        "id_": "68372f45-9476-48a4-8a75-acfcfbb8fe2e",
        "text": "# 5.3. Other factors affecting the structure of the GD-1 stream\n\ncomponents produced by subhalo impacts. Encounters with small impact parameters between thin GC streams and dark subhalos cause the decrease of the angular momenta of stream stars ahead of the point of closest approach, since stars are pulled towards the perturber, and vice-versa. Stars with lower angular momenta than the progenitor spread to smaller galactocentric radii while stars with higher angular momenta spread to larger radii. The accumulation of sub-halo encounters with time is expected to lead to an increase in velocity dispersion (Ngan et al. 2015, 2016) along the stream and may also create gaps which orbital shearing will disperse over time. In addition, orbital precession in the non-spherical potential of a Milky Way-like system causes orbits to diverge on a time-scale of several Gyr (Ibata et al. 2002; Siegal-Gaskins & Valluri 2008). Since the effects of sub-halo encounters are initially fairly local, only old GC streams (from star clusters accreted long ago) will have had time to experience subhalo heating over significant stretches of the stream. Recent models suggest that the GD-1 stream is between 3-5.5 Gyr old (Gialluca et al. 2021), suggesting it might not be old enough to have been heated by subhalos along its entire extent. Ongoing and future observations of the GD-1 stream with DESI will enable us to determine whether the cocoon is a local or a much more extended feature.\n\nPerturbations from a massive Sagittarius dwarf: — de Boer et al. (2020) proposed that the spur in GD-1 could have been caused by interaction of the Sagittarius dwarf spheroidal galaxy (Sgr) with the GD-1 stream. Dillamore et al. (2022a) showed that if the Sgr dwarf was originally more massive than 4 × 1010 M☉, gravitational torques from it would affect tidal streams (like Pal-5 and GD-1) that lie within the orbital pericenter radius of Sgr. Such torques can cause asymmetries between the leading and trailing arms due to the folding back of one of the arms as well as the appearance of off-stream structures like the GD-1 “spur” and “blob” (Price-Whelan & Bonaca 2018) (the “blob” overlaps with the cocoon we characterized in previous subsections). Perturbations from a massive Sgr may even produce structures that appear like a separate stream on the sky but with kinematics similar to the main stream. Dillamore et al. (2022a) show that if Sgr has affected the GD-1 stream it could have also produced a thin offset stream similar to Kshir, a stream intersecting GD-1 discovered by (Malhan et al. 2019a).\n\nIn practice more than one of the above processes could have affected the GD-1 stream to varying degrees: the cocoon could have contributions from both pre-accretion tidal heating, stars from the parent dwarf galaxy and heating from sub-halo encounters. Additional observations, as well as modeling, will help to untangle the contributions from various processes.\n\nRecently Ibata et al. (2023) also identified a two-component structure for the GD-1 stream. They used the VLT/UVES spectrograph to follow up potential GD-1 candidates detected in the Gaia EDR3 and DR3 catalogs. The VLT/UVES data have velocity precision of 1 km s-1. They also obtained observations with the IDS long-slit spectrograph on the 2.5m Isaac Newton Telescope which have a lower velocity precision (≈ 10 km s-1). Using 323 stars with line of sight velocity measurements they find a two component fit with velocity dispersions for the “thin stream” to be ω = 7.4 ± 1.1 km s-1 while the cocoon has a velocity dispersion ω = 29.1 ± 6.1 km s-1 with a fraction of 0.73 ± 0.09 in the thin component.\n\nOur analysis in section 4 is restricted to a narrow range of ε1 values and implies a much smaller velocity dispersion of 5-8 km s-1 than found by Ibata et al. (2023). Their analysis is applied to the entire stream (100 < ε1 < 20) while our analysis above is restricted to (30 < ε1 < 0). When we use data from DESI, SDSS+LAMOST, MMT (all the data within the dashed red curves in Figure 4) to estimate the width of the thin stream and cocoon we find that the velocity dispersions of the thin component and cocoon are 1.89 ± 0.38 km s-1 and 7.68 ± 0.72 km s-1 respectively with a thin stream fraction Q = 0.58. Although these values are probably dominated by our measurements in the cocoon area, they are significantly smaller than the estimates from Ibata et al. (2023). While our estimated velocity dispersion for the thin stream component is more consistent with previous work on the GD-1 stream’s thin component as well as other GC streams. Our estimated velocity dispersion for the cocoon is also more consistent with simulation predictions (Malhan et al. 2020; Carlberg & Agler 2023).\n\nAt the present time it is not possible to draw definitive conclusions as to the origin of the cocoon component of the GD-1 stream. The more important conclusion is that the GD-1 stream does have narrow and wide components approximately as expected in Milky Way simulations with an accreting sub-halo population. These initial data suggest that definitive conclusions will be possible as increased numbers of stars in individual streams become available and more streams are studied."
    },
    {
        "id_": "4c73887b-453e-40d7-bbae-026849e116fe",
        "text": "# The DESI view of the GD-1 Stream and Cocoon\n\nIn addition to the mechanisms discussed in the previous section, there have been recent studies of at least a few other factors that can affect the structure and kinematics of tidal streams like GD-1.\n\nIt is thought that the massive merger in the Milky Way’s history referred to as the Gaia-Enceladus-Sausage event (Belokurov et al. 2018; Helmi et al. 2018) could have resulted in the disk of the Milky Way becoming misaligned with the resulting triaxial dark matter halo (Dillamore et al. 2022b; Han et al. 2022, 2023) or otherwise cause torques on the stellar disk which cause it to tilt as it realigns with the halo. Simulations show that the tilting rate of disks following mergers can have angular speeds of → 10 ↓ 20 km s →1 kpc→1 (e.g., Earp et al. 2017; Dodge et al. 2023). Recently Nibauer et al. (2023) showed that the gravitational torque from such a tilting disk can cause both narrowing and broadening (depending on the magnitude and direction of tilting) of tidal streams with pericenters within → 20 kpc. Tilting can also cause changes in the line-of-sight width ϖε 2 as well as the width of the radial velocity distribution. They show that several of the features of the Pal-5 stream are consistent with a disk tilting rate of 15 km s→1 kpc→1. While these authors do not discuss the GD-1 stream it could also be affected by disk tilting since its pericenter radius is < 20 kpc.\n\nDespite the large number of possible origins for the cocoon described in this and the previous subsection, detailed models and additional spectroscopic data may enable us to determine its origin."
    },
    {
        "id_": "2bbe0a48-5c8e-4520-998e-30df9afc504d",
        "text": "# 5.4. GD-1 data expected from future DESI data releases\n\nFuture DESI data releases will include many more GD-1 members. The first year of the DESI main program (Year 1) has already obtained spectra for → 350 GD-1 members from a total of → 1300 targets observed in the stream area (2000 square degrees). Targets were selected by CMD and proper motion cuts and most were observed as part of secondary and tertiary observing programs designed for future survey planning purposes. The regions with confirmed members span ↓75↑ < ε 1 < 15↑. The sample of confirmed members include stars down to r = 21 (the velocity uncertainty at the faint end is → 15 km s →1). Current plans for the future include observing up to ninety 3↑ diameter fields in the GD-1 stream region. It is anticipated that by the end of the 5-year program DESI will obtain spectra for → 3000 GD-1 stream members, making it one of the most thoroughly surveyed GC streams.\n\nMV gratefully acknowledges financial support from NASA-ATP award 80NSSC20K0509. SK acknowledges support from the Science & Technology Facilities Council (STFC) grant ST/Y001001/1. T.S.L. acknowledges financial support from Natural Sciences and Engineering Research Council of Canada (NSERC) through grant RGPIN-2022-04794. APC acknowledges support from a Taiwan Ministry of Education Yushan Fellowship and the Taiwan National Science and Technology Council (NSTC) grants 109-2112-M-007-011-MY3 and 112-2112-M-007-017-MY3. This material is based upon work supported by the U.S. Department of Energy (DOE), Office of Science, Office of High-Energy Physics, under Contract No. DE–AC02–05CH11231, and by the National Energy Research Scientific Computing Center, a DOE Office of Science User Facility under the same contract. Additional support for DESI was provided by the U.S. National Science Foundation (NSF), Division of Astronomical Sciences under Contract No. AST-0950945 to the NSF’s National Optical-Infrared Astronomy Research Laboratory; the Science and Technology Facilities Council of the United Kingdom; the Gordon and Betty Moore Foundation; the Heising-Simons Foundation; the French Alternative Energies and Atomic Energy Commission (CEA); the National Council of Science and Technology of Mexico (CONACYT); the Ministry of Science and Innovation of Spain (MICINN), and by the DESI Member Institutions: https://www.desi.lbl.gov/collaborating-institutions. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the U. S. National Science Foundation, the U. S. Department of Energy, or any of the listed funding agencies.\n\nThe DESI Legacy Imaging Surveys consist of three individual and complementary projects: the Dark Energy Camera Legacy Survey (DECaLS), the Beijing-Arizona Sky Survey (BASS), and the Mayall z-band Legacy Survey (MzLS). DECaLS, BASS and MzLS together include data obtained, respectively, at the Blanco telescope, Cerro Tololo Inter-American Observatory, NSF NOIRLab; the Bok telescope, Steward Observatory, University of Arizona; and the Mayall telescope, Kitt Peak National Observatory, NOIRLab. NOIRLab is operated by the Association of Universities for Research in Astronomy (AURA) under a cooperative agreement with the National Science Foundation. Pipeline processing and analyses of the data were supported by NOIRLab and the Lawrence Berkeley National Laboratory (LBNL). The Legacy Surveys also use data products from the Near-Earth Object Wide-field Infrared Survey Explorer (NEOWISE), a project of the Jet Propulsion."
    },
    {
        "id_": "9290b5b3-5ee4-4e63-815e-781758089c9f",
        "text": "# Valluri et al.\n\nLaboratory/California Institute of Technology, funded by the National Aeronautics and Space Administration. This paper made use of the Whole Sky Database (wsdb) created and maintained by Sergey Koposov at the Institute of Astronomy, Cambridge, with financial support from STFC and the European Research Council (ERC).\n\nThe authors are honored to be permitted to conduct scientific research on Iolkam Du’ag (Kitt Peak), a mountain with particular significance to the Tohono O’odham Nation.\n\nFor the purpose of open access, the author has applied a Creative Commons Attribution (CC BY) licence to any Author Accepted Manuscript version arising from this submission.\n\nThis work has made use of data from the European Space Agency (ESA) mission Gaia7, the Gaia Data Processing and Analysis Consortium (DPAC8).\n\nThis work has made use of data from the Sloan Digital Sky Survey. Funding for SDSS-III has been provided by the Alfred P. Sloan Foundation, the Participating Institutions, the National Science Foundation, and the U.S. Department of Energy Office of Science. The SDSS-III web site is http://www.sdss3.org/.\n\nThis work also utilized data from the LAMOST survey. Data behind all figures in this paper are available as FITS files at: https://zenodo.org/records/11638330 DOI: 10.5281/zenodo.12535192."
    },
    {
        "id_": "bced49b9-73a0-4981-b6dc-e64ca66a00ca",
        "text": "# APPENDIX"
    },
    {
        "id_": "6a9f9209-1685-47d1-a64f-425f34011fcc",
        "text": "# A. MEASURING THE DISTANCE STREAM TRACK\n\nTo calibrate the distance gradient along the stream, we use the proper motion and parallax selection described in Section 3 and then focus on the subgiant branch stars as those form a narrow sequence on the CMD (see Figure 3). Specifically we select stars with 0.25 < g ↓ r < 0.4 and assume that the subgiant branch has an approximately constant r + 4(g ↓ r). The figure 13 shows the r + 4(g ↓ r) ↓ 4.5 vs. ε1 for likely GD-1 subgiant stars. The red curve shows our fiducial distance modulus vs. ε1 relation."
    },
    {
        "id_": "29da5f26-af59-48e6-a015-5493d44d2b1b",
        "text": "# B. TABLE OF DESI-EDR MEASUREMENTS IN THE GD-1 AREA\n\n|TARGET ID|RA|Dec|VGSR|[Fe/H]|V err|[Fe/H] err|\n|---|---|---|---|---|---|---|\n|Measurements from the RVS pipeline. The VGSR measurements have been corrected by 0.93 km s-1, the systematic error on RV measurements reported in (Koposov et al. 2024). No corrections have been applied to [Fe/H] measurements. RA and Dec values are from Gaia-DR3.|Measurements from the RVS pipeline. The VGSR measurements have been corrected by 0.93 km s-1, the systematic error on RV measurements reported in (Koposov et al. 2024). No corrections have been applied to [Fe/H] measurements. RA and Dec values are from Gaia-DR3.|Measurements from the RVS pipeline. The VGSR measurements have been corrected by 0.93 km s-1, the systematic error on RV measurements reported in (Koposov et al. 2024). No corrections have been applied to [Fe/H] measurements. RA and Dec values are from Gaia-DR3.|Measurements from the RVS pipeline. The VGSR measurements have been corrected by 0.93 km s-1, the systematic error on RV measurements reported in (Koposov et al. 2024). No corrections have been applied to [Fe/H] measurements. RA and Dec values are from Gaia-DR3.|Measurements from the RVS pipeline. The VGSR measurements have been corrected by 0.93 km s-1, the systematic error on RV measurements reported in (Koposov et al. 2024). No corrections have been applied to [Fe/H] measurements. RA and Dec values are from Gaia-DR3.|Measurements from the RVS pipeline. The VGSR measurements have been corrected by 0.93 km s-1, the systematic error on RV measurements reported in (Koposov et al. 2024). No corrections have been applied to [Fe/H] measurements. RA and Dec values are from Gaia-DR3.|Measurements from the RVS pipeline. The VGSR measurements have been corrected by 0.93 km s-1, the systematic error on RV measurements reported in (Koposov et al. 2024). No corrections have been applied to [Fe/H] measurements. RA and Dec values are from Gaia-DR3.|\n\n7 https://www.cosmos.esa.int/gaia\n\n8 https://www.cosmos.esa.int/web/gaia/dpac/consortium"
    },
    {
        "id_": "2fc0537d-2c52-4a54-97e9-cd0951bb9d10",
        "text": "# The DESI view of the GD-1 Stream and Cocoon"
    },
    {
        "id_": "61259a76-a511-4ef4-a614-ca65fbd234a3",
        "text": "# Figure 13\n\nLeft: The stream distance gradient from the subgiant branch stars. The greyscale shows the distribution of the r + 4(g → r) → 4.5 (a proxy for distance modulus) as a function of ω1 for stars with 0.25 < g → r < 0.4. The subgiant branch stars form a narrow sequence in the figure. The red curve shows the adopted distance gradient model (shifted down by 0.5 magnitudes for clarity). Right: Various relations for the distance to the GD-1 stream as a function of ω1 from Price-Whelan & Bonaca (2018) (blue dot-dashed), de Boer et al. (2018) (green dashed), Li et al. (2018) (black solid) and this work (red solid)."
    },
    {
        "id_": "c7f93dba-0bc2-4660-8754-aa2758d1fd44",
        "text": "# Table 4: DESI-EDR Observations of GD-1 region (data in Fig 4a)\n\n|TARGET-ID|RA [deg]|Dec [deg]|ω1 [deg]|ω2 [deg]|VGSR [km s-1]|V err [km s-1]|[Fe/H] [dex]|[Fe/H] err [dex]|\n|---|---|---|---|---|---|---|---|---|\n|39633374|192.76|58.91|-3.70|0.49|125.44|1.91|-1.92|0.05|\n|39633362|191.93|57.92|-4.44|-0.29|113.64|1.49|-1.50|0.036|\n|39633377|191.69|59.30|-4.10|1.03|130.81|1.74|-1.75|0.038|\n|. . .|. . .|. . .|. . .|. . .|. . .|. . .|. . .|. . .|\n|. . .|. . .|. . .|. . .|. . .|. . .|. . .|. . .|. . .|"
    }
]