[
    {
        "id_": "5c98d702-5d68-4c14-8014-2806be001d0f",
        "text": "# 1 Introduction\n\nAccurate nanoparticle characterization in terms of size, shape, and composition in complex biological environments is crucial to understanding the relation between nanoparticle structure and function as well as to achieving the full potential of nanoparticle-assisted applications within several fields, including drug delivery[1, 2] and medical diagnostics[3, 4]. Traditionally, such characterization has been performed on the individual particle level using high spatial resolution methods, such as cryogenic."
    },
    {
        "id_": "a4b01bab-b8bd-4a95-8095-0b5affa5cd47",
        "text": "# Characterization of Nanoparticles\n\nTransmission electron microscopy (cryo-TEM) [5], whereas light scattering techniques have been employed to perform quick nanoparticle characterization on an ensemble level. Two examples of such light scattering techniques routinely used to characterize nanoparticle suspensions are dynamic light scattering (DLS) [6], connecting particle diffusivity to size, and multi-angle light scattering (MALS) to characterize both size and structure [7, 8].\n\nHowever, none of these approaches are satisfactory to characterize heterogeneous nanoparticle samples: electron microscopy is an ex-situ approach suffering from low throughput, while ensemble approaches measure an averaged signal over many individual particles, masking their underlying heterogeneity [9]. This is particularly problematic for biological nanoparticles, which often display a pronounced heterogeneity in terms of size and composition, which furthermore may be a deciding factor for their biological function [10].\n\nIn this context, single particle characterization using label-free light scattering microscopy has emerged as an alternative route, achieving widespread use in the last two decades. In fact, the first use of optical microscopy for the characterization of nanoparticles was done over 100 years ago, which relied on orthogonal illumination and detection pathways to achieve darkfield microscopy [11]. Although nanoparticles are smaller than the optical resolution limit, it is still possible to detect individual nanoparticles as long as the signal-to-noise is high enough, which in turn enables detailed measurements on the single particle level. Modern implementations image the particles onto sensitive cameras and quantify a combination of the scattering signal and particle motion to achieve high-throughput characterization of particle samples [12–16]. From the nanoparticle motion, the size is estimated via the Stokes-Einstein relation, which relates diffusivity to size for spherical particles in a viscous medium [17]. The use of nanoparticle motion to estimate size has achieved widespread application under the name Nanoparticle Tracking Analysis (NTA) and exemplifies how scattering microscopy extends traditional ensemble-based characterization approaches to characterize nanoparticles with single nanoparticle resolution [14, 15, 18].\n\nGoing beyond diffusivity-based particle sizing, over the past decade numerous optical microscopy methods have been developed, aiming at multiparametric nanoparticle characterization with single-particle resolution [13–16, 19–23]. All these techniques rely on the following fundamental observation: the amount of light scattered and absorbed by an object is to a first approximation proportional to its volume and refractive index contrast relative to the surrounding medium. The refractive index is a complex-valued material-specific property dictating the efficiency of a material to scatter and absorb light [24]. The real part of the refractive index governs light scattering, while the imaginary part of the refractive index governs light absorption. Thus, optical nanoparticle characterization can distinguish between different types of particles based on their ability to scatter and absorb light [12, 25]. In the specific case of biological nanoparticles, the total amount of light scattered is to a first approximation proportional to particle mass [26–28]. In addition to the scattering amplitude, the relative amount of scattering to different scattering angles can also be used to characterize nanoparticle samples [23, 29].\n\nTo give some specific examples, some types of nanoparticles that can be characterized using scattering microscopy are highlighted in Figure 1, showcasing typical values of the respective sizes and refractive indices. For objects much smaller than the wavelength of the illuminating light, such as individual biomolecules, the relative amount of light scattering at different angles has a weak particle size dependence [7, 8]. For such particles, it is sufficient to determine the scattering amplitude in a limited range of angles to characterize particle mass. This has been utilized to determine the mass of individual proteins [12, 27, 30]. For larger biomolecular complexes, such as viruses, liposomes, and protein aggregates, the scattered light amplitude integrated over all scattering angles is still related to their mass. However, interference effects between the scattered light from individual molecular elements within the complexes generate a directionality of the scattered light, such that the light amplitude measured in a scattering microscope will depend on the measurement geometry [24]. For instance, a liposome, consisting of a lipid bilayer shell with a water-filled core, will scatter light differently from a drug-containing nanoparticle of the same size and mass, simply due to a different spatial distribution of biomolecules. This fact has been utilized to distinguish empty liposomes from exosomes filled with biological material through simultaneous characterization of scattering amplitude and size [15].\n\nMetallic nanoparticles present another example of widely used nanoparticles that can be characterized using scattering microscopy [12]. Such nanoparticles interact much more strongly with the illuminating light compared to biological nanoparticles of the same particle size due to the refractive index difference between gold and water is larger than that of biomolecules and water (Figure 1)."
    },
    {
        "id_": "39c80a86-41c6-4ac1-ac9d-f12565bc8861",
        "text": "# Metallic nanoparticle"
    },
    {
        "id_": "127e7b9d-5d15-4e59-8cee-9c9c557878c7",
        "text": "# Protein"
    },
    {
        "id_": "9777eb24-72d0-4c7d-ba3f-9af3a080a6f0",
        "text": "# Drug carrying nanoparticle"
    },
    {
        "id_": "f95d3df0-43c2-4de3-852e-6c123e84c56e",
        "text": "# Virus"
    },
    {
        "id_": "b3f6bde1-922b-49cc-a070-6a7030d76512",
        "text": "# Liposome"
    },
    {
        "id_": "64e99d26-4973-4cd0-aef1-29a05ef53fef",
        "text": "# Protein aggregate"
    },
    {
        "id_": "80afef1a-a802-4b25-811f-95628245d27b",
        "text": "# Refractive index of water (1.33)\n\nTypical diameter\n5 nm\n100 nm\n200 nm\nFig. 1: Typical nanoparticles studied in scattering microscopy, organized by size and refractive index. The size range of nanoparticles typically studied by scattering microscopy techniques ranges from individual biomolecules to large biomolecular complexes.\n\nMoreover, in contrast to biological nanoparticles, they typically display considerable light absorption in addition to light scattering, as a result of plasmonic resonance. This plasmonic resonance, in turn, depends on particle size and shape [31]. Thus, to fully characterize such nanoparticles it is important to use an experimental design capable of quantifying both the scattered as well as the absorbed light.\n\nFrom the above considerations, it becomes clear that while individual biomolecules can be characterized based on the measured scattered light alone, the characterization of more complex structures requires an experimental design and data analysis pipeline that is optimized for the specifics of the sample. Therefore, although method development and refinement are likely to continue and further expand the information that can be extracted from microscopy images, it will always be imperative to choose an experimental design that maximizes the amount of useful information about the investigated sample in the recorded scattering pattern, and an image analysis approach that optimally utilizes that information.\n\nThe purpose of this tutorial is to guide the reader in this process by providing:\n\n1. a theoretical understanding of how the image formed in a light scattering microscope,\n2. an understanding of how to quantify physical properties of the measured nanoparticles from their corresponding microscopy image,\n3. clear guidelines on how to choose the right measurement modality for specific purposes, and\n4. a toolbox for performing optical nanoparticle characterization using scattering microscopy, in the form of Python notebooks containing ready-to-use code for particle detection and characterization.\n\nThe importance of considering these aspects is highlighted by a few examples from the literature."
    },
    {
        "id_": "b206066c-a8d5-4586-87e6-00fc44468c74",
        "text": "# 2 Image formation in a scattering microscope\n\nA light scattering microscope is a device where the scattered light from micro- and nanosized objects is collected and recorded by, for example, a camera or photomultiplier tube (Figure 2A). Most commonly, a microscope objective is used to collect the scattered light from the objects (although lens-free solutions exist as well [32]). On the opposite side of the objective, another lens called the tube lens, collects the light from the objective to form an image onto the camera. The objective, tube lens, and camera together define the optical axis."
    },
    {
        "id_": "b00d6598-05a8-4a7f-9bce-7256725b2a83",
        "text": "# The properties of the objective and the sample illumination largely determine the scattering information that propagates to the camera in a scattering microscope.\n\nFirst, consider an objective illuminated by a plane wave, which corresponds to a collimated sample illumination with a constant intensity profile propagating along the optical axis. At the back focal plane of the objective, this wave is focused to a spot centered on the optical axis (Figure 2B). A plane wave that is tilted by an angle ω relative to the optical axis will produce a focused spot at the back focal plane that is offset by a distance f sin ω relative to the optical axis, where f is the back focal length of the objective."
    },
    {
        "id_": "0c258d08-9120-4583-8ab2-ffce117f5ae4",
        "text": "# Box 1: Focusing of a plane wave by an objective\n\nFrom a mathematical standpoint, the microscope objective can be represented by a pupil function P(ω), defining the transmittance of plane waves with incident angle ω on the objective (Figure 2C). For an ideal objective, the pupil function is\n\n|Condition|P(ω)|\n|---|---|\n|ω < ωmax|1|\n|otherwise|0|\n\nwhere ωmax is the largest incident angle accepted by the objective. This is related to the numerical aperture (NA) of the objective as NA = nNA sin ωmax, where nNA is the refractive index of the media between the objective front lens and the sample.\n\nNow, consider an objective illuminated by a plane wave propagating at an angle ω relative to the optical axis and at an angle ε relative to the x-axis. The optical field a at the back focal plane is then given by\n\nEbfp(x, y) = A Pˆ(k(x → f sin ω cos ε), k(y → f sin ω sin ε)),\n\nwhere the function Pˆ is the transfer function of the objective, z = f is the back-focal length of the objective lens, and k = 2ϑ/ϖ where ϖ is the wavelength of light (Figure 2B). For an objective without optical aberrations, the transfer function under the paraxial approximation is given by\n\nPˆ(p, q) = 2 J1(NA√(p2 + q2)),\n\nwhere J1 is the first-order Bessel function. Thus, all incoming plane waves are transformed into tightly focused spots in the back-focal plane, and the position of each spot in the back-focal plane depends on its incident angle.\n\na In optical microscopy, the optical (or light) field is often used instead of the electric field. The difference between the two fields is a normalization constant that affects how the fields relate to the measured light intensity, where the measured light intensity at a camera is equal to the squared modulus of the optical field.\n\nb The transfer function is the Fourier transform of the pupil function.\n\nAs it turns out, a general incident optical field can be described as a linear combination of plane waves with different incident angles ω relative to the optical axis (Box 2), and ε relative to an at this point arbitrarily defined x-axis perpendicular to the optical axis. Connecting this to the specific topic of this tutorial, consider a nanoparticle located at the front focal plane of the objective (Figure 2C), illuminated by a plane wave propagating along the optical axis. This produces a scattered optical field E, which can be decomposed as a sum of plane waves Eˆ(ω, ε), each propagating with specific angles ω and ε. The field at the back focal plane can then be obtained by summing the contributions from all such plane-wave components, each of which produces a focused spot as in Figure 2B. Although the general expression is fairly complicated, an approximate form of the field at the back-focal plane can be obtained by utilizing that each plane wave component contributes to the summation only close to the center of the corresponding focused spot. Under this approximation, the field at the back focal plane is given by\n\nEbfp(ϱ = f sin ω) ↑ Eˆ(ω, ε)  ω < ωmax.\n\nThus, the field at the back focal plane mirrors the angular distribution of the scattered light, for scattering angles ω < ωmax (Figure 2C)."
    },
    {
        "id_": "7dd74203-adc0-474f-a502-78a2649f6c7f",
        "text": "# Fig. 2: Propagation of the scattered light through a scattering microscope.\n\n|A)|B)|z-axis|L-dxis|\n|---|---|---|---|\n|Illumination|Lamp lens|Sample plane|Sample plane|\n| |Condenser|Front focal plane| |\n| |Sample|Objective| |\n| |Back focal plane|Back focal plane| |\n| |Tube lens|Camera| |\n| |Image plane|Image plane| |\n\nA) A general scattering microscopy setup. The sample is illuminated by a plane wave. Both the illuminating light and the scattered light from particles in the sample propagate through the optical system and are recorded by a camera.\n\nB) The image obtained by a scattering microscope is largely determined by the objective lens. Plane waves entering into the objective are transformed into a focused spot at the back focal plane. When the objective is illuminated by a plane wave impinging on the objective at an angle ω with respect to the optical axis and at an angle ε relative to the horizontal axis, this tightly focused spot is offset a distance ϱ = f sin ω away from the optical axis.\n\nC) The scattered field from a nanoparticle can be considered a linear combination of many plane waves, incident on the objective with different angles ω and ε. Each such plane wave produces a similar spot as described in B). Summing up, all these plane wave contributions produce a field at the back focal plane as shown in the inset, which, in the case of particles much smaller than the wavelength of light to a first approximation, reassembles that of a plane wave. Notice the sharp cutoff, highlighted as a circle in the inset. This is due to the limited angular range admitted by the objective and is set by the objective NA.\n\n5"
    },
    {
        "id_": "ed8c423c-a039-440f-8d54-ea4f1abf4198",
        "text": "# Box 2: Decomposition of the optical field in plane wave components\n\nSimilar to how a time-dependent signal can be decomposed to a sum of contributions with different amplitudes and frequencies, an optical field can be decomposed to a sum of plane waves with different wave vectors (or spatial frequencies). Each such plane wave component can mathematically be written as:"
    },
    {
        "id_": "14853e85-478e-4102-8bb4-4d6e8cdb6619",
        "text": "# k (x) = eik·x (5)\n\nConsider a monochromatic optical field E (meaning that the field consists of light with a single frequency), evaluated on a plane (the xy-plane) perpendicular to the optical axis. Its plane wave decomposition reads:\n\nE(x) = ∫ eik·x ˆ(k)dk, E (6)\n\nwhere k is the projection of the wave vector of the plane wave component # k on the xy-plane, and ˆ(k) is a coefficient describing both amplitude and phase of the plane wave component #.\n\nThese components are found through the inverse transform of Eq. (6):\n\nEˆ(k) = (2ϑ) →2∫ e−ik·x E(x)dx. (7)\n\nSince k is a projection of the wave vector onto the xy-plane orthogonal to the optical axis, it follows that |k| = k sin ω, where k = (2ϑnm/ϖ) is the wave number of the light and ω is the angle between the propagation direction of the plane wave component and the optical axis. The mathematically versed reader may recognize that these equations resemble Fourier transforms. In fact, the plane wave decomposition is identical to the Fourier transform, except that the integration over k is restricted for the reason outlined above. Specifically, denoting the Fourier transform operator by F, the above equations can be written as:\n\nE(x) = F−1[E(k)C(k)] (8)\n\nEˆ(k) = F[E(k)], (9)\n\nwhere C(k) = 1 for |k| < k, and 0 otherwise. In the case of a circularly symmetric scattered field, as is often the case for the scattered field from nanoparticles, the decompositions above are more conveniently expressed in polar coordinates. In this case, one obtains:\n\nE(ϱ) = ∫ sin ω cos ω Eˆ(ω)J0(kϱ sin ω)dω, (10)\n\nwhere the integration now runs over the propagation angle ω with respect to the optical axis instead of the wave vector projection k. The coefficients Eˆ(ω) are similarly found by:\n\nEˆ(ω) = k2∫ ϱE(ϱ)J0(kϱ sin ω)dϱ. (11)\n\nTo form an image of the sample on the camera, a lens (tube lens) is placed between the objective and camera, such that an incoming plane wave to the objective enters the camera as a plane wave, and light scattered from a point source at the focal plane of the objective forms a focused image on the camera. As a result of this, the plane wave components of the field at the camera plane reproduce exactly the plane wave components impinging on the objective, for all ω < ωmax. Mathematically, this is expressed as:\n\nEˆcam(ω, ε) = Eˆ(ω, ε)P(ω). (12)\n\nNow, we have a mathematical framework for relating the field at the focal plane to the fields at the back-focal plane and the camera. This framework involves decomposing the field into its plane wave components, applying the optical transfer function, and summing up the contributions from the individual components.\n\nIn the context of scattering microscopes, the optical field at the focal plane is typically a superposition of the illuminating field Eill, and the field scattered by objects in the sample Esca. The field at"
    },
    {
        "id_": "ef3a0699-767b-4ece-a90e-18351b8692ab",
        "text": "the camera is then given by\n\nEˆcamera(ω, ε) = Eˆill(ω)P(ω) + Eˆsca(ω, ε)P(ω) (13)\n\nHowever, the microscope camera does not record the angular components of the incident field; instead, it records the spatial distribution of the incident field intensity. This is given by the modulus squared of the spatial distribution of the optical field. The intensity recorded by the camera can be written as\n\nIcam(x, y) = |Eill + Esca(x, y)|2 = |Eill|2P(ωill) + |Esca(x, y)|2 + 2|Eill|↓(Esca(x, y) ↑ eiω)P(ωill), (14)\n\nwhere the spatial distributions of the illuminated and scattered fields are related to their plane wave components through Eq (10) (Box 2), and ς represents the phase difference of the illuminating field relative to the scattered field. For completeness, in Box 3 the contributions from the individual plane wave components to the measured intensity is described."
    },
    {
        "id_": "df582338-cc61-4bb9-b862-f09b4ba30de7",
        "text": "# Box 3: Decomposition of the recorded intensity into plane wave components\n\nThe formalism introduced in Box 1 allows us now to investigate how the plane wave components of the scattered and illuminating light contribute to the recorded intensity. At the camera plane, the scattered field is given by the Fourier transform of the field at the back focal plane of the objective. Since the objective only admits plane wave components with angles relative to the optical axis ω ↔ ωmax, it follows that it only admits plane waves with projected wave vectors |k| ↔ k sin ωmax. The scattered field at the camera plane is therefore given by\n\nEsca(x) = ∫ eik·x ˆsca(k) PE(k) dk, (15)\n\nwhere PE is the pupil function expressed in terms of the projected wave vectors instead of the propagation angle, given by PE(k) = 1 for |k| ↔ k sin ωmax and 0 otherwise. In the specific case of a circularly symmetric scattered field, one has\n\nEsca(ϱ) = ∫0εmax cos ω sin ω Eˆsca(ω)J0(kϱ sin ω) dω. (16)\n\nIn this case, one finds for the second and last terms in Eq. (14)\n\n|Esca(x, y)|2 = |∫0εmax cos ω sin ω Eˆsca(ω)J0(kϱ sin ω) dω|2 (17)\n\n|Eill|↓(Esca(x, y) ↑ eiω)P(ωill) = P(ωill)|Eill|P(ωill) ∫0εmax cos ω sin ω J0(kϱ sin ω)↓(Eˆsca(ω) ↑ eiω) dω. (18)\n\nIn this expression, it is assumed that the field reaching the camera is not magnified by the objective. The effect of magnification is essentially to reduce the propagation angle ω of an optical field with respect to the optical axis. The effect of magnification can be taken into account by replacing the argument of J0 with M kϱ sin ω, where M is the magnification. Similarly, the function PE = 1 for |k| ↔ k sin ωmax/M and 0 otherwise in the case of a non-unitary magnification.\n\nThe first two terms of Eq. (14) describe the intensities of the illuminating field and the scattered field independently. The third term describes the interference of the scattered field with the illuminating field and contains information about the relative phases of the two fields. Notice that the first and last of these terms are relevant only for illumination angles for which P(ωill) > 0.\n\nThe amount of light scattered from a nanoparticle is generally much smaller than the amplitude of the light that is incident on it. Thus, in a transmission scattering measurement, as depicted in Figure 2A, the first term of Eq. (14) will dominate over the last two terms, resulting in a small signal-to-background ratio. Three strategies are traditionally used to overcome this signal-to-background ratio.\n\n7"
    },
    {
        "id_": "8d32333e-1be5-4158-b4e8-baea119b7f36",
        "text": "# Limitation for Quantitative Characterization of Subwavelength-Sized Particles\n\ni) Darkfield microscopy enhances the contrast by only allowing the scattered light to reach the camera, ii) interferometric scattering techniques instead focus on quantifying the interferometric term, while iii) quantitative field microscopy uses the interference of the field at the camera plane with another optical field to quantify the complex-valued field itself instead of only the real part of the interference between the optical fields of the particle and the background. All mentioned strategies have in common that they are designed to manipulate one or more of the terms in Eq. (14) to enhance their performance, and the details of how this is achieved using the three techniques mentioned above are discussed in the following subsections."
    },
    {
        "id_": "4e678765-d5c5-47c7-83e8-400966a8d851",
        "text": "# 2.1 Darkfield Microscopy\n\nDarkfield microscopy is a widely used technique to enhance the contrast of small particles, being a relatively simple but powerful configuration. It has been used for over 100 years [11] and is still one of the standard techniques to characterize the hydrodynamical radius of nanoparticles using NTA [13,35]. Darkfield techniques aim to only allow the scattered light to reach the camera, thereby suppressing all terms except the second term in Eq. (14). In this way, the scattered light from the particles appears as bright dots against a dark background (Figure 3A) (hence the name “darkfield”). Since there is no background signal, the darkfield signal is given by\n\nIDF = |Esca|2.\n\nSuch background suppression can be achieved by a vast range of microscope configurations, where the choice of configuration affects the relation between the properties of the particles and the measured signal. The most common ways of achieving such background rejection rely on using an illumination angle outside the range captured by the objective (Figure 3B), spatial blocking of the excitation beam (Figure 3C), or an evanescent illumination (Figure 3D) [12]."
    },
    {
        "id_": "a7762450-33e3-4dca-a331-9f87dfbd8145",
        "text": "# Fig. 3: Darkfield Microscopy Setups\n\n- A) In darkfield microscopy, the particles are visible on the camera as bright spots against a dark background.\n- B) Darkfield through oblique illumination: the sample is illuminated by light at an angle larger than the maximum angle admitted by the objective so that the illuminating light is prevented from propagating through the optical system.\n- C) Darkfield using spatial blocking: the illumination light is blocked at the back focal plane using a physical filter.\n- D) Evanescent field imaging: one utilizes total internal reflection at the interface between glass and sample to produce an evanescent field. This evanescent field amplitude decays exponentially away from the surface and thus will not reach the camera while scattering from particles close to the interface can be recorded on a camera.\n\nUsing an illumination angle that lies outside the range captured by the objective achieves full background suppression while still allowing for the particle scattering to be measured for a wide range of different suspended particles (Figure 3B) [11,36,37]. This approach is commonly used in NTA setups, in which suspended nanoparticles are tracked and characterized based on their Brownian motion [36]. However, the largest angle admitted by the objective must be smaller than the illumination angle for the incoming light not to be collected, which puts a limit on the plane wave components reaching the camera and, therefore, the information content of the microscope images.\n\nDarkfield microscopy can also be achieved through spatial blocking of the excitation beam using an illumination angle within the numerical aperture of the objective (Figure 3C). It relies on the observation that at the back focal plane of the objective, the illuminating plane wave is tightly focused."
    },
    {
        "id_": "0d3c92c8-6202-44c7-800c-c718dc600300",
        "text": "# 2.2 Interferometric scattering techniques\n\nA drawback of the darkfield techniques discussed in the previous section is that the illuminating light is not recorded. Since the scattered field from a nanoparticle is proportional to the illuminating field (see Section 4 for details), quantitative nanoparticle characterization using darkfield techniques requires either detailed calibration or separate quantification of the light intensity at the sample plane.\n\nInterferometric is an approach that circumvents this problem by focusing on quantifying the last term of Eq. (14), explicitly containing the illuminating field Eill. The signal is the interference between the particle signal and a background signal, and therefore, the background signal is non-zero, representing the illuminating field amplitude (Figure 4A). This ensures an internal reference to which the scattered field can be compared.\n\nHowever, given the limited dynamic range of the detector recording the image, the signal-to-background ratio will limit the ability to detect weakly scattering particles in this measurement strategy since the particle contrast cannot be enhanced by increasing the illuminating light intensity. One way to overcome this limitation is by introducing a partially transmissive filter centered at the back focal plane of the objective (Figure 4B) [43–45]. The presence of the filter can be represented by a function T(ω),\n\nT(ω) = { φ eiωfilt if ω < ωfilt,\n\n1 otherwise\n\nwith φ < 1, such that the filter attenuates and phase shifts plane waves with incident angles ω < ωfilt [23,43,46]. If ωfilt ↗ ωmax and positioned in the back focal plane such that it attenuates the illuminating light before it can reach the camera, the filter will attenuate the illuminating light while leaving the scattered light unaffected. The recorded intensity is then, to the lowest order in the scattered field\n\nIcam = φ2 |Eill|2 + 2φ|Eill|↓(ei(ωfilt + ω) Esca).\n\nNotice that the first term is quadratic in the attenuation φ, while the second term is linear in φ. Thus, the relative importance of the two terms can be adjusted by adjusting the transmittance of the filter. However, note that depending on the value of φ the contribution of |Esca|2 may no longer be negligible. Thus, the value of φ affects which approximation that can be used when relating the scattering signal to particle properties.\n\nA different approach to tune the signal-to-background ratio is to use a reflection rather than transmission geometry, as depicted in Figure 4C [47]. This measurement geometry is in the literature typically denoted iSCAT (interferometric scattering) [48]. When using a reflection geometry with transparent coverslips, a small portion of the illuminating light will be reflected back to the camera at the interface between the coverslip and the sample. This optical field constitutes the term Eill in this geometry. Most of the light will be transmitted through the interface. This transmitted light produces the scattered field Esca from particles in the sample. Denoting the reflectivity of the interface φ, the recorded intensity is again identical to Eq. (21). In some works, these two approaches for background attenuation have been employed in parallel to achieve maximal sensitivity [27, 44]. Moreover, by using two reflections from the top and the bottom of microfluidic channels, the interference between the"
    },
    {
        "id_": "4c6c79d4-56a5-449c-b729-a602f1505e1c",
        "text": "# 2.3 Quantitative field microscopy\n\nAlthough interferometric scattering techniques have emerged as powerful techniques for particle characterization with low detection limits, only the real part of the scattered light is detected and quantified. Quantitative field microscopy, by contrast, achieves quantification of the full optical field, thereby providing a more complete characterization of the scattered light. Even though quantitative field microscopy historically has mostly been used to investigate samples such as live cells [26], it has recently been shown that it is possible to detect particles down to single proteins [49].\n\nIn quantitative field microscopy, the light incident on the camera interferes with another reference field Eref to achieve quantification of the real and imaginary parts of the scattered field itself (Figure 5A). This can be achieved using several different microscopy configurations, both using a single image and multiple images to obtain the optical field [50, 51]. The trick to achieving single-image quantitative field microscopy is to let the reference field be incident on the camera at an angle ωref such that sin ωref > 3 sin ωmax /M, where M is the magnification of the optical system. From the interference with the reference field, it is then possible to quantify the optical field and its angular components (Box 4) [52]."
    },
    {
        "id_": "b14afd9e-7ffd-4118-8135-14676ba2eb2f",
        "text": "# 4: Quantifying the optical field\n\nIn quantitative field microscopy, a reference field is introduced at the camera plane, propagating at an angle ωref with respect to the optical axis. Taking the reference field to propagate parallel to the xz-plane, the field at the camera plane can be represented as a plane wave as Eref(x, y) = |Eref|eikref·x, where kref = k sin ωref ˆx. As a further simplifying assumption, we consider an illumination propagating along the optical axis. In this case, the intensity recorded by the camera reads:\n\nIcam(x, y) = |Eref|2 + |Eill|2 + 2|Eill||Eref| cos(ωref x) + 2|Eill| eiωEsca(x, y) + 2|Eref| eik sin ωref x Esca(x, y) + |Esca|2.\n\nNow, let us investigate the plane wave decomposition (the Fourier transform) of this recorded intensity. Since typically Esca ≪ Eill and Esca ≪ Eref, we keep only terms up to linear order in Esca. Further, we utilize that at the camera plane, Esca(x) = F-1[Esca(k) P˜(k)] to arrive at Esca(x)eikref·x = F-1[Esca(k → kref) P˜(k → kref)].\n\nTo arrive at:\n\nIqfcam(k) = (|Eref|2 + |Eill|2) P↼(k) + |Eill||Eref|(P↼(k → kref) + P↼(k + kref)) + |Eill| cos ς[P˜(k) Esca(k) + P˜(→k) Esca(→k)] + |Eref|[P˜(k → kref) EPsca(k → kref) + P˜(kref + k) Esca(kref + k)].\n\nAt this point, recall that the function P˜ has support only for arguments |k| < k sin ωmax/M. It is therefore possible to choose kref such that P˜(k) P(k → kref) = 0 for all values of k. Specifically, this holds if sin ωref > 2 sin ωmax/M. In this case, one finds that:\n\nIqfcam(k) P˜(k → kref) = |Eref| P˜(k → kref) EPsca(k → kref),\n\nfrom which the optical field can be reconstructed through an inverse Fourier transform. In this analysis, the term |Esca|2 was neglected. To ensure that P(k → kref) does not overlap with this term either, one can show that it is sufficient that sin ωref > 3 sin ωmax/M.\n\nThe reference field can be constructed via an external reference (referred to as off-axis holography, Figure 5B) or by interference by the illuminating field itself, for instance, by introducing a grating at the camera plane (Figure 5C) [50,51]. The different implementations have some different strengths and weaknesses regarding complexity, noise, and stability. A detailed discussion about different microscopy configurations can be found in Ref. [51].\n\nSimilar to interferometric scattering techniques, optical field measurements can also be combined with optical filters [20, 23, 46] and different illumination strategies [49, 53] to improve the detection limit. In that case, the attenuation factor φ will affect the relation between the measured particle signal and particle properties."
    },
    {
        "id_": "047f0c6b-eff9-4a61-b130-f18f4504f6b6",
        "text": "# 3 Scattering of light from nano- and microparticles\n\nIn the preceding section, the optical field was taken to be a scalar quantity to simplify the equations. In reality, the optical field is a vector with components given by the polarization state of the light. The different polarization directions scatter light slightly differently, therefore complicating the description of the scattered light. Nonetheless, as we will show below, under certain circumstances, the scalar description of light still provides an accurate description of light scattering.\n\nThe scattering of light from nanoparticles can generally be described by solving Maxwell’s equation."
    },
    {
        "id_": "84e8a266-3906-4274-bf37-530f03ad779f",
        "text": "# Fig. 5: Quantitative field microscopy setups\n\nA) In quantitative field microscopy, both the real (upper) and imaginary parts (lower) of the scattered field are quantified, where the sign and amplitude of the real and imaginary part contain particle material information [14, 54].\n\nB) Off-axis holography: the illumination light is split into two separate paths prior to the sample. The sample arm are recombined close to the camera at an angle.\n\nC) Quadriwave shearing microscopy (QWLS): the light is split using a diffraction grating after the sample. The reference light in this setup is a sheared version of the field impinging on the diffraction grating."
    },
    {
        "id_": "d3206869-6f74-421c-b32b-975ee37fe025",
        "text": "# Illuminalion\n\nThe reference arm and for electromagnetism with the appropriate boundary conditions. In the special case of spherical particles, the exact solution to this problem was derived by Gustav Mie in 1908 [24]. The field scattered by a homogeneous sphere is written as an infinite sum of special functions, which is numerically much faster to evaluate than explicitly solving Maxwell’s equations.\n\nTo gain insight into the behaviour of the scattered light and into how the light scattering is affected by particle properties, it is useful to consider limiting cases for which the Mie solution can be evaluated analytically. One such limit, which is of particular relevance for nanoparticles, is the Rayleigh limit, valid for kR ↗ 1, where k = 2π/λ and R is a characteristic size of the particle. Let the illuminating light be a linearly polarized plane wave with amplitude |Eill|, propagating along the z-axis and defining the x-axis to lie along the polarization direction. Now, the scattered wave is described both by the angle ω relative to the propagation axis of the light and by the angle ε relative to the polarization axis. The scattered field will maintain the polarization direction of the illuminating field, and its plane wave decomposition is represented as:\n\nEsca(ω, ε) = |Eill|ikθ 43 φ(ω, ε),\n\nwhere φ = (cos2 ε + sin2 ε cos2 ω) for linearly polarized light, and α is the polarizability:\n\nα = 3V (np - nm)2 / (np + 2nm)2\n\nIn this expression, V is the particle volume, np is the refractive index of the particle, and nm is the refractive index of the surrounding medium.\n\nAnother useful limit is the weakly scattering limit, that is, for kR|np/nm → 1| ↗ 1 and |np/nm → 1| ↗ 1 [24]. This is a slightly weaker condition than the Rayleigh condition, and the corresponding approximation is valid also for arbitrarily large scatterers as long as the refractive index difference compared to the surrounding medium is sufficiently small so that the inequality kR|np/nm → 1| ↗ 1 still holds. This limit is particularly useful for biological nanoparticles, which typically obey these inequalities. In this case, the polarizability is typically approximated as:\n\nα ≈ 2V (Δn/nm),\n\nwhere Δn = np - nm. In the specific case of biological nanoparticles, this expression has a particular physical interpretation since it enables the treatment of the nanoparticle as a volume made up of biomolecules at a certain concentration. The refractive index of a solution of biomolecules increases approximately linearly with the mass concentration C of molecules, as np = nm + (dn/dc) · C, where"
    },
    {
        "id_": "a8734f4b-3d28-47f2-9daf-d483d9264045",
        "text": "# (dn/dc) is called the specific refractive index increment, and is material specific. However, since most biomolecules contain similar elements at similar ratios (mostly carbon, hydrogen, oxygen, and nitrogen), the specific refractive index increments of different types of biomolecules are very similar [26]. Typical values range from ↘ 0.16 ml/g for carbohydrates to ↘ 0.2 ml/g for nucleic acids and proteins [26]. The polarizability times n m thus evaluates to n m ·↽ ↑ 2(dn/dc)C ·V = 2(dn/dc)m, where m is the total mass of the biomolecules in the nanoparticle. Thus, in the case of weakly scattering particles, the polarizability is proportional to particle mass."
    },
    {
        "id_": "ab95f16d-6105-4ed0-a081-193bfcae3371",
        "text": "# Further, the total scattered field can be calculated as the superposition of the field scattered by infinitesimal volume elements within the particle. The scattering from each such infinitesimal volume element is given by the Rayleigh scattering limit above. For weakly scattering particles, the optical field impinging on each such volume element can be approximated as equal to the incident optical field external to the particle. The scattered field from an isotropic particle, evaluated outside of the particle, is then given by [55]"
    },
    {
        "id_": "ccbb5d64-c747-4f44-8e1e-8cfc720db493",
        "text": "# E sca (ω, ε) = ik 3 |E ill |$(ω, ε)∫ drr 2 %n(r) sin qr,"
    },
    {
        "id_": "2836fcd8-3610-4596-8b71-582ae9d01f06",
        "text": "# where q = 2k sin(ω/2). This approximation is called the Rayleigh-Debye-Gans (RDG) approximation."
    },
    {
        "id_": "57b6e61e-672e-41f5-bcbc-18621425400b",
        "text": "# The integral above describes the interference of the light scattered from different volume elements in the particle. This factor is denoted the form factor and physically encodes the distribution of refractive index within the particle. The RDG field is often written in the following form,"
    },
    {
        "id_": "58ae240f-d3c2-4738-8331-2c3a94a0a3a4",
        "text": "# E sca (ω, ε) = ik 3 |E ill |↽$(ω, ε)f (ω; R),"
    },
    {
        "id_": "49b73f9c-801c-4c15-a2e2-6a85a47de9c3",
        "text": "# where f (ω; R) is the form factor, which for an isotropic particle depends on its size R and internal refractive index distribution."
    },
    {
        "id_": "74fc7fea-a935-4164-aa34-616d0b811b44",
        "text": "# Under uniform illumination, analytical solutions to the form factor within the RDG approximation can be attained for some specific geometries, such as spheres and core-shell spheres. For a spherical particle, the form factor is [7],"
    },
    {
        "id_": "e8916258-5676-4f19-b594-8b111c072fbc",
        "text": "# f sphere (ω) = (qR) 3 sin(qR) → qR cos(qR),"
    },
    {
        "id_": "fb518e2f-67f5-4315-8db8-5b90ea0683ba",
        "text": "# and for an infinitesimal spherical shell, which can be used to approximate the signal from a lipid vesicle, the form factor is [56]"
    },
    {
        "id_": "e9de4cd9-dc0f-416a-85c7-8a96abfc856d",
        "text": "# f shell (ω) = sin(qR)."
    },
    {
        "id_": "d1d66256-4a6c-46de-84ed-17332a2e3852",
        "text": "# qR"
    },
    {
        "id_": "2a113b8d-b668-40b6-b61a-56ac117ace09",
        "text": "# Note that the form factor at 0 degree scattering angle is identically equal to unity (f (0) = 1) and that the form factor for all scattering angles ω > 0 is smaller than unity (f (ω > 0) < 1). For this reason, the relation between the measured optical signal and particle size is different for different measurement geometries. This is highlighted in Figure 6, in which the form factor of spheres of different sizes is shown as a function of the scattering angle. In accordance with the discussion above, the form factor is close to one for all particle sizes for transmission geometries, for which the scattering angle is close to ω = 0. For side-scattering (exemplified in Figure 3C) and backward scattering (exemplified in Figure 4B), the form factor greatly influences the relationship between the measured optical signal and particle size. Specifically, the contribution from the form factor to the scattered light becomes appreciable for particles with qR > 1. Recalling that q = 2k sin(ω/2), one has that the form factor contribution is appreciable if R > (2k sin(ω ill /2)) →1. For an illumination wavelength of 532 nm when the particle is in water (n m ↑ 1.33), this amounts to R > 45 nm for side-scattering with ω ill = ϑ/2, and R > 30 nm for backscattering with ω ill = ϑ."
    },
    {
        "id_": "d40d9554-43c9-44f2-ab19-63dfc2abd197",
        "text": "# 4 Relation between the signal measured in a scattering microscope and physical particle parameters"
    },
    {
        "id_": "de5beadb-abe1-4e0e-aa3f-2f16761bd137",
        "text": "# Now, let us use the mathematical framework developed in Sections 2 and 3 to investigate the relation between the scattered light from a nanoparticle and the optical field at the camera plane. The crucial insight is that the angular distribution of the scattered field from a nanoparticle described in Section"
    },
    {
        "id_": "ae32a38a-45b2-4ddc-b72f-73a7d1898e85",
        "text": "# 13"
    },
    {
        "id_": "9fd5cee6-6bd1-4ac8-9619-be003ccc3b7a",
        "text": "# 1.0\n\n| | | |R = 50 nm|R = 150 nm|300|\n|---|---|---|---|---|---|\n|0.5|Forward Scattering|Side Scattering|Backward Scattering| | |\n| |n/4|n/2|3n/4| | |\n\nFig. 6: Form factors of homogeneous spheres. The form factor depends strongly on the particle size. Small particles (blue line) scatter almost uniformly, while large particles (green line) scatter predominantly in the forward direction (small angles). In forward scattering, the contribution from the form factor is close to unity in most cases. In side scattering (ω ill ↑ ϑ/2), the contribution is more pronounced, and in backward scattering (ω ill ↑ ϑ), the form factor contribution is maximal. The form factors in this plot are calculated for homogeneous spheres in water illuminated with a wavelength of ϖ = 532 nm. Shortening the illumination wavelength will compress all scattering curves to smaller scattering angles. Conversely, for longer illumination wavelengths the scattering curves will be extended to the right in the figure above.\n\n3 describes precisely the individual plane wave components used in Eq. (4). Working within the RDG approximation and assuming that the illuminating light propagates along the optical axis, we write the scattered field as:\n\nEsca(ω, ε) = i|Eill|k3 ↽f(ω)$(ω, ε), (34)\n\nwhere ↽ is the polarizability of the particle, f(ω) is the form factor, |Eill| is the amplitude of the illuminating light. The polarization function $(ω, ε) introduces an angular dependence of the scattered light that does not depend on the properties of the particles in the sample in the case of isotropic particles. In the process of signal calibration utilizing reference samples through darkfield and interferometric microscopy, this contribution will be effectively normalized away. Thus, to simplify the expressions, we will drop the polarization function $(ω, ε) in the following sections of this tutorial.\n\nFor a particle located in the focal plane of the objective (see Box 5 for a description of the general case of a particle located away from the focal plane), the scattered field at the back focal plane is then given by:\n\nEbfp(ϱ) = ik3|Eill|↽∫0εmaxcos ω sin ωf(ω) Pˆ(k(ϱ → f sin ω))dω (35)\n\nand the scattered field at the camera plane is given by:\n\nEsca(ϱ) = i|Eill|k3↽∫0εmaxcos ω sin ωf(ω)J0(kϱ sin ω)dω. (36)"
    },
    {
        "id_": "5ab47b4f-4975-4af0-9a75-458b45b1d1b0",
        "text": "# Box 5: Effect of having particle located away from the focal plane\n\nEquation (36) is valid for a scatterer located at the focal plane of the objective. In an experiment, this condition is not necessarily fulfilled. If the particle is located a distance z from the focal plane, the individual plane wave components of the scattered field must additionally be propagated to the focal plane. Since each of the components describes a plane wave propagating at an angle ω with respect to the optical axis, the angular components propagated a distance z along the optical axis are given by\n\nEˆ(ω, z) = E(ω, 0)eikz cos ε (37).\n\nThus, the scattered field from a nanoparticle located a distance z from the focal plane will, at the camera plane, reads\n\nEsca(ϱ) = i|Eill|k3↽∫0εmaxcos ω sin ωf (ω)J0(kϱ sin ω)eikz cos ε dω (38).\n\nWe will now use this expression, in combination with the definition of the RDG form factor Eq. (30), to investigate how the signal measured in a scattering microscope is related to the physical parameters of the scattering objects."
    },
    {
        "id_": "cdb6e5e6-6a43-44b2-9a98-eb7db9bd8a01",
        "text": "# 4.1 Darkfield microscopy\n\nIn the case of darkfield microscopy, the intensity measured by the camera from a particle located at the front focal plane of the objective and illuminated by a plane wave propagating along the optical axis is given by\n\nI camera (ϱ) = |E ill|2 k6 |↽|2∣∫0ε maxcos ω sin ωf (ω)J0(kϱ sin ω)eikz cos ε dω∣2 (39).\n\nSome examples of scattering patterns obtained from Eq. (39) at different defocus values z are shown in Figure 7A.\n\nTo perform particle characterization, one needs to reduce the measured scattering to a set of values representing some physical properties of the particle. The most common way of achieving this is by characterizing the integrated intensity of a scattering pattern, which in the case of darkfield microscopy is proportional to the square of the polarizability. In the case of a particle illuminated by a plane wave with ω ill = 0, one obtains for an isotropic scatterer (see Box 6 for a derivation of this result)\n\n∫ |2 k4|↽|2∫0ε maxcos ω sin ωf (ω)2 dω.\n\nI camera dA = 2ϑ|E ill (40)\n\nSimilar expressions for cases in which the illuminating field is not parallel to the optical axis can be derived by adjusting the limits of integration in the above expression. Furthermore, for small enough scatterers such that f (ω) ↑ 1, the integrated darkfield intensity is proportional to the square of the polarizability. For larger particles (kR > 1), the contribution to the measured signal from the form factor of the scatterer will depend on their size and morphology [57]."
    },
    {
        "id_": "70b829f6-186c-4017-8a58-d4034e96c556",
        "text": "# Box 6: Integrated darkfield intensity\n\nIn order to calculate the integrated scattering intensity in darkfield microscopy, it is useful to start with the expression\n\nIcam(x) = |Esca(x)|2. (41)\n\nIntegrating this over the entire detector surface, one has\n\n∫ Icam(x)dx = ∫ |Esca(x)|2 dx. (42)\n\nNow, we invoke Parseval’s theorem, stating that\n\n∫ |f(x)|2 dx = ∫ |f̂(k)|2 dk, (43)\n\nwhere f(x) and f̂(k) are Fourier transform pairs. One therefore has\n\n∫ Icam(x)dx = ∫ |Êsca(k)|2 dk, (44)\n\nfrom which Eq. (40) follows after transformation into polar coordinates and switching integration variable from the wave vector |k| to angle ω.\n\n2-+6 um\n\n1 10\n\n2-0 L 10105\n\n] 103101 Sacekwcttertagtering\n\nForward scattering\n\n2=-6 um\n\n50 100 150 200 250\n\nRadius (nm)"
    },
    {
        "id_": "920261ba-b9bd-4c95-9d30-8eb755a8a134",
        "text": "# Fig. 7: Scattered intensity in darkfield imaging\n\nA) Calculated scattering patterns of nanoparticles (radius 20 nm) suspended in water and measured in darkfield microscopy with ωill = 0 and wavelength 532 nm at different values of the defocus z. The field of view of each particle image is 10 ≃ 10 microns.\n\nB) The integrated intensity of scattering patterns measured in darkfield microscopy as a function of particle size for three illumination angles. For ωill = 0, the integrated intensity scales with the square of the volume throughout the sizes included in this calculation. For ωill ⇐= 0, distinct minima appear corresponding to the minima of the form factor.\n\nThe approaches to achieve darkfield illumination discussed in Section 2 give rise to slightly different contributions from the form factor. For darkfield imaging through spatial blocking, the illumination angle ωill = 0 in Eq. (40). In the case of darkfield illumination by oblique illumination, one instead has ωill ⇐= 0. The final case of evanescent wave scattering is slightly more complicated."
    },
    {
        "id_": "f85fd5e1-1782-4de9-acb8-bc03df5ee230",
        "text": "# 4.2 Interferometric scattering techniques\n\nThe optical field is propagating along the interface in which total internal reflection occurs. Therefore, the illumination angle is\nωill = ϑ/2. However, the form factor is slightly different since the optical field decays exponentially in the medium of the scatterers. The appropriate correction was derived in the supporting information of Ref. [57]. In Figure 7B, the integrated scattered intensity is shown as a function of particle size for a fixed refractive index for the specific cases\nωill = 0, ωill = ϑ/2 and\nωill = ϑ. As discussed in Section 3, the larger the\nωill, the smaller the size region for which there is a unique relation between scattering signal and size for a known particle refractive index.\n\nFig. 8: Scattered intensity in interferometric imaging\n\nA) Calculated scattering patterns of nanoparticles (radius 20 nm) suspended in water and measured in interferometric microscopy in reflection geometry\n(ωill = ϑ) with illumination wavelength 532 nm at different values of the defocus\nz, indicated in the plot to the right of the scattering patterns. The integrated intensity of the scattering patterns varies sinusoidally with the defocus\nz due to the phase shift\nς. The field of view of each particle image is 10 ≃ 10 microns.\nB) The integrated intensity of scattering patterns measured in interferometric microscopy with\nωill = ϑ as a function of particle size.\n\nIn the case of interferometric scattering techniques, the term of interest in Eq. (14) is the final interferometric term. Taking the illuminating field to be a plane wave propagating along the optical axis, the integrated recorded intensity is given by (see Box 7 for a derivation)\n\n∫ (Icamera) I0 → 1 dx = (2/φ)k↓(↽ei!ω)f(ωill), (45)\n\nwhere %ς = ς → ς(z) is the relative phase difference between the background field and the scatterer, φ is the attenuation factor, and ς(z) describes the depth-dependent relative phase shift of the particle relevant for reflection geometries [58]. Further, we have defined\nI0 = φ2|Eill|2, which is experimentally estimated by evaluating the intensity recorded by the camera in locations without particles present. Note that the right-hand side of this final expression does not depend on the intensity of the illuminating light. In other words, the illuminating light does not need to be separately quantified to perform particle characterization in interferometric scattering approaches. However, since φ may have a spatial dependence or vary between different surfaces [23, 59], background corrections are still sometimes needed. Also, in contrast to darkfield approaches, the recorded intensity is now directly proportional to the real part of the polarizability when %ς = 0."
    },
    {
        "id_": "9579ae68-b9fd-4ff8-a34e-3688dcb1163f",
        "text": "# Box 7: Integrated interferometric intensity\n\nTo evaluate the integrated signal from a particle in interferometric microscopy, we write the illumination field at the camera plane as\n\nE˜ill = φ|Eill|ei(ω±kz),\n\nwhere φ is the attenuation coefficient of the illuminating light, ς is the phase shift of the illuminating field compared to the scattered field, and z is the distance from the scatterer to the focal plane. The ± reflects the fact that the light propagates in opposite directions compared to the original propagation direction for reflection and transmission geometries. The + sign is relevant for reflection geometries, and the → sign for transmission geometries. To the lowest order in the scattered field, the recorded intensity, in the RDG approximation and assuming an isotropic scatterer, is\n\nIcam(ϱ) = φ2|Eill|2 + 2φ|Eill|2↓[↽k3ei(ω±kz)∫0εmaxcos ω sin ωf (|ω → ωill|)J0(kϱ sin ω)eikz cos ε dω],\n\nwhere ωill = 0 for interferometric imaging with transmission geometry, and ωill = ϑ for interferometric imaging with reflection geometry. The first term in this equation represents the intensity recorded by the camera in the absence of scatterers. Subtracting and dividing by this value, one obtains for the integrated signal of a particle\n\n∫ φ2|Eill|2dx = (2/φ)k3↓[↽ei(ω±kz)∫∫0εmaxcos ω sin ωf (|ω → ωill|)ϱJ0(kϱ sin ω)eikz cos ε dϱ dω],\n\n↼I\n\nwhere ↼I = Icam → φ2|Eill|2. To evaluate this, recall that the integral over ω is a Fourier transform in disguise. Utilizing that\n\n∫ f (x)dx = fˆ(0),\n\nwhere f and fˆ are Fourier transform pairs, one immediately finds\n\n∫ ↼I φ2|Eill|2dx = (2/φ)k↓[↽ei(ω+[1±1]kz)]f (ωill).\n\nTo exemplify the position dependence of the interferometric scattering signal, in Figure 8A scattering patterns calculated according to equation (47) in the case for interferometric backscattering. Notice how the central lobe changes sign as the defocus changes by only a fraction of a wavelength. The integrated signal of the scattering patterns shows a sinusoidal dependence on the defocus z due to the relative phase difference ς(z) between the scattered light from the particle and the light reflected at the coverslip. For this reason, the iSCAT signal is either quantified in the same plane for all particles, as on a coverslip or a specific depth plane [15,27], or the images are transformed using a neural network to remove the depth dependence [23]. When that is done accurately, the size dependence of the integrated signal follows Figure 8B, which shows Eq. (45) when %ς = 0."
    },
    {
        "id_": "468c426f-6303-4251-9a53-e6962d9a765a",
        "text": "# 4.3 Quantitative field imaging\n\nIn quantitative field imaging, the recorded quantity is the scattered field itself. In this case, one has that [54]\n\n∫ Esca(x)/|Eill|dx = ik↽f (ωill) = ik↽,\n\nwhere the last equality is valid for ωill = 0, which is the most common choice for quantitative field methods. This is similar to Eq. (45) with ς = 0, except for the fact that the polarizability is now allowed to be complex-valued. Note that it is the integrated imaginary part of the optical field that is proportional to the real part of the particle polarizability. In Figure 9A, the real and imaginary parts of the scattering patterns measured in quantitative field imaging are shown for different defocus values."
    },
    {
        "id_": "9aa5a10e-b1a4-41c6-a131-f32dda11a98c",
        "text": "Importantly, following Eq. (37) the optical field signal can be re-propagated after recording the image. This, in turn, enables quantification of the signal of focused scattering patterns even though they are measured out of focus, which reduces the sensitivity of the particle characterization to noise and out-of-focus effects [54]. The integrated imaginary part of the signal is proportional to particle polarizability and hence particle volume (Figure 9B) as predicted from Eq. (51).\n\n|Real|Imaginary|\n|---|---|\n|2=-2 um|105_|\n|1 104_|z-0|\n|103|7 102_101|\n|2=-2 um|100_|\n\n50 100 150 200 250\n\nRadius (nm)"
    },
    {
        "id_": "eeb9e1e1-44ca-42bb-ae62-9a84236efbe4",
        "text": "# Fig. 9: Scattered intensity in quantitative field imaging\n\nA) Calculated scattering patterns (real and imaginary parts) of nanoparticles (radius 20 nm) suspended in water and measured in quantitative field imaging with illumination wavelength 532 nm at different values of the defocus z. The field of view of each particle image is 10 ≃ 10 microns. B) When the particle is in focus, the integrated imaginary part of scattering patterns is measured in quantitative field microscopy scales with particle volume. Note that for quantitative field imaging, the image can be re-propagated after recording. This makes it possible to refocus the detections individually.\n\nFurthermore, utilizing Eq. (11) one can rewrite the scattered field at the camera plane in terms of the angular components of the form factor directly (Box 8). This shows how quantitative field imaging contains information about particle polarizability and the particle form factor itself, which, if quantified, can be related to particle size [8].\n\n19"
    },
    {
        "id_": "e68aa806-71cc-4d12-8f24-7d6b5c069fb4",
        "text": "# Box 8: Quantifying the optical form factor in quantitative field imaging\n\nThe scattered field at the camera plane is related to the optical form factor as\n\nEsca(ϱ) = ik3 |Eill| &int; cos ω sin ω f(ω) J0(kϱ sin ω) eikz cos ε dω. (52)\n\nApplying the transform Eq. (11), one finds that\n\n&int; ik |Eill| f(ω) eikz cos ε = ϱ Esca(ϱ) J0(kϱ sin ω) dϱ. (53)\n\nTaking the absolute value of both sides and utilizing that |eix| = 1, one finds\n\n|&int; k |Eill| f(ω)| = |&int; ϱ Esca(ϱ) J0(kϱ sin ω) dϱ| (54)\n\nFinally, since k |Eill| = |&int; Esca dx| from Eq. (51), we have that\n\n|&int; ϱ Esca(ϱ) J0(kϱ sin ω) dϱ| = |f(ω)| = |Esca dx| (55)"
    },
    {
        "id_": "e5f1d969-0d8e-4f69-bd5c-13fcb5798ee8",
        "text": "# 5 A toolbox for analyzing scattering microscopy data\n\nQuantitative analysis of scattering microscopy data consists of two fundamental steps, namely particle detection and signal characterization [60]. The aim of this section is to provide an easy-to-use toolbox to perform these tasks for the three types of scattering microscopy geometries that are discussed in this tutorial. If the particles are moving during the experiment, a third step, detection linking, is required to form particle traces [61], allowing the particle motion to be related to particle properties such as the hydrodynamic radius as previously described in several review articles [17, 62]. Since the ability to track the motion of particles is generic for optical microscopy methods, the focus of this tutorial is the information contained in the optical signal, where the hydrodynamic radius will complement the optical signal in the case of freely suspended particles. Appended to this tutorial are Jupyter notebooks containing code for performing particle detection and characterization in the three scattering modalities considered here (darkfield imaging, interferometric imaging, and quantitative field imaging). In the following two sections, the content of the notebooks will be briefly explained."
    },
    {
        "id_": "76fb8c49-51c6-41cb-9a46-7fa6d206f541",
        "text": "# 5.1 Particle detection\n\nThe particle detection task is essentially recognizing scattering patterns in the presence of noise. Traditionally, particle detection has been performed by algorithmic approaches, in which a predefined set of image filters are applied to the microscopy images, followed by a thresholding operation to identify particles [63]. In the past decade, deep learning approaches to particle detection have become increasingly popular, showcasing more accurate detection in particular under low signal-to-noise conditions [60, 64].\n\nThere are, in general, three sources of noise contributing to the noise level in scattering microscopy images: (1) shot noise, arising from the finite number of photons detected in each camera pixel, (2) read noise, which is intrinsic to the camera, and (3) speckle noise, due to coherent reflections and scattering along the beam path of the illuminating light [65].\n\nThe first two noise sources are common to all types of microscopy and have the property of being spatiotemporally independent: the noise at pixel i at time t0 is independent of the noise at pixel j at time t1. This particular property means that the noise from these sources can be reduced by averaging the signal over time and/or across multiple pixels. Speckle noise is special for optical microscopy and originates from the interference between the different optical plane waves of the illumination. Speckle noise is characterized by the fact that noise at neighboring pixels is correlated, where the amplitude and temporal stability of the speckle depends on the light source and experimental setup [66]. Important for image analysis, this noise has a spatial correlation that is similar to the spatial correlation of the nanoparticle scattering signal, and in the absence of mechanical vibrations in the system, it can"
    },
    {
        "id_": "3a2e5963-4f8e-4c1e-b1d1-2f05cd08d858",
        "text": "# 5.2 Signal characterization\n\nAfter having detected a particle, the next step in nanoparticle characterization is to utilize the image of the scattering pattern to extract information about the particle itself.\n\nCommon to all scattering microscopy approaches is that the integral of the particle signal is related to particle polarizability (which, for biological nanoparticles, is proportional to their mass). However, depending on the measurement geometry, when relating the scattering to mass, the effect of the optical form factor needs to be compensated (Figure 6). As a rule of thumb, for particle sizes R &lt; (2k sin ω ill )→1, the form factor can be approximated as f (ω) ↑ 1 within the angles collected by the objective, in which case the integrated intensity is directly related to particle polarizability. For particles larger than this, the integrated intensity must be complemented with independent measurements of size and/or polarizability to perform quantitative characterization, as exemplified in [23, 68].\n\nIn practice, the task in signal characterization is to estimate the integrated particle signal in the presence of noise. Directly summing up all camera pixels is not a good approach in practice since, most commonly, tens or hundreds of particles are present in the field of view of the camera at the same time. The most common approach to signal characterization is, therefore, to crop out a small region around each detected particle (Figure 10B), and fit some kind of function to this limited view of a particle. As a specific example in the case of iSCAT, in [68] the particles were first localized using the radial variance transform, where the particle detection with the maximum positive contrast estimated by Gaussian fitting was used to estimate the particle signal.\n\nAnother approach that has gained increasing attention is to utilize deep learning enhanced analysis techniques to not only detect the particle but also estimate the signal. In the appended notebooks, we provide code to train and apply a convolutional neural network to estimate the integrated signal strength of scattering patterns. In Figure 10C, this step is shown for interferometric imaging in reflection geometry, where the signal estimation follows what is expected from theory. In the appended notebooks, code is also provided to perform this step for darkfield imaging as well as for quantitative field imaging.\n\nGoing beyond particle polarizability, it is, in some instances, possible to quantify also the particle form factor directly from the optical signal using deep learning image analysis by utilizing the fact that the form factor is encoded in the angular components of the scattered field as measured in quantitative field imaging (Eq. (55)). This approach was utilized in Ref. [19] to estimate particle size and refractive index directly from scattering patterns measured in off-axis holographic images. Specifically, particle size (or, more accurately, the radius of gyration of a particle) is related to its scattering form factor as when Rq ↗ 1.\n\nR g2↑ 3q →2 (1 → f (ω)2).\n\n21"
    },
    {
        "id_": "5a4492d9-1784-4929-9b04-134dd290666e",
        "text": "# ISCAT data"
    },
    {
        "id_": "ad77bfe6-6214-4fd2-9b47-e32f0d233899",
        "text": "# Theoretical Estimated signal with 2DCNN"
    },
    {
        "id_": "9ca7fee0-4bb7-4a78-9a6c-cefd0712fc23",
        "text": "# Estimated %Idnal"
    },
    {
        "id_": "a292791c-0273-41ca-b109-224bf00c78ea",
        "text": "# Theoretical signal"
    },
    {
        "id_": "44c7fcc1-249f-49b2-8a01-77ee27d6e8b6",
        "text": "# Radius (nm)\n\nFig. 10: Particle detection and characterization in interferometric microscopy. A) An example iSCAT microscopy image containing multiple scatterers. This image was simulated using the notebooks appended to this tutorial. On the right side of the image, particle detections made by the LodeSTAR algorithm, trained using the notebooks appended to this tutorial, are overlaid on the image. The particle detections are intentionally left out on the left half of the image to not obscure the appearance of the scattering data. B) Crops of the scattering patterns of individual particles detected in the frame in A). C) Characterization of the integrated scattering intensity of individual particle crops like the ones shown in B). The characterization is performed by a convolutional neural network, trained using the notebooks appended to the tutorial.\n\nThus, the task of particle sizing directly from quantitative field images amounts to estimating a curvature in the optical form factor from noisy images."
    },
    {
        "id_": "59f5a9cc-4d4c-4a5c-b057-3a0fc8e2589b",
        "text": "# 6 Considerations when designing measurement geometry\n\nFrom the treatment above, it is clear that the different approaches to scattering microscopy have different quantitative power when it comes to particle characterization.\n\nThe first consideration that one should make when designing a scattering-based characterization experiment is the level of detail required in the characterization to answer the scientific questions at hand. In some cases, it may be sufficient to detect and track the motion of particles rather than accurately quantify the particle signal. In this case, darkfield techniques have the advantage that the data is relatively easily analyzed since the particles appear bright against a dark background. For this reason, darkfield imaging is one of the standard techniques for tracking suspended nanoparticles [13,35].\n\nHowever, particle characterization based on the optical signal using darkfield techniques is comparatively challenging since relating particle signal to polarizability requires accurate calibration. In particular, since the particle contrast in darkfield techniques is proportional to the local light intensity at the particle position, a proper calibration procedure would require mapping out the illumination intensity throughout the entire field of view, which is technically challenging. In [13], particle characterization was demonstrated using darkfield imaging with oblique illumination (Figure 11A) of a sample freely diffusing in a macroscopic volume. The challenge of quantifying the scattered signal in such conditions, in particular under a non-uniform illumination, was overcome by utilizing the maximum value of the measured scattering signal of each particle trace as a proxy for the particle scattering, in combination with careful calibration (Figure 11B). This enabled the quantification of hydrodynamic size as well as the scattering cross-section of suspended polystyrene and silica beads (Figure 11C), which was also converted into the estimate for the refractive index of these particles (Figure 11D).\n\nAnother measurement consideration is whether particle dynamics information is critical or not. To follow the same particle over time it needs to be confined, which can be achieved by, for example, tethering the particle to a surface [42]. In particular, by using evanescent illumination (Figure 12A)."
    },
    {
        "id_": "6afbaea6-6dff-49b0-9b9a-cede9a7d4b58",
        "text": "# Particle Characterization Using Darkfield Imaging"
    },
    {
        "id_": "853dce67-e3c7-42dc-abef-7e9bd6638bc6",
        "text": "# Figure 11\n\n|A)|B)|\n|---|---|\n| |2500|\n| |3200|\n| |141500I000|\n| |500|\n|C)|D)|\n|Silica|Time (s)|\n|Polystyrene| |\n|1|RIE 1 65|\n|RI =| |\n|RI =| |\n|RI = 45| |\n|[2|RI = 1.35|\n|200|5000|\n|400|2500|\n|600| |\n\nIn darkfield imaging with oblique illumination was used for quantitative characterization of suspended nanoparticles. The particle signal was estimated by tracking the motion of nanoparticles and estimating the integrated signal at each time point in a particle trace. The maximum value of the integrated signal was used as a proxy for the signal strength. Using both signal quantification and particle tracking over time enabled quantification of both hydrodynamic size and the scattering cross-section, here for a sample of silica beads and a sample of polystyrene beads. By combining the particle size and scattering cross section the particle refractive index was also estimated for the silica and polystyrene beads. Figure reprinted with permission from American Chemical Society (Copyright 2014).\n\nOnly particles that are adsorbed or very close to the surface will be illuminated and scatter light. In [42], evanescent illumination was used to study protein adsorption to lipid vesicles adsorbed to a surface. Both fluorescence and scattering signal were measured simultaneously (Figure 12 B), enabling time-resolved monitoring of the adsorbed protein mass to individual vesicles and correlating the scattering signal to fluorescence signal (Figure 12C).\n\nA third measurement consideration is whether the particle signal must be accurately related to particle properties such as mass. Interferometric scattering approaches have the advantage compared to darkfield techniques in that the particle contrast is measured relative to the local illumination intensity so that the particle estimate is insensitive to changes in the illuminating light intensity. This enables accurate quantification of the scattering signal that can be related to particle properties in a precise manner [15, 16, 27]. Nonetheless, measuring the scattering from well-characterized calibration particles is still necessary to calibrate the attenuation factor φ and the relative phase difference ς.\n\nFor suspended particles, which diffuse in three dimensions, the particles will quickly explore a volume sufficiently large to cover all possible values of ς, rendering calibration of this phase unnecessary in this case.\n\nInterferometric methods enable accurate particle characterization both on a surface [27] and when in solution [16,68]. In Ref. [68], signal quantification in combination with particle tracking using iSCAT (Figure 13A) was used to determine the size and refractive index of suspended nanoparticles (Figure 13 B-C). Moreover, by analyzing the particle-size scaling, they could obtain structural information about suspended liposomes. To investigate even smaller suspended particles, in Ref. [16], they used\n\n23"
    },
    {
        "id_": "2dc2cb4b-32ed-47ba-a32a-155a537d115a",
        "text": "# Fig. 12: Characterization of surface-bound particles using evanescent illumination\n\n|A)|Camera|515 nm|488 nm|\n|---|---|---|---|\n| |Lens|Fluorescence|Scattering|\n| |Objective|Sample| |\n| |Objective|Illumination|C)|\n| |3|3| |\n| |t[s]| | |\n\nRef. [42] evanescent illumination was used to study protein binding to lipid vesicles adsorbed to a surface. B) Using a dichromatic mirror, the scattering and fluorescence signals can be simultaneously recorded. C) The protein adsorption event could be resolved by monitoring the integrated fluorescence and scattering intensities as a function of time on the single particle level.\n\nFigure reprinted with permission under the CC-BY license."
    },
    {
        "id_": "5d6fc092-54f6-46ea-b826-43b9c5ca9b5a",
        "text": "# Fig. 13: Particle characterization using iSCAT and nanochannel scattering microscopy (NSM)\n\n|A)|In| | |\n|---|---|---|---|\n| |the relative scattering between a nanochannel and the particle to characterize the suspended size and mass of individual biomolecules possible (Figure 13D).| | |\n|Sample|Lens|Quarter-Wave plate|1|\n|Beam Splitter|Illumination|Diameter nm|1|\n|Lens|Camera| | |\n\nA-C: In Ref. [68], particle characterization of suspended nanoparticles using iSCAT (A) was demonstrated through quantitative analysis of the scattered light in combination with particle tracking (B). The iSCAT contrast was shown to be proportional to particle volume for small particles (C, upper row), as anticipated from Section 4, and the deviation from this scaling was used to estimate the internal refractive index of extracellular vesicles (B, lower row). D) By utilizing the interference between a nanochannel and particles residing within the nanochannel, in [16], characterization of polarizability (proportional to mass) as well as the hydrodynamic radius of individual biomolecules was demonstrated. Figure reprinted with permission under the CC-BY 4.0 license.\n\nA fourth measurement consideration is whether more detailed material information is needed in the case of heterogeneous samples. Quantitative field imaging provides the most rich optical signal that can, in turn, be used for the detailed characterization of nanoparticles. For instance, the complex-valued scattered field contains information about both the real and imaginary parts of the particle polarizability and refractive index (Figure 14A-B) [21, 54]. In Ref. [54], this was used to distinguish between gold nanoparticles and polystyrene particles directly from the optical signal. Similarly, in Ref. [14], the sign of the phase signal was used to differentiate between nanobubbles and dielectric particles in the same sample. Furthermore, in Ref. [19], the complex-valued signal was used to determine the size and refractive index of nanobeads and fractal aggregates directly from the scattered."
    },
    {
        "id_": "4fef1a5b-70a9-40ed-8021-894e1aa03567",
        "text": "# 7 Conclusions and future opportunities\n\nIn this tutorial, we have given an overview of the particle information from darkfield, interferometric scattering, and quantitative field microscopy measurements. Over the past decades, the single particle detection limit has significantly improved for all different optical imaging methods. Looking ahead, there are still opportunities and challenges for scattering-based microscopy characterization beyond"
    },
    {
        "id_": "5ff0d9b0-52b3-4db4-b4e6-cff2d3f7b900",
        "text": "# Figure 14: Particle characterization using quantitative field imaging.\n\nA-B) Using quadriwave shear interferometric imaging, in Ref. [54], it was demonstrated that gold and dielectric nanoparticles can be distinguished based on their complex-valued polarizabilities. C-D) In Ref. [19], it was demonstrated that deep learning enhanced analysis of scattering patterns recorded in off-axis holography is capable of quantifying the size and refractive index of suspended subwavelength particles. Figure reprinted with permission under the CC-BY 4.0 license.\n\n|Gold|Gold (Exp)|PS (Exp)|Vinot|\n|---|---|---|---|\n|8|DDA|Sumpll|1|\n|Obecnc|1|0DuM| |\n|Dblecuyl|GuinJ|8|Polystyrene (PSI661)|\n|Acam|Splillet|L|8.07|\n| |0I1|Himor|Camen|\n|Rela) (nm\" x10f)|Radius (um)| | |\n\nOne major drawback of quantitative field microscopy techniques compared to other optical techniques has been its detection limit. However, it was recently shown that by combining evanescent field imaging with an external reference, it is possible to measure the optical field from single proteins with mass below 100 kDa when binding to a surface [49].\n\nThis leads to another critical consideration when deciding on a measurement technique, namely particle size. The lowest reported detection limit is 9 kDa biomolecules measured using iSCAT (corresponding to a diameter of approximately 3 nm) [70]. As a comparison, the reported detection limit for darkfield microscopy is around 5 nm diameter for non-metallic particles [12], iSCAT for suspended nanoparticles has a reported detection limit of around 40 nm [15], and quantitative field measurements for suspended nanoparticles has a reported detection limit of around 70 nm [21]. In addition to the detection limit, as described in Section 5.2, transmission methods and non-transmission methods have different relationships between particle signal and polarizability. For particle mass determination, it is beneficial to use a measurement geometry for which the form factor contribution to the scattered light can be neglected. In practice, this implies that the illumination angle ideally should be related to the typical size R of scatterers in the sample as sin(ω ill /2) < (2kR) →1.\n\nGenerally speaking, the more parameters that can be quantified at the single particle level, the more likely it is that the particles of interest can be distinguished from other particles in the sample. For instance, if the particles of interest are the strongest scattering particles, then any technique that permits quantifying polarizability is sufficient. If the particles scatter light to a similar extent but have a different material composition, then particle refractive index may be the relevant parameter to characterize. Finally, if the particles of interest differ from other particles in how the mass is distributed within the particle, then some technique capable of resolving the form factor is preferable. If these physical parameters are insufficient for distinguishing the particles of interest from other particles in the sample, it is also possible to augment scattering microscopy techniques with fluorescent imaging to achieve better specificity."
    },
    {
        "id_": "334b2e75-6df3-4b62-ae52-97aac07233ab",
        "text": "# 7.1 Optical fingerprinting\n\nA fundamental limitation in scattering-based particle characterization is that the detection events are nonspecific, as mentioned in the previous section. A challenge in the field of scattering-based nanoparticle characterization is to identify optical fingerprints, which enable distinguishing and characterizing subpopulations in heterogeneous samples without introducing labels.\n\nOne such fingerprinting feature, the integrated scattering amplitude, has been discussed at length in this tutorial. This feature is proportional to particle polarizability and can be used to distinguish subpopulations. Another experimentally measurable feature is the hydrodynamic radius, estimated through particle tracking [13, 15, 16].\n\nBy combining the information-rich scattering patterns of nanoparticles with deep learning-enhanced analysis techniques that go beyond quantifying the integrated scattering signal, we anticipate that more examples of fingerprinting features will be added to this list, enabling more precise population discrimination and characterization. To give a few examples:\n\n- In principle, quantitative field imaging techniques can quantify the scattering form factor across all scattering angles collected by the objective. Utilizing this, it is possible to discriminate particle subpopulations based on their morphology.\n- In biological systems, many processes are driven by weak interactions. In a scattering microscope, such interactions will manifest themselves as temporal fluctuations in particle properties [19]. Such temporal fluctuations can also be used as a fingerprinting feature.\n- Interferometric scattering patterns are, just as the field measured in quantitative field microscopy, related to the form factor evaluated over the scattering angles captured by the objective. This information can likely be decoded using deep learning enhanced analysis techniques, enabling precise sizing of very small objects.\n- Shape information of anisotropic particles is also encoded in the scattering patterns. For suspended anisotropic nanoparticles, the scattered light reaching the camera will temporally fluctuate as the nanoparticle undergoes rotational diffusion. If the exposure time is much shorter than the characteristic time of rotational diffusion, these fluctuations can be resolved in measurement and be related to particle anisotropy [71]. Anisotropy is also encoded in the dependence of light scattering on polarization. This has been used to measure anisotropy of surface-bound particles [72].\n- Finally, the information about the scattering form factor within an image captured in a scattering microscope is limited by the scattering angles collected by the objective. Thus, different scattering approaches carry complementary information about the scattering form factor. By combining measurement modalities, it is possible to obtain a more complete mapping of the scattering form factor of individual nanoparticles. This was recently demonstrated by combining quantitative field imaging and iSCAT to quantify particle size in unknown sample media [23], and we anticipate that the same idea will be applied using other combinations of scattering techniques as well.\n\nThe primary obstacles to achieving such fingerprinting lie in the noise level of interferometric systems, obscuring parts of the scattering signal, and an imperfect characterization of the pupil function P (ω). In the treatment presented in this tutorial, this has been assumed to be perfectly characterized. In practice, this function is affected by aberrations in the optical system and is difficult to characterize perfectly. Furthermore, in this tutorial, all particles have been assumed to be located directly above the central line of the objective. In a real experiment, the position of the particle with respect to the center of the objective will affect the scattering angles that reach the objective. Thus, the image of a particle will be slightly affected by its position [73]. These effects were characterized and accounted for in [19] using quantitative field microscopy, where calibration particles were used to obtain information about the occurring point spread function, but performing such characterization for other scattering microscopy geometries has not been demonstrated. Nonetheless, considering the fast improvement of the detection limits of scattering-based microscopy [27, 49] we anticipate that deep learning enhanced."
    },
    {
        "id_": "af0313c3-ee70-493e-bfb1-28fe73642681",
        "text": "# 7.2 Characterizing particles in complex environments\n\nMost single particle characterization methods operate in known environments at a controlled particle concentration. Operating in unknown and crowded environments adds several challenges, including the unknown viscosity hindering estimation of the hydrodynamic radius and the overlapping scattering pattern hindering single particle tracking. For example, the cellular interior is both crowded and inhomogeneous, which makes the analysis of scattering patterns more complicated.\n\nAll-optical fingerprinting of nanoparticles would alleviate the need for diffusion measurements in particle characterization, opening up the possibility of performing quantitative particle characterization in environments that were previously limited to qualitative particle analysis. For highly scattering particles, deep learning approaches can be used to identify and characterize the particles inside cells [64]. For less strongly scattering particles, another approach to resolve the particles is to perform confocal scattering microscopy [74, 75], in which only a small volume of the sample is illuminated at a time, thereby minimizing the effect of such unwanted light scattering. The depth selectivity of confocal microscopy significantly reduces the background scattering from other particles, allowing tracking of individual viruses on a cell [74]. Thus, the combination of confocal scattering microscopy and deep learning image analysis will likely significantly extend the quantitative possibilities of label-free optical particle characterization."
    }
]