[
    {
        "id_": "04bdc83c-8139-448f-b87a-f063986c87ee",
        "text": "# I. INTRODUCTION\n\nAdvances in quantum information science (QIS) have provided new perspectives on quantum many-body systems. Investigations of entanglement have shed further light onto the structure and dynamics of matter (in nuclear physics, see e.g. [1–38]), and, in turn, have been guiding the development of improved methods for describing quantum many-body systems based on entanglement optimization and/or truncation. One example is tensor network techniques which can describe classes of weakly-entangled states efficiently with classical computers. These includes, for example, the density matrix renormalization group (DMRG) [39], matrix product states (MPS) [40–43], projected entangled pair states (PEPS) [44] and the multi-scale entanglement renormalization ansatz (MERA) [45, 46]. DMRG and variants thereof have been adapted to various kinds of nuclear systems for which a natural weakly-entangled bipartition can be established [12, 18, 47–58]. Tensor-networks states, and other methods related to entanglement re-organization have also been shown to be beneficial in the context of quantum simulations with noisy intermediate-scale quantum (NISQ) computers [59–73].\n\nEntanglement, however, is not the only necessary ingredient to establish whether a quantum state can be efficiently simulated classically, or necessitates the use of a quantum computer. The degree of non-stabilizerness, or \"magic\", of a quantum state is also required to establish such distinction. Magic quantifies the deviation of a state from stabilizer states, which are a class of quantum states that can be prepared using Clifford operations alone. Stabilizer states can be highly entangled, and yet, as encapsulated by the Gottesman-Knill theorem, can be efficiently prepared and simulated with a classical computer [74]. As such, both entanglement and magic are required to assess the computational complexity and quantum resource requirements for simulating physical systems, and to design an optimal classical/quantum workflow of the simulations. The exponentially-scaling classical resources required to prepare a given quantum state are directly related to the number of T-gates required to prepare the state on a digital quantum computer, and hence related to the non-zero magic of the state. As nuclei, described by non-relativistic nucleons, involve a finite number of particles, the concept of asymptotic scaling with systems size, as is used to define complexity classes of problems, is replaced by the scaling of resources required to achieve a given level of precision in target observables, e.g., Ref. [75]. Indirectly, this includes the scaling of the active space and the fidelity of the Hamiltonian, when compared with that emerging from quantum chromodynamics.\n\nAs with entanglement, measures to quantify the magic in a quantum state have been developed, such as, for example, the minimum relative entropy of magic [76] quantifying the minimum distance between a quantum state and the nearest stabilizer state. Other measures such as, for example, the mana [76] and thauma [77], the robustness of magic [78], stabilizer extent [79], stabilizer norm [80] and stabilizer nullity [81], are related to the minimum number of stabilizer states required to expand.\n\n1 A number of properties of nuclei can be comfortably computed with a certain level of precision using classical computing resources alone. However, systematically reducing uncertainties in these properties will become increasingly demanding, and eventually beyond the capabilities of classical computing."
    },
    {
        "id_": "4b6f499d-a63b-4291-ba2f-412b5812727d",
        "text": "# 2\n\nThe quantum state of interest (stabilizer rank), and give an estimate of the computational complexity of Clifford simulations of a quantum circuit. More easily accessible measures of magic have been introduced, in particular, the stabilizer Rényi entropies (SREs) [82] and the Bell magic [83], which have been shown to be measurable in quantum computing experiments [83–85], and efficiently calculable for MPS [86–89].\n\nWhile the entanglement structures of various types of physical systems have been extensively examined, the magic properties of quantum many-body systems are much less known. Investigations of magic in the Ising and Heisenberg models [84, 87, 90–92], in two-dimensional lattice gauge theories [93], and in potential simulations of quantum gravity [94], have been performed as examples.\n\nTowards building an understanding of the quantum resources required to simulate nuclear systems, we have recently investigated the magic-power of the nucleon-nucleon and nucleon-hyperon S-matrices. We found that magic and entanglement do not always have the same behaviour in these scattering processes. In particular, certain scattering states were found to exhibit large entanglement and low or zero magic in specific energy regions. Such differences in the behaviours of entanglement and magic have also been investigated in different contexts. For example, Ref. [91] showed that, in the one-dimensional Heisenberg model described by MPS, magic typically saturates faster than entanglement with respect to increase of the bound dimension. In random quantum circuits including measurements, it has been demonstrated that scaling of entanglement and magic with subsystem size undergo phase transitions at different sampling densities, p [95, 96]. Further, it has been demonstrated that the quantum phase transition in the XYZ Heisenberg chain can be signaled by measures of magic, while being undetected by entanglement measures [92].\n\nIn this work, as another step towards a more general characterization of the quantum complexity of nuclear systems, we investigate and compare magic and entanglement patterns in the ground states of nuclei. Specifically, we calculate magic and entanglement measures in light (p-shell) and mid-mass (sd-shell) nuclei, described within the framework of the well-established interacting nuclear shell model [97]. We compute SREs to measure the magic content of the wave functions, and the n-tangles to estimate detailed multipartite entanglement. Such n-tangles are well-suited measures to characterize shell-model wave functions which include refined multi-nucleon correlations in restricted model spaces. While the n-tangles can be calculated exactly for the present model-space sizes, magic, which involves the evaluation of an exponentially-large number of Pauli strings, can only be calculated in an approximate way in typical sd-shell nuclei. Motivated by the work in Ref. [93], which employed Markov Chain Monte Carlo (MCMC) techniques to sample the Pauli strings and calculate the SREs in 2D lattice gauge theories, we have performed an extensive and detailed suite of MCMC evaluations of Pauli strings for each nucleus, and have developed a new MCMC algorithm, which we call PSIZe-MCMC, to accelerate sampling Pauli string expectation values within wave function exhibiting collectivity, such as many sd-shell nuclei.\n\nNuclei exhibit an impressive range of shape deformations. Even light nuclei can be significantly deformed in their ground and excited states, induced by the two-nucleon tensor force and higher. This is particularly pronounced in sd-shell nuclei, peaking in the vicinity of Mg. While the deformation parameters become smaller with increasing neutron number for a given proton number Z, the systems may enter a region of shape-co-existence on their way to instability. An example of this behavior can be found in the Mg isotopes, where 24 Mg is maximally deformed in the isotopic chain, and with ω decreasing with increasing neutron number. 28 Mg is suspected to be in the region of shape co-existence on the road from normal (shell model) state ordering to inverted orderings around 32 Mg (see, for example, Ref. [98]), brought about by a closing gap to the f p-shell. This evolution is expected to arise from significant multi-particle correlations, both classical and quantum, in the nuclear wavefunctions. We take steps toward systematically quantifying the quantum correlations in these nuclei.\n\nThe manuscript is organized as follows: In section II we provide a brief reminder of the shell-model description of nuclear wave functions, and in section III we describe the mapping of these wave functions to qubits, which will serve for the subsequent calculations of entanglement and magic measures. In section IV A we describe and present calculations of multipartite entanglement in p- and sd-shell nuclei via computations of n-tangles. In section V we briefly review the stabilizer formalism leading to the definition of SREs as a measure of magic, and present results for p- and sd-shell nuclei obtained via exact or MCMC computations using the newly-introduced PZIe-MCMC algorithm. In section VI we examine, in more detail, the behaviour of entanglement and magic in comparison with deformation of nuclei of the Ne and Mg chains. Finally, conclusions and outlook are presented in section VII."
    },
    {
        "id_": "a4c1b113-87f8-4e0a-bf98-b1fdd130628b",
        "text": "# II. RELEVANT ASPECTS OF THE SPHERICAL SHELL-MODEL DESCRIPTION OF NUCLEI\n\nThe interacting shell model [97] is an active-space configuration-interaction method that has been successfully used for decades in the description of the structure of nuclei. Based on the large energy gaps between major single-particle (harmonic oscillator) shells, this framework assumes that only nucleons around the Fermi level are active and interact within a valence shell, while nucleons below a major shell gap can be considered frozen. The single-particle space is thus divided into three parts: the inert fully-occupied core of orbitals, the active partially-filled valence space, and the space of re-"
    },
    {
        "id_": "7788a032-49c0-4832-9f8b-bb2aa8ae7e5c",
        "text": "# III. MAPPING THE SHELL-MODEL BASIS STATES TO QUBITS\n\nThe entanglement and magic measures that we present below require a mapping of the shell-model wave functions to quantum registers. While there are multiple ways to map the Hilbert space of the shell model to qubits, we have chosen to follow a common quantum chemistry (Jordan-Wigner) mapping where the occupancy of each single-nucleon orbital is defined by the orientation of a single qubit.2 This mapping has been used previously in studies using the shell model, see e.g. Refs. [16, 19, 105–109], as part of the growing effort in using quantum computers to simulate nuclei [16, 71, 103, 110–127]. This means that to define a p-shell nucleus, four qubits are required to define the occupancy of the 1p3/2 neutron orbitals and four are required for the protons. Similarly, two are required for the 1p1/2 neutrons and two for the protons. This gives a total of six for the neutrons and six for the protons, and hence twelve qubits for p-shell nuclei.\n\nAs an explicit example, the states in the wavefunctions produced by the BIGSTICK code are ordered in terms of single-particle quantum numbers in the following way:\n\np-shell basis = {1p2 3,↓ 2 1, 1p2 1,↓ 2 1, 1p2 3,↓ 2 3, 1p3,+ 2 2 1, 1p1,+ 2 2 1, 1p3,+ 2 2 3,}\n\nfor p-shell protons, and similarly for the p-shell neutrons, as shown in Fig. 1.\n\nThere are a number of potential ways to map the Hilbert space spanned by the shell-model basis states to the registers of quantum computers. For example, building upon the work in Refs. [103, 104], the occupations of two 2s states can be mapped to the states of a d = 4 qudit, a qu4it, corresponding to the occupations {(0, 0), (0, 1), (1, 0), (1, 1)} of the (2s1/2,↑1/2, 2s1/2,+1/2) substates. Similarly, the occupations of the four 1p3/2 states can be mapped to a qudit with d = 16."
    },
    {
        "id_": "7cde98ce-f291-4680-b518-84fbacd3acf7",
        "text": "# IV. MULTI-PARTITE ENTANGLEMENT IN NUCLEI\n\nVarious measures of entanglement in quantum many-body systems have been developed, for different possible partitionings of the wave function. For example, the von Neumann entanglement entropy [128] is a way to quantify how two subsystems of a bipartite pure state are entangled with each other. The shell-model nuclear state in Eq. (1) exhibits a natural bi-partitioning in terms of proton and neutron components, and the corresponding entanglement entropy has been investigated in Ref. [11] which found low proton-neutron entanglement for nuclei away from N = Z. Entanglement entropy in the shell-model framework was also studied in Refs. [16, 19] using different bi-partitioning of the nuclear states. Specifically the authors calculated single-orbital entanglement entropy and two-orbital mutual information in shell-model nuclei. The mutual information, which encompasses both classical and quantum correlations, was found to be dominant in the proton-proton and neutron-neutron sector, while correlations between one neutron and one proton orbitals were found to be weak.\n\nTo complement these studies, and because shell-model wave functions are able to capture detailed many-nucleon correlations within a given valence space, we find it informative to compute a multi-partite entanglement measure, specifically the n-tangles, which can quantify how n Q -qubits are entangled within a larger n Q -qubit system [129–132]. The n-tangle ϱ(n) is defined as\n\nwhere the last equality shows the wavefunction in terms of binary orbital occupations of the twelve orbitals given in Eq. (4).\n\nSimilarly, 1d5/2 -2s1/2 -1d3/2 (sd-shell) nuclei are described with a total of 24 qubits. The mapping of the sd-shell proton basis states to qubits consistent with the ordering of outputs from the BIGSTICK code is given by,\n\n|1d3/2|1d5/2|2s1/2|\n|---|---|---|\n|1d3/2|1d5/2|2s1/2|\n\nand similarly for the sd-shell neutron basis states. This is shown in Fig. 2.\n\nFIG. 1. Mapping of the p-shell valence space in the BIGSTICK code to qubits. The filled 4He core (two protons and two neutrons in the 1s1/2) is also shown in grey. The shell-model wavefunction for the ground-state of 6Be (two protons in the p-shell on a 4He core), characterized by J = Jz = 0, is\n\n|6Be> = θ|1p1/2, ↑> + ω|1p1/2, ↓> + ϖ|1p3/2, ↑> + ...\n\nwhere the coefficients of the shell-model wave function in Eq. (1) are taken to be real.\n\nFIG. 2. Mapping of the sd-shell active space in the BIGSTICK code. The fully-filled O core is shown in grey."
    },
    {
        "id_": "e0c3b4a8-fef5-49cc-9324-8640419b019e",
        "text": "# 5\n\nprojections). Also due to particle-number conservation, n-tangles with odd values of n vanish. Thus, the 4-tangle, which represents a two-body operator, is the lowest-order tangle capturing many-body entanglement."
    },
    {
        "id_": "e4dcaabc-2f85-406f-a069-de95d9e8235f",
        "text": "# A. Multi-orbital entanglement in p-shell nuclei\n\nDue to the large number of n-tangles corresponding to all possible combinations of single-particle states (allowed by the symmetry selection rules), in order to appreciate and compare the importance of many-body entanglement in various nuclei, we first consider the summation of n-tangles ϱ (n) for a given value of n, in the proton, neutron and mixed proton-neutron sectors:\n\n|(n)↓|∑|(n) ϱ ε|ϱ (i1 i2 ..in),|all protons|\n|---|---|---|---|---|\n|(n)↓|∑|(n) ϱ ϑ|ϱ (i1 i2 ..in),|all neutrons|\n|ϱ εϑ (n)↓|ϱ (i1 i2 ..in)|(n)| |mixed|\n\nThe results for p-shell nuclei are shown in Fig. 3. As stated above, the proton-neutron 2-tangles cancel due to conservation of proton and neutron numbers. Further, due to the reduced size of the active space and rotational symmetry selection rules, there are also no pure proton or pure neutron n-tangles with n ⇐ 6 in the p-shell. It appears that the two-body entanglement, captured by ϱ (4), and the proton-neutron four-body entanglement (when permitted by the model space), captured by ϱ εϑ (8), are the largest. Overall, proton-neutron multi-body entanglement appears to be significant in the middle of the shell, while like-particle (pure proton or pure neutron) entanglement is typically larger near the shell closures.\n\nIt is interesting to examine these results further for a few select nuclei. The Beryllium nuclei are particularly interesting as they are known to display unique cluster and molecular-like structures, leading to large deformations [133, 134]. For example, 8 Be (Z = N = 4), which is characterized by a very short half-life of ⇒ 10−17 s [135], is understood to be a clustered nucleus composed of two ϑ particles. Adding neutrons to these ϑ clusters can result in molecular-like arrangements, where the neutrons establish the \"binding\" between the ϑ’s, similarly to electrons binding atoms into molecules. In particular, 9 Be and 10 Be, which have infinite and very long lifetime (> 106 y), respectively [135], have been observed to display ϑ ↔ n ↔ ϑ and ϑ ↔ 2n ↔ ϑ molecular-like structures in their ground states [136, 137]. While the presently-used shell-model framework may not be able to fully capture such clustered and molecular structures, the correlations present in shell-model wave functions may exhibit signs of these underlying structures. From Fig. 3, it appears that proton entanglement, captured by ϱ ε (4), increases as the neutron number N grows for N ⇐ 8, via proton-neutron interactions. This is in accordance with Ref. [19] which calculated the one-orbital von Neumann entropy and mutual information (MI) within the same framework as the present one. That reference however found very weak MI between proton and neutron orbitals. The von Neumann entropy and MI, however, do not furnish information about multipartite correlations. Indeed, as seen in Fig. 3, large multi-body proton-neutron entanglement is in fact present. In contrast to ϱ ε (4), ϱ εϑ (4) tends to decrease with larger N in 812 Be.\n\nFigure 4 displays the distributions of n-tangles for the Be chain. More precisely, Fig. 4 shows the distributions of expectations value of the Pauli strings ↗!|ˆ y ς(i1)↑ ... ↑ ˆ y ς(in)|!→ (which includes the information about the sign) for these nuclei. The frequency corresponds to the number of strings within a given interval. We differentiate again between the pure proton, pure neutron and mixed proton-neutron Pauli strings, and use a logarithmic scale to enhance the small like-particle contributions. 6 Be, which has an empty neutron valence space, and two active protons features a wave function with only three many-body configurations, leading to three non-zero (proton) tangles of large values. When adding neutrons, the nuclear wave functions becomes fragmented and the distribution of the n-tangles changes dramatically, displaying a large number of small elements."
    },
    {
        "id_": "64ed837a-974c-4c30-ac17-4d31a3c624d8",
        "text": "# 6"
    },
    {
        "id_": "358c1e83-6167-4ebc-a59d-ad507ea30add",
        "text": "# FIG. 4.\n\nDistributions of Pauli-string expectation values ↑ˆ y ε(n)↓ ↔ ↑!|ˆ y ε(i 1 )↗ ... ↗ ˆ y ε(i n )|!↓ with |↑ˆ y ε(n)↓| ↘ 10 ↑4 for n = 2, 4, 6, 8 in Be isotopes. The pure proton (ϑ), pure neutron (ϖ) and mixed proton-neutron (ϑϖ) Pauli strings are shown separately. Bin widths of 0.05 were used.\n\npeaked around zero. In 8 Be, we note a large contribution of proton-neutron 8-tangles, which is related to 4-body proton-neutron entanglement, and thus could signal the two-ϑ structure displayed by this nucleus. We note, however, that n-tangles with n ⇐ 4 in general do not provide a fully irreducible measure of multipartite entanglement, and thus may encompass contributions from lower-body tangles [138]. In 8 Be we observe that 2-tangles vanish and thus the 4-tangles capture genuine 4-orbital entanglement. The 8-tangles, however, may contain contributions from products of 4-tangles. It is clear that the increase in proton entanglement with growing N that was seen in Fig. 3 is due to a few contributions of large magnitudes. On the other hand, the distribution of proton-neutron entanglement is drastically different across the chain, as it displays a large number of small contributions, thus presenting a more collective behaviour."
    },
    {
        "id_": "8192d4fe-8eb0-4f26-aadf-ffba015ac4ea",
        "text": "# Fig. 5\n\nIn order to dissect these results further, we examine the details of the 4-tangles between single-particle orbitals in 8↓12 Be using network plots. These network plots have been generated using NetworkX [139]. The nodes represent each single-particle orbital and the (4) value of each edge e i 1 i 2 between two nodes i 1 and i 2 has been obtained by summing the value of the 4-tangles linking these two nodes, i.e.\n\n(4) ∑ (4) e i 1 2 i = ϱ (i 1 ,i 2 ,i 3 ,i 4 ), (10) i 3"
    },
    {
        "id_": "9cb39902-cf5f-4bad-a89e-74250094f5bc",
        "text": "# 7"
    },
    {
        "id_": "ba0e7248-e619-4eca-a870-66bc0cd4f2bc",
        "text": "# FIG. 6. Values of the proton-neutron, pure proton, and pure ω(n),"
    },
    {
        "id_": "74ac97f9-2be7-447a-827c-45df1908e865",
        "text": "# neutron summed"
    },
    {
        "id_": "d76a3d79-6abb-4be2-8827-876dc90bd6e3",
        "text": "# as defined in Eq. (9).\n\nscribed above. It is seen that around N = Z, the entanglement is largely shared between proton and neutron orbitals and collectively distributed among many components, while same-isospin entanglement dominates in nuclei away from N = Z, and is characterised by fewer but larger components.\n\nThe 8-tangles present a rather different behaviour, as we observe a strong proton-neutron component around N = Z, which may again signal ϑ-particle correlations. Interestingly, such large proton-neutron 8-tangle component persists in even-even isotopes all the way to 28 Ne, a nucleus at the boundary of the island of inversion, predicted to exhibit possible shape coexistence [141–143]. In comparison, pure proton and pure neutron components are almost negligible along the chain."
    },
    {
        "id_": "b59c2a22-1d1f-48ff-b523-8c84c3fe9f60",
        "text": "# FIG. 5. Network representation of the 4-tangles in 8↑12 Be.\n\nThe nodes represent the single-particle orbitals and are labeled as in Fig. 1. The values of the edges, representing the entanglement, are determined as in Eq. (10) and are indicated by both the darkness and the thickness of the lines. Orbitals that are shown closer together are also more entangled. The plots have been generated with NetworkX [139].\n\nInterestingly, the summation of proton-neutron 4-tangles, ϱ(4), appears to be rather homogeneous and weaker compared to the higher n-tangles, which present more distinct structures. The 6-tangles, ϱ(6), related to εϑ 3-body entanglement, present large contributions in a few odd-mass nuclei, while the 8-tangles, ϱ(8), largely dominate in a region around even-even nuclei around the center of the shell.\n\nAs an example, we examine the Ne chain in more detail. The 4-tangles for these isotopes present a similar behaviour to those in the Be chain: the two-body proton-neutron entanglement is strongest around N = Z, while the pure proton component dominates in isotopes with neutron excess. This is again understood as adding neutrons redistributes the protons over the orbitals, via proton-neutron interaction. The details of these 4-tangles can be seen in Fig. 7, in the same network form as described.\n\nIn 20 Ne, the entanglement is mainly distributed among the d5/2 and s1/2 proton and neutron orbitals. As neutrons are added to the system, the neutron d3/2 becomes more occupied and entangled with the rest. In 28 Ne, the proton-neutron 8-tangles are largely contained within the proton d5/2 and neutron d3/2. Neon isotopes with odd neutron numbers appear to have low proton-neutron 8-orbital entanglement."
    },
    {
        "id_": "825a1230-b081-4a1b-88aa-59cdb17f6f68",
        "text": "# V. MAGIC MEASURES IN SHELL-MODEL NUCLEI\n\nMagic, or non-stabilizerness, is a notion rooted in the stabilizer formalism, of which we briefly review the relevant aspects below. The stabilizer formalism is centered around the Pauli group, which, for a system of nQ qubits, is the group GnQ of Pauli-string operators with multiplicative phases:\n\nGnQ = {φ ˆ ς(1) ↑ ˆ (2) ↑ ... ↑ ˆ (nQ)}, ς ς\n\nwhere ˆ(j) ς ⇑ {1 (j), ˆ x ς(j), ˆ y ς(j), ˆ z ς(j)} act on qubit (shell-model orbital) j and φ ⇑ {±1, ±i}. For an arbitrary nQ-qubit pure state |!→, the elements Pˆ ⇑ GnQ which stabilize |!→, i.e., such that Pˆ |!→ = |!→, form an Abelian group S(|!→) called the Pauli stabilizer group of |!→ [144].\n\nThe state |!→ is called a stabilizer state if S(|!→) contains exactly d = 2nQ elements, and is fully specified by its Pauli stabilizer group. It is known that stabilizer states can be prepared with circuits comprised of Hadamard (H), phase (S), and CNOT gates only, which generate the group of Clifford operations. While these gates are able to generate entanglement, they can be efficiently simulated with classical computers [74]. Non-stabilizer states (magic states) require supplementing the above set of gates with a non-Clifford operation, such as the T gate, which is then sufficient for universal quantum computation. Consequently, the number of T gates, which are the key to realizing quantum advantages, quantifies the actual resource requirement in a quantum computation4.\n\nAs mentioned in the introduction, various measures have been developed to quantify the amount of magic in a quantum state, which is related to the number of T gates required to prepare that state [81, 82, 145]. In this work we have chosen to compute the stabilizer Rényi entropies (SREs) [82] of nuclear shell-model (active-space).\n\n4 The number of CNOT gates in a circuit is also relevant in the context of computation on NISQ devices (as CNOT gates provide the dominant source of errors in current simulations, and dominate the time required to implement a quantum circuit)."
    },
    {
        "id_": "941af386-1243-4bfa-874a-90c55bdf9152",
        "text": "# 9\n\nwavefunctions. Starting from a general expansion of the density matrix of an arbitrary state |!→:\n\n↼ˆ = |!→ ↗!| = dP ↑ G nQ↗!| P1 ˆ |!→ P ˆ = 1 c P P ,ˆ\n\n↓ ↗!| Pˆ |!→ and ˜ n Q where c P G is the subgroup of G n Q in Eq. (12) with phases φ = +1, the authors of Ref. [82] showed that the quantity"
    },
    {
        "id_": "4261ba9d-a723-453c-be4e-ec96ec58f0a1",
        "text": "# P ↓ c2 P , d is a probability distribution for pure states, corresponding to the probability for ˆ to be in P↼ ˆ. It was shown that |!→ is a stabilizer state if and only if the expansion coefficients c P = 0 for the remaining d 2 ↔ d strings [146]. Thus,,= ±1 for d commuting Pauli strings Pˆ ⇑ G n Q ˜ and c P # P = 1/d or 0 for a (qubit) stabilizer state, and the stabilizer ϑ-Rényi entropies [82],\n\nM ω (|!→) = ↔ log 2 d + 1 ↔ ϑ log 2Pˆ ↑ G nQ# P 1 ∑ ω\n\nprovide a measure of magic in |!→. The constant o\"set, ↔ log 2 d, ensures that the SREs vanish for stabilizer states. It was demonstrated that SREs with ϑ ⇐ 2 constitute magic monotones for pure states, in contrast to ϑ < 2 [87, 147].\n\nIt has also recently been shown [148] that SREs probe different aspects of magic, depending on the value of ϑ. Specifically, that SREs with ϑ > 1 provide a measure of the distance to the nearest stabilizer state, while those with ϑ < 1 are related to the stabilizer rank and complexity of Cli\"ord (classical) simulations of the quantum state. This is accordance with the earlier demonstration that M 1/2 is twice the logarithm of the stabilizer norm [82]. In the present study, we calculate the SREs M lin , M 1 and M 2 . In the ϑ = 1 limit, M 1 corresponds to the Shannon entropy,\n\nM 1 = ↔ # P log 2 d # P ,\n\nwhich can be derived from Eq. (15) by taking ϑ = 1 ↔ ↽, followed by the ↽ ≃ 0 limit. Expanding the logarithm in Eq. (16) around d # P ⇒ 1, defines the linear magic M lin ,\n\nM lin = 1 ↔ d # P2 .\n\nThe ϑ = 2 measure of magic, M 2 , corresponds to\n\nM 2 = ↔ log 2 d # P2 .\n\nwith the number of qubits, d 2 , implies a practical upper limit to the size of the active shell-model space for which all of the # P can be computed exactly. We find that for all of the p-shell nuclei, along with the sd-shell nuclei with either vanishing protons or vanishing neutrons, the SREs can be evaluated exactly, involving n Q = 12 qubits (d = 4096 and d 2 ⇒ 16.8 ⇓ 106), while exact evaluations of SREs for sd-shell with both active protons and neutrons, mapped to and d 2 ⇒ 2.8 ⇓ 10 14), are beyond what is practical with n Q = 24 qubits (d ⇒ 16.8 ⇓ 106 a single-processor. The situation is somewhat better than this because the nuclear structure and nature of the nuclear Hamiltonian gives rise to many vanishing matrix elements. However, the impracticality persists even with this consideration. For this reason, and following Ref. [93], Markov-Chain Monte-Carlo (MCMC) was employed to provide statistical estimates of the SREs in the larger active model spaces. Details of the MCMC sampling technique that we employed are given in App. C.\n\nIn the non-spherical nuclei, the distribution of amplitudes in the wavefunction was such that thermalization of the chains was slow, and the subsequent multi-chain sampling was slow to converge. Matrix elements of the d Pauli strings composed of Iˆ and Zˆ operators are typically # P ⇒ 1, while those of the other d 2 ↔ d strings are # P ⇔ 1, creating the situation in which an exponentially small number of samples are much larger than the rest. To improve sampling e!ciency and reduce classical resource requirements for such nuclei, we have introduced the PSIZe-MCMC algorithm, in which the matrix elements of the Iˆ and Zˆ strings are computed exactly, and the contributions from the other strings are evaluated using MCMC. This is detailed in App. B.\n\nThe results of our computations of M 1 (upper) and M 2 (lower) in the p-shell and sd-shell are shown in Fig. 9. While the maximum magic is found to coincide with the maximum deformation, ω, in each isotope chain, the magic is found to persist at a large value beyond where the deformation becomes small, indicating quantum complexity extends at a significant level through the region of shape co-existence, as transition into the region of level inversion. As this is also the pattern exhibited by the multi-partite n-tangles, this suggests that quantum computers will likely be able to provide a helpful acceleration of no-core nuclear structure and reaction calculations.\n\nIt is helpful to consider representative examples of the distributions of Pauli strings for select nuclei. Figure 10 shows the distribution of values of c P obtained for 6 Be and 8 Be (recall that for a stabilizer state, such a histogram would have support only at c P = ±1 for d of the possible d2 strings). These distributions give measures of magic for 6 Be of M 1 = 1.0422 and M 2 = 0.8465, which are smaller than those of 8 Be of M 1 = 5.6194 and M 2 = 4.2940. It is clear from these distributions and the corresponding measures of magic that 6 Be is closer to a stabilizer state than 8 Be. That is to say that, in the 8 Be has substantially more spherical shell-model basis."
    },
    {
        "id_": "4a48f84f-0e9e-4bf9-8c08-b0d80234e754",
        "text": "# FIG. 9.\n\nThe chart of the measures of magic of the p-shell and sd-shell nuclei computed from their active-space nuclear shell-model wavefunctions calculated using the BIGSTICK code. The solid-gray lines denote the limits of stability, while the dashed-gray lines denote the closed shells in the spherical nuclear shell model. The numerical values used to generate these figures can be found in Table VIII- Table XIV in App. D. While it is the experimentally determined dripline that is displayed [149], our results are obtained from an isospin-symmetric nuclear interaction without Coulomb, and hence a meaningful comparison would involve modifications that include a shift toward neutron excess due to the Coulomb interaction."
    },
    {
        "id_": "232060a0-f861-4fda-bdae-0056531c5a43",
        "text": "# FIG. 10.\n\nHistograms of the (non-zero) Pauli-string expectation values ↑!| Pˆ |!↓ obtained from the BIGSTICK shell-model wavefunctions for 6Be and 8Be. A bin width of 0.05 has been used."
    },
    {
        "id_": "25a1867c-e9fa-4f79-8aa5-4cad4b228072",
        "text": "# VI. COMPARISONS\n\nIt is interesting to compare the behavior of the quantum information with the shape parameters in an isotopic chain. As specific examples, we examine the behavior of M2, the summed proton-neutron n = 2, 4, 6-tangles ϱ εϑ and the 32Mg, calculated from Hartree-Fock-Bogoliubov ω deformation parameter for 18Ne - 30Ne and 20Mg - generator coordinate method of Ref. [150], provided in Ref. [151]. We selected the proton-neutron part of the n-tangles as proton-neutron correlations are usually considered to be related to deformation. For convenience, we have normalized each quantity to its maximum value, as shown in Fig. 11. In the Mg isotope chain, while ω drops to zero for 28Mg, a nucleus in the shape coexistence region at the boundary of the island of inversion, the magic and n-tangles remain significant, before becoming small (magic) or vanishing n-tangles at the closed neutron shell. The same behaviour is exhibited by the Ne chain. This suggests a connection between the deformation of a nucleus and the classical resources required to compute its ground state wavefunction using a spherical basis. As the required classical computing resources scale with the exponential of the magic [152, 153], our results suggest that they scale exponentially with the (non-trivial) “shape-complexity” of the nucleus, something that is not captured."
    },
    {
        "id_": "f070b4e5-0989-488b-b035-dc46671c6215",
        "text": "FIG. 11. The magic M2, the n = 4, 6, 8-tangles ω ωε in the proton-neutron sector and the deformation parameter ϱ in the neon isotope chain18 Ne - 30 Ne (upper) and the magnesium isotope chain20 Mg - 32 Mg (lower). The values of ϱ were taken from Summary Tables [150] reproduced at the website [151]. Each quantity has been normalized to its maximum value in the chain."
    },
    {
        "id_": "189a310b-426d-46b3-b4f3-b73b648f13f7",
        "text": "# VII. CONCLUSIONS\n\nAdvances in quantum information science are transforming our understanding of quantum many-body systems, and are providing new techniques and algorithms for predicting their properties and dynamics that are out of reach of experiment and of classical computing alone. This new technology provides opportunities to further improve our understanding of nuclei and nuclear reactions. Further, the now anticipated fault-tolerant quantum computers and processing units should provide computational capabilities that were impractical to consider seriously just a few years ago.\n\nNuclei are particularly interesting self-bound systems of two species of fermions (protons and neutrons) with strong short-range central and tensor two-body forces, strong three-body forces, and long-range electromagnetic interactions (neglecting the weak interactions). Beyond electromagnetism, the two species of fermions are nearly identical, but because of fine-tunings in the Standard Model, the small differences in quark masses are significantly amplified, for instance furnishing a two-nucleon system near unitarity. Combined, these features give rise to remarkable structures and complexities of nuclei, including of light nuclei.\n\nIn the context of computational complexity, the non-stabilizerness of a quantum state, encapsulated by the measures of magic, determines the quantum resources that are required to prepare the state, beyond the classical resources. Entanglement alone is insufficient to define a need for quantum resources, as some entangled states are accessible via a classical gate set, as encapsulated in the Gottesman-Knill theorem [152] and codified by Aaronson and Gottesman [153]5. It is the combination of non-stabilizerness with large-scale multi-partite entanglement that drives the need for quantum computing resources to prepare and manipulate a quantum state.\n\nIn this work, we have examined the quantum complexity in light and mid-mass nuclei, focusing on the entanglement structure and magic of the active nucleons in the p-shell and sd-shells of the spherical nuclear shell model. We have found, unsurprisingly, that the known complexity of these nuclei, including collective effects such as shape deformation and shape co-existence, which present challenges for the spherical shell model, are reflected in measures of multi-nucleon entanglement and magic. In deformed nuclei and isotopes on the path to instability, the higher-body entanglement, including collective proton-neutron entanglement, is prominent, as are the measures of magic. The relatively large values of these quantities persist for isotopes beyond those that are deformed.\n\nImplicit in our studies is the computation of matrix elements of strings of Pauli operators in the ground-state wavefunctions of p-shell and sd-shells nuclei that are mapped to qubits, with each qubit defining the occupancy of a single-particle shell model state. Calculations in the p-shell and in sd-shell nuclei with only one specie present are performed exactly, while for the typical sd-shell nuclei, the measures of magic are evaluated using an extensive suite of detailed MCMC evaluations. To accelerate the convergence of these evaluations in deformed nuclei, we introduced the PSIZe-MCMC algorithm, where the d matrix elements of Pauli strings of I, Z operators are evaluated exactly, while the remaining matrix elements are evaluated using MCMC.\n\nFrom a theoretical perspective, there is a path to be pursued in which transformations among the basis states and Hamiltonian are identified that reduce the magic and multi-partite entanglement in the ground state wavefunctions. Repeating our calculations using a deformed/collective basis is expected to yield results with less quantum complexity. This is along the lines of work we and others have pursued in entanglement re-\n\nExamples of further advances can be found in, e.g., Refs. [154–156]."
    }
]