[
    {
        "id_": "ad42b497-c1a7-4b05-8f7a-132f19345b2f",
        "text": "# ABSTRACT\n\nThe ramp reversal memory (RRM) is a non-volatile memory effect previously observed in correlated oxides exhibiting temperature-driven metal-insulator transitions (MITs). In essence, when a system displaying RRM is heated to a specific temperature within the MIT regime - where metallic and insulating domains coexist - and then cooled by reversing the temperature ramp, the resistance increases in the subsequent heating cycle. Crucially, this increase occurs only in the vicinity of the reversal temperature, indicating that the system \"remembers\" this temperature. However, this memory is erased in the next heating loop. While such an effect could potentially manifest in various systems, to date, it has only been reported in thin films of correlated transition metal oxides, including VO2, V2O, and NdNiO3. In this work, we report the observation of RRM in macroscopic crystals of the layered material 1T-TaS2, which undergoes an MIT near 190 K along charge-density wave transitions. Our findings provide compelling evidence that RRM is a general phenomenon, extending beyond the previously studied oxides. Interestingly, the RRM in TaS2 displays significantly different characteristics: it is observed when reversing from cooling to heating (as opposed to heating to cooling), and its magnitude - representing the \"strength\" of the memory - is nearly an order of magnitude larger than in correlated oxides. While we discuss potential mechanisms for the RRM in TaS2, a comprehensive first-principles model is still lacking. We hope that this study will prompt further investigation into the underlying mechanisms of ramp reversal memory, enhancing our understanding of this intriguing phenomenon."
    },
    {
        "id_": "260435da-fd55-4bd0-aee0-a76e3d5d898e",
        "text": "# KEYWORDS:\n\nRamp reversal memory, TaS2, metal insulator phase transition, non-volatile memory, correlated electron systems, transition metal dichalcogenides."
    },
    {
        "id_": "24cc9c45-4175-4ee2-a09a-a3cb773c560c",
        "text": "# The Ramp Reversal Memory (RRM)\n\nThe ramp reversal memory (RRM) is a recently discovered non-volatile memory effect, observed in a number of thin film transition metal oxides (TMOs) with temperature driven metal to insulator transitions (MIT).[1] The system can be made to remember one or more temperatures using a simple heating and cooling protocol. There is a well-established heuristic model for the effect, but to date there is still no accepted first-principal explanation. A major question which we address is – how general is the RRM? I.e., does it appear in systems other than TMOs? Herein, we demonstrate an RRM effect in a different material system, a bulk crystal of the transition metal dichalcogenide 1T-TaS2.[2]\n\nThe RRM has been reported for three thin films of correlated TMOs: VO, V2O3 and NdNiO3,[1,3–5] all of which exhibit a first order temperature driven MIT, with a hysteresis between the heating and cooling curves. Their temperature driven MIT is coupled to a structural transition (or deformation, in the case of NdNiO3).[6–11] Other properties these systems have that are presumed necessary for the appearance of the memory effect are:\n\n1. The systems exhibit a spatially-phase-separated state during the phase transition, where both insulating and metallic domains co-exist.[12–14]\n2. The transition temperature can be affected by various local properties, such as strain, doping and oxygen vacancies.[8,11,15–21]\n\nThe RRM was observed as a resistance change in the resistance vs temperature (R-T) curve (during heating) following a simple heating and cooling protocol. A detailed exemplification of the effect is provided in the supplementary material (SM) section S1[SM] and further detailed in previous publications.[1,3–5] In a nutshell, beginning from the low-temperature insulating phase, the system is heated to some temperature in the spatially phase-separated state, referred to as the reversal temperature – TR. Then the system is cooled again, producing a so-called reversal loop (RL). In the following heating curve, which is the memory reading measurement, the R-T exhibits a higher resistance than in the non-perturbed measurement, and the change is the largest near TR.\n\nThe change is attributed to local increases in the transition temperature of the MIT, as will be elaborated below. Thus, to analyze the change, one can look at the temperature dependent shift in the transition temperature, ΔT, which in essence is the temperature difference between two points on the R-T curves of the perturbed and unperturbed measurement with the same resistance value, see SM section S1 and Ref[4,5] for details. It is also possible to analyze the temperature dependent normalized change in resistance, ΔR/R. When plotting ΔR/R or ΔT as a function of temperature, a peak appears corresponding to the reversal temperature (TR) – this is the manifestation of the RRM."
    },
    {
        "id_": "b3c1d8bb-137f-4e2b-b6c2-a8490ec70dd3",
        "text": "# R-T Heating Measurement and RRM Effect\n\nSince heating to the fully metallic state results in erasing of the memory, the following R-T heating measurement returns to the unperturbed R-T curve."
    },
    {
        "id_": "bb2d7d16-0387-4db1-838d-c74ade11e241",
        "text": "# Heuristic Model of RRM\n\nA heuristic model can capture all properties of the RRM. It postulates that if the temperature ramp reversal (from heating to cooling) is performed while the system is in the spatially phase-separated state, then the local transition temperature of the phase boundaries (between the insulating and metallic coexisting domains) increases. We refer to the phase boundaries with increased MIT transition temperature as scars. Thus, during the following resistance measurement there is a delay in the advancement of the transition, which appears as an averaged temperature delay in the transition. Hence, the measurement of ΔT is a meaningful estimation to the magnitude of the RRM effect.[4,5] Finally, when the temperature is increased above TR, the previous scars are “healed”, and the memory is erased. The underlying mechanism responsible for this TC shift is still not substantiated and it may alter between different systems. Mechanisms including local strain[5] and local oxygen vacancy motion[3] were suggested. Based on this model, the RRM should potentially appear in other systems with similar characteristics."
    },
    {
        "id_": "b71f6375-6e38-462b-8239-55c0ab58b0e9",
        "text": "# Additional Properties of RRM\n\nAdditional properties of the RRM which are important to mention in the context of this research are:\n\n1. The RRM appears only on the heating curve and not on the cooling curve.\n2. The magnitude of the ΔT measurement increases when more reversal loops are performed (prior to measurement).\n3. The effect is nonvolatile, and if the system is not heated above the reversal temperature the memory is retained.\n4. It is possible to write a few memories simultaneously, as long as a previous memory is not erased by heating the sample above its reversal temperature."
    },
    {
        "id_": "d1a0845a-6574-4f2a-b24d-51a97410748f",
        "text": "# Demonstration of RRM Effect in 1T-TaS2\n\nIn this paper, we demonstrate that the RRM effect is also present in the correlated layered material 1T-TaS2. 1T-TaS2 is a Van der Waals transition metal dichalcogenide, with each layer composed of a plane of hexagonally arranged Ta atoms sandwiched by two S layers and the central Ta atoms are arranged in an octahedral structure. It undergoes several temperature-driven first order charge density wave (CDW) phase transitions, which include MIT transitions of different magnitude.[22,23]"
    },
    {
        "id_": "af3477a6-3a2d-4b98-8f10-a64d0f597dff",
        "text": "# R-T Measurement of 1T-TaS2\n\nIn Figure 1a we plot an R-T of the crystal we measured (see SM S2 for details on synthesis[SM]). Upon cooling, 1T-TaS2 transitions from an incommensurate CDW (I-phase) below 550K to a nearly commensurate CDW (N-phase) at 350K, and finally to a commensurate CDW (C-phase) below 180K, which is accompanied by a metal insulator transition with a resistance change of nearly one order of magnitude. The heating process reveals a slightly different..."
    },
    {
        "id_": "9ad397e9-4c53-4569-b656-7e313c07d0af",
        "text": "# Behavior of 1T-TaS2\n\nUpon heating from the C-phase, an additional CDW phase emerges – the stripe-like nematic Triclinic CDW (T-phase), between the C-phase and N-phase. Upon further heating, the N-phase is recovered around 280K. In the C-phase, thirteen Ta atoms form a star-of-David cluster, creating a triangular superlattice.24,25 The insulating behavior of bulk 1T-TaS2 in the C-phase was attributed to a Mott localization process, however there is still debate concerning the mechanism.26–28,29,30 The configuration of these star-of-David clusters varies for each CDW phase.23,31 The transition between the different phases was shown to happen through phase-coexistence,32 thus they hold an important ingredient for observation of the RRM."
    },
    {
        "id_": "766e2b7d-fcf8-4bac-9b72-d1251d56d5f6",
        "text": "# Electrical Properties\n\nThe electrical properties of 1T-TaS2 can be manipulated by several factors. An optical laser pulse33,34 or an electrical pulse35,36 applied at the low temperature insulating phase can drive the"
    },
    {
        "id_": "03148596-393e-4c57-93a2-69053d9084df",
        "text": "# Figure 1. Properties of the 1T-TaS2 Crystal\n\n|Temperature (K)|CCDW|T-CDW|NC-CDW|IC-CDW|\n|---|---|---|---|---|\n|150| | | | |\n|200| | | | |\n|250|2.4| | | |\n|280| | | | |\n|300| | | | |\n|350| | | | |\n\nThe heating curve is shown in red and the cooling curve in blue, with the different CDW phases indicated. The inset provides a zoom-in view of the T-, N- and I- CDW phases. Below the graph: A schematic of the warm-up and cool-down CDW phase transitions of 1T-TaS2, with each phase color-coded. The start and end points of each phase align with the temperature axis in the graph. (b) R-T for four heating and cooling measurements. The heating curves are shown in different shades of red, and the cooling curves in different shades of blue. All measurements show very close values, demonstrating the reproducibility of the R-T measurements."
    },
    {
        "id_": "7270c96e-48ce-4c3f-8ebe-0f98b14c5634",
        "text": "# Results\n\nMacroscopic millimeter-sized high-quality single crystals of 1T-TaS2 were grown using the chemical vapor transport method. [40,41] Figure 1a shows the R-T measurements of one such crystal and Figure 1b shows the R-T are well repeated when performing additional R-T loops. The R-T measurements were performed in our home-made cryostat, see SM S3[54] for an image of the device and the experimental section for measurement details.\n\nFigure 2 demonstrates the memory writing protocol of the RRM effect for a 1T-TaS2 bulk sample. The RRM writing and measurement protocol for reversal temperatures on the heating curve (like those used in the study of RRM in correlated oxides [1,4]) are plotted in Figure 2a-c, and the measurements of the RRM on the cooling curve are presented in Figure 2d-g. We plot the R-T curves in Figure 2a alongside the corresponding temperature vs time plot in Figure 2b (time on the y-axis). The ‘heating’ measurement starts at low temperatures (i.e., the full C-phase, 140K), ramps up to the full T-phase at 240K, and then returns to the initial low temperature, forming a major loop (ML). This establishes a baseline curve for comparison with subsequent measurements (green and orange curves). Next, the sample is heated to a specific “reversal temperature” (TR) of 219K, i.e., an intermediate temperature in the phase-coexistence stage (marked by a vertical gray dashed line in Figures 2a-c), and then cooled back to 140K, creating a reversal loop (RL)."
    },
    {
        "id_": "e3b6a016-3300-4a80-acc5-95bc14eb3478",
        "text": "# Memory Effects in 1T-TaS2\n\nPerformed 5 consecutive RLs, ending at 140K. Finally, another ML is performed by heating the sample to 240K and cooling back to 140K, constituting the memory reading stage (red curve).[1] Additional MLs are then performed to evaluate system stability and verify (in case there is a memory) that the memory is erased and the baseline is recovered (black and purple curves). Memory is assessed by comparing the ML heating curve before and after the RLs (red and orange curves). When the memory effect is present, the curves differ significantly near TR. However, as depicted by the red curve in Figure 1c, there is no clear modification in the resistance, and the R-T curve following the RL is similar to other ML heating curves. So, there is no signature of the RRM in the heating curve.\n\nA similar protocol modified to apply to the cooling curve is shown in Figure 2d,e, where now the RLs are performed by cooling from the T-CDW phase at 240K down to a reversal temperature. The protocol begins with a ML (from 240K to 140K) followed by four RLs (from 240K to 190.3K) and concludes with additional MLs. Now, when comparing the R-T curves of the ML before the RLs and after the RLs (red curve and orange curves, accordingly, plotted in Figures 2d and 2f) a striking difference is observed – the MIT seems to be shifted to lower temperatures. However, in the following ML (after heating to 240K and cooling again) the baseline R-T is recovered (black curve in Figure 2f). I.e., the RLs resulted in a memory effect that is erased after cooling the 1T-TaS2 to low enough temperatures. This is one of the main features of the RRM effect, which was not previously reported for RLs on the cooling curve. The transition in 1T-TaS2 from the N-phase to the C-phase can also be observed as a decrease in the magnetic susceptibility as a function of temperature, showing a hysteresis similar to that observed in the transport measurements. We attempted to measure the RRM effect in the cooling curve of the susceptibility as well. Somewhat surprising, we could not observe a memory effect in the susceptibility measurements, see SM S5 for further details.[54] Measurements of the 1T-TaS2 crystal were performed for different temperature ramp rates and for additional 1T-TaS2 crystals from different batches (prepared at different times), all showing similar results, see SM section S4 for representative measurements.[54]\n\nWe emphasize that R-T behavior of the RLs is qualitatively different than that observed when measuring minor loop effects in systems with hysteresis.[42] In such systems, if the extremum temperatures are not outside the hysteretic region one would expect the phase of the system in consecutive minor loops to be driven toward its final state, i.e., toward higher resistance."
    },
    {
        "id_": "6e1a1233-a462-4d86-b41c-36956da9cfb2",
        "text": "# Figure 2. RRM effect measurements on a bulk 1T-TaS2, for the heating and cooling branches.\n\nHeating branch: (a) R-T and (b) time vs temperature measurements of a RRM writing and reading sequence, aligned on the same temperature x axis. Each heating curve is colored using the same color coding in (a) and (b). The dashed gray line in a-c panels marks the TR of 219K. (c) A zoom-in section of (a), focusing on the TR region. The cooling curve right after the RLs is bolded.\n\nCooling branch: (d) R-T and (e) time vs temperature measurements of RRM writing and reading sequence, aligned on the same temperature x axis. The measurements in (d) and (e) are color coded. (f) A zoom-in section of (d) around the TR region of 190.3K. ΔT and ΔR are marked. (g) Continuous lines: Plot of ΔT vs T and ΔR/R vs T for the cooling curve right after the RLs (blue and orange curves, accordingly), exhibiting a maximum at TR. Dashed lines: ΔT vs T and ΔR/R for the next cooling curve (same color coding) showing the memory is erased.\n\n|Temperature (K)|Resistance|\n|---|---|\n|200|2|\n|210|2.5 x 10-1|\n|215|2 x 10-1|\n|220|5 x 10-1|\n|230|5 x 100|\n|235|8 x 100|\n|240|Kc|"
    },
    {
        "id_": "9f990839-b87f-45ea-9d76-a118d281e7b1",
        "text": "# Memory Properties in 1T-TaS2\n\nFollowing, we demonstrate the memory properties observed in 1T-TaS2 and compare them to the RRM properties reported previously in thin film TMOs.[1,4,5] Two different procedures to analyze the RRM[1,4] were previously presented: (1) calculate the normalized resistance difference (ΔR/R) vs. temperature of the ML following the RLs, and (2) calculate the temperature shift (ΔT) required to return to the original resistance at each temperature and plot it vs. temperature, see Figure 2f where both ΔT and ΔR are marked. The results of these analyses are plotted in Figure 2g, where a clear peak appears in both cases (solid orange curve for the ΔR/R analysis and solid blue curve for the ΔT analysis). The peak corresponds to the reversal temperature. Comparing analyses of the next ML (dashed orange and blue curves, following the same color coding, Figure 2g) shows the peaks have disappeared, demonstrating erasure of the memory. These features are similar to those reported previously for systems with RRM. There is, however, an interesting difference between them (in addition to the aforementioned difference that now the RLs are on the cooling curve): The magnitude of the temperature shift, ΔT, is above 1.5K, while the highest value measured previously was 0.6 K[5] and is usually around 0.15K.[4,5] We note there is an observable dip around 195K in both analyses that appears in most measurements with no relation to the reversal temperature."
    },
    {
        "id_": "0364edba-a99e-4db9-bcbc-23010dc61f09",
        "text": "# Figure 3. Different characteristics of the RRM:\n\n|Temperature (K)|Temperature (K)|Temperature (K)|\n|---|---|---|\n|180|186(3)|193.73|\n|185.2|190.22| |\n|Tocps|185.65 + 191| |\n|Iocps|191|4185 65|\n|lcops| | |\n\n(a) Plot of ΔT vs T of three RRM measurements, each one of a different TR, following the protocol measurement presented in Figure 2e. In all panels the perpendicular line marks the TR. In a, the curves have the same color as their corresponding ΔT perpendicular line. All peaks agree with their corresponding reversal temperature. (b) Plot of ΔT vs T of three RRM measurements at TR = 191.58K, each measurement with different number of RLs. The red arrow indicates increase in the number of RLs. (c) Plot of ΔT vs T of protocols with two different TRs, TR = 185.56 and 191K. Cyan plot for writing with decreasing TRs; blue plot for increasing. Both TRs are marked."
    },
    {
        "id_": "90e946d0-4cf9-4e1e-b69b-70f66b726420",
        "text": "# The magnitude of the RRM effect\n\nThe magnitude of the RRM effect was shown to be related to the measurement of ΔT, while the ΔR/R measurement is proportional to the magnitude of the resistance change across the MIT,[5] so the ΔT analysis has a physical interpretation. Below we show various features of the RRM using the ΔT analysis, all features were observed also in ΔR/R measurements."
    },
    {
        "id_": "83fd0a2a-3dca-4b78-a149-9bc8e7cff49d",
        "text": "# Figure 3a\n\nFigure 3a demonstrates that the position of the ΔT peak follows the reversal temperature, as is the case for systems with RRM (the measurement protocol is identical to that presented in Figure 2e). Three different TRs were measured, and the ΔT vs T analyses are plotted, where the reversal temperature (marked by the perpendicular lines) coincides with the corresponding peak position."
    },
    {
        "id_": "879164d2-894e-46cc-bf6e-29b95f160c8d",
        "text": "# Figure 3b\n\nFigure 3b presents the ΔT magnitude for different number of reversal loops (TR=191.58K), for 3, 7 and 13 RLs. The measurement protocol is detailed in SM S5.[54] The peak position remains the same while the peak magnitude increases with the number of RLs and seems to saturate when the number of loops increases. This is similar behavior to the reported behavior in RRM systems [1,4]."
    },
    {
        "id_": "103a38f6-7572-41cf-a5c6-f041d5e64a70",
        "text": "# Figure 3c\n\nIn Figure 3c we show the ability to write memories simultaneously, and their dependence on the order they are written. The measurement protocol is detailed in SM S5.[54] In one case we perform 3 RLs to TR = 185.6K, followed by 3 additional RLs to a higher TR = 191K, and only then measure the memory effect (via a ML). The result is plotted as the blue curve in Figure 3c, where 2 peaks are discerned. In the second case, the order is reversed, i.e., we first perform RLs to the higher TR =191K and then 189.7K."
    },
    {
        "id_": "ae9dbb16-b3a7-4b19-9940-a262d3545da6",
        "text": "# Figure 4\n\nFigure 4. Three RRM measurements of TR = 189.7K following a different dwell time at 280K. (a) ΔT vs T plot of the measurements, TR is marked. (b) Temperature vs time plot of the 3-hour dwell measurement. The ΔT plot in (a) represents the comparison between the red and orange curves in (b).\n\n|Dwell Time|Temperature (K)|\n|---|---|\n|No dwell|350|\n|3 hr dwell|250|\n|18 hr dwell| |\n\n175 &nbsp; 180 &nbsp; 185 &nbsp; 190\n\nTemperature &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Time (hour)"
    },
    {
        "id_": "9792cd43-77a6-46d3-9adb-8803c5d609b9",
        "text": "# Memory Effects in RRM Systems\n\nThe lower TR = 185.6K. In this case (cyan curve in Figure 3c) the ΔT plot shows a single peak, corresponding to the effect of the second and lower TR. The perpendicular lines mark the TRs. This outcome indicates that (i) it is possible to write more than one memory, and (ii) reaching temperatures below the reversal temperature erases the memory set at higher TRs. This is one of the principal properties of RRM systems."
    },
    {
        "id_": "5951184d-d047-41aa-b6d0-4a40563b91cd",
        "text": "# Volatility of the Memory Effect\n\nNext, we focus on volatility of the memory effect in various scenarios. We measured the time dependence of dwelling at high temperatures after writing a memory. The system was stabilized at 280K, once for a 3-hour dwell and another time for an 18-hour dwell. The results and the measurement protocol are presented in Figures 4a and 4b, showing that the memory is not volatile on these time scales."
    },
    {
        "id_": "67ecb426-7094-44a9-91ce-5ff67937b643",
        "text": "# RRM in Oxides\n\nWhen we studied the RRM in oxides, cooling to very low temperatures did not erase the effect. However, in 1T-TaS2 the memory is on the cooling curve, so it is reasonable that at high enough temperatures the memory will be erased. We performed the memory writing protocol using different maximum temperatures (Tmax) of both the MLs and RLs, the results are presented in Figure 5."
    },
    {
        "id_": "1021258e-a3ba-407b-a527-f36ecd8f8228",
        "text": "# Figure 5 Analysis\n\nFigure 5a shows ΔT curves of RRM writing protocols with TR = 187.5K and Tmax varying between 240K to 320K. The full protocols for these measurements appear in SM section S6.[54] To follow the effect as a function of temperature we plot in Figure 5b the value of the ΔT peak as a function of Tmax (same color coding as the ΔT plots).\n\n|Temperature (K)|ΔT Peak|Tmax (K)|\n|---|---|---|\n|165| |240|\n|170| |250|\n|175| |270|\n|180| |280|\n|185| |285|\n|190|1.0|290|\n|240|2.0|310|\n|250| |320|\n|270| | |\n|285| | |\n|300| | |\n|315| | |\n|330| | |"
    },
    {
        "id_": "6356de77-f20a-454d-9f7d-ee072d8a2568",
        "text": "# Figure 5 Summary\n\nFigure 5. RRM measurements of a TR=187.3K with different Tmax. TR is marked. (a) ΔT vs T plot of the measurements. (b) The ΔT peak as a function of Tmax of the measurement. The ΔT peaks in b and the ΔT plots in a have the same color coding."
    },
    {
        "id_": "8c07be96-d0be-45b8-9b63-9b1e2e302612",
        "text": "# 280K\n\nAll measurements exhibit similar ΔT magnitude, around 1.2K (Note that also the peak position is the same, 187.3K). Starting at Tmax = 285K, the ΔT peak begins to decrease, and the memory disappears around ~300K. This result cannot be compared to other RRM systems and is unique (at this point) to 1T-TaS2. We will return to this result in the discussion."
    },
    {
        "id_": "b89a8295-d876-431d-85d4-acf6b2dcf7d0",
        "text": "# Investigation of Dwell at Reversal Temperature\n\nWe investigated how dwelling at the reversal temperature affects memory properties. Figure 6 presents two measurements with TR = 187.5K, one without a dwell and one with a three-hour dwell at TR (detailed protocol in the SM section S8[54]). Figure 6a shows the ΔT plots, Figure 6b displays the R-T plots and Figure 6c presents resistance vs. time plots. It appears that the measurement after the dwell has a ΔT peak at a lower temperature than without the dwell. However, we can understand this result looking at Figures 6b and 6c. We observe that during the dwell the resistance of the sample increases over time (Figure 6c), indicating that the transition continues to advance, possibly due to thermal fluctuations.[45] We can estimate the effective TR from comparing the reversal loop resistance to that of the ML R-T measurement. The resistance change corresponds to a 3.2K shift in the effective TR which coincides very well with the 3.2K shift measured in the ΔT curves. Note that the resistance increase with time continues over more than a few minutes which is much longer than the temperature stabilization time in our system.\n\n|Temperature (K)|ΔT (K)|Time (hour)|\n|---|---|---|\n|184|3.2K|2|\n|187.3|3.2K|2|\n|175| | |\n|185| | |"
    },
    {
        "id_": "2f348781-cf07-4d4d-9164-190ca1ee02df",
        "text": "# Figure 6\n\nRRM measurement of TR = 187.3K, with and without dwell at TR. (a) ΔT vs T of the measurements. Blue, with three-hours dwell at TR, red, without a dwell. Solid lines mark the ΔT peaks of the measurements, with the same color coding. A shift of 3.2K between the ΔT peaks of the measurements is marked. (b) Resistance vs temperature of the measurements. In-set: A zoom-in plot of the R vs T curve, focusing on the TR region. A shift of 3.2K between the TR of the measurements is marked, corresponding to the shift in (a). (c) Resistance vs time of the measurements. It can be observed that during the whole three-hours dwell, the resistance of the sample continues to increase. The detailed protocol can be found in SM S7."
    },
    {
        "id_": "e50d0e97-b157-45af-b35e-c5d997a159ab",
        "text": "The delay cannot be attributed to some stabilization time between the sample’s temperature and the temperature sensor."
    },
    {
        "id_": "a8534657-b26c-4716-be34-f430f7b85084",
        "text": "# Memory Effect in Thick Flakes of Exfoliated 1T-TaS2\n\nWe attempted to measure the memory effect in thick flakes of exfoliated 1T-TaS2. A light microscope image of a 47nm thick flake is shown in Figure 7e, see SM S9 for information on device preparation.[54] We started with a memory writing protocol in the cooling curve, as illustrated in Figure 7a,b. Here 10 RLs were conducted, with a TR of 159K and MLs with a range of 100-240K. This measurement reveals a number of interesting outcomes. First, we see that the transition in the cooling branch is steplike, while in the heating curve the transition occurs more gradually, similar to the bulk crystal. Second, the MIT transition temperature in the cooling curve is different for each cooling cycle and the hysteresis is extremely wide. Flakes with wide hysteresis were previously reported.[46,47] We could not find previous reports showing these large variations."
    },
    {
        "id_": "34e78769-e05c-4f6f-819c-a583360a84a7",
        "text": "# Figure 7\n\nRRM measurement on a flake of 1T-TaS2, for the cooling and heating branches.\n\n|Cooling Branch|Heating Branch|\n|---|---|\n|(a) R vs T of a writing sequence in the cooling curve for a TR = 160K (dashed grey line). The measurement follows the measurement protocol presented in (b).|(c) R vs T of a writing sequence in the heating curve, for a TR = 206K (dashed grey line). The measurement protocol can be found in the supplementary.|\n|(b) Temperature vs time of the measurement – red curve and left axis, and R vs time measurement – blue curve and right axis.|The black arrow follows the decreasing trend of the reversals’ resistance with consecutive RLs.|\n|(d) A zoom-in of (c), focusing on the heating curves. The red bolded curve is the heating curve right after the RLs.|(e) Light microscope image of the flake and the electrodes.|\n|(f) An AFM image of the flake.|(f) An AFM image of the flake.|"
    },
    {
        "id_": "8a069c5a-145e-4a8a-92cc-775dd051dfa9",
        "text": "# Discussion\n\nBefore we delve into the discussion of the RRM properties in macroscopic 1T-TaS2, we highlight features related to the ramp-reversal experiments with the thick flakes. We observed a very sharp step-like transition in the cooling curve, and that the switching temperature varies widely with each cooling-cycle, between 144K and 169K. The heating curve, in contrast, is more smooth and does not fluctuate as much between heating cycles. This could be a result of strain from the substrate, and some stochasticity in the switching process for cooling, while there is not much strain when heating. We are not aware of this feature addressed in previous reports where flakes of 1T-TaS2 were measured. As far as the RRM is concerned, we could not measure it in the flakes. This is due to the sharp MIT that changes with temperature, making it impossible to attain a phase coexistence state of the metal and insulator, which is a crucial ingredient for memory."
    },
    {
        "id_": "59202e92-21bf-44be-b45c-dc0381e8a2d0",
        "text": "# Reversal Memory Effect in 1T-TaS2\n\nThe results measured on macroscopic crystals of 1T-TaS2 show unequivocally that a ramp reversal memory effect exists. Interestingly, some of the properties of the effect are considerably different in 1T-TaS2 relative to the TMO systems where RRM was observed. In 1T-TaS2, the reversal memory exists only in the cooling curve (see Figure 2), while in previous systems the memory appeared in the heating curve. The memory written at a specific TR is erased if we cool the sample to a lower temperature, in accordance with the RRM properties. Also, similar to RRM in TMOs, it is possible to write more than one memory to the system, and the magnitude of the effect increases if more than one reversal loop is performed. [1,4] Another unique property to 1T-TaS2 is that the memory is retained only as long as the system is not heated above ~280K, corresponding to the transition from the T-phase to the N-phase. Meaning, if the high temperature of the major loop is in the N-phase (above the T-phase) then the memory is erased. And, of course, if the system is cooled to the fully C-phase – the memory is also erased, as shown in Figure 8a. This indicates that the memory is maintained by a feature related to the T-phase and its phase boundary with the C-phase.\n\nA plausible scenario is that during a ramp reversal, when the system reaches TR and is in the phase-coexistence state (of T and C phases), the stacking order of the area near the phase boundaries is altered. It is known that stacking order can change the electronic properties of 1T-TaS2 [37,39,49,50], and in this case, it causes the Tc of the affected areas to decrease. This new stacking order remains when the system returns to the T-phase and is erased only when all the T areas of the phase boundaries transform to a C-phase (what we refer to as healing the scars [1]), or when the system is heated to the N-phase, which also erases any property related to the C-phase.\n\nIt is known that the 1T-TaS2 system can be driven out of thermal equilibrium into temporarily metastable states by pulses of light or current. [35,37,51,52] We suggest that the affected areas at the phase boundaries are also driven to some sort of local metastable state that maintains the low resistance state in a similar manner. [37] The origin must be different, of course, since in all studies the hidden state was reported to disappear above 70K to 120K [33,52,53], while our"
    },
    {
        "id_": "25646322-7645-4d37-85a1-73cbe0c4b8ec",
        "text": "# Measurements and Observations\n\nMeasurements are above 250K. Unlike previous reports of hidden states in 1T-TaS2, where the metastable states were achieved by exciting the system out of equilibrium, here it occurs through thermal equilibrium, requiring only heating and cooling of the sample. The suggested explanation for the scar formation is general and heuristic in nature, requiring development of a theoretical microscopic explanation. Solving this issue will require further studies with different measurement techniques, such as local probe measurements of the RRM."
    },
    {
        "id_": "fb8e5def-6af6-4b39-9e83-70132c23aafc",
        "text": "# Comparison of RRM in 1T-TaS2 and TMOs\n\nAn additional difference between the RRM in 1T-TaS2 and TMOs, is the magnitude of the ΔT peak. The ΔT peak magnitude measured in previous systems was ~0.15K in VO2 on c-cut and r-cut sapphire, 0.2K in NdNiO3, and a maximum value of ΔT~0.6K was observed for VO2 deposited atop SiO2. Here, we measured a ΔT peak surpassing 2.5K (for a few RLs). Note that this value indicates how much the transition temperature is shifted due to the memory effect, and a 2.5K shift is a substantial effect."
    },
    {
        "id_": "d9f0a0d2-a67c-4f51-9d86-2aab4e187cbb",
        "text": "# Factors Affecting the Magnitude of the Peak\n\nWe identify two parameters that can affect the magnitude of the peak. The first one is that the local temperature shift at the phase boundaries is larger in TaS2 during the ‘writing’ stage, resulting in a shift in the measured R-T curves. It was shown for VO2 thin films that if they are less strained by the substrate, i.e., when the film is not lattice matched, then during the ramp reversal, the phase-boundary distortions (scars) are more free to reorganize. This resulted in more stable scars, that require larger energy to be released, i.e., a large ΔT and a larger RRM effect. Here, 1T-TaS2 is a 3-dimensional macroscopic Van der Waals layered material. It is reasonable that flakes at the phase boundary of the phase-separated state could slip relative to one another, resulting in high-energy phase-boundary scars.\n\nA second source is related to how the local properties of 1T-TaS2 change spatially. According to the RRM heuristic model the memory develops in the phase boundaries of the phase-separated domains (here between the T- and C-phases). If the transition temperatures of nearby domains are correlated, i.e. the spatial change of TC is slow, then the ΔT peak will be smaller than if the neighboring domains are not correlated and may have very different switching temperatures. The reasoning is that if the domains are less correlated then more T-phase islands will appear, resulting in more phase-boundaries during the reversal, and then more areas where the transition temperature changes, leading to a larger effect."
    },
    {
        "id_": "3e560f88-a097-40ee-817c-e1cabd2e78c0",
        "text": "# Numerical Simulations\n\nTo demonstrate this, we performed numerical simulations where we include a “correlation length” parameter. The model simulates the nucleation and growth of the C-phase in the T-phase."
    },
    {
        "id_": "7c0b6a31-b451-4766-a53f-94c772c6411d",
        "text": "# Numerical simulation of the RRM effect in 1T-TaS"
    },
    {
        "id_": "461facf3-cf45-4c80-bc22-be4bb12bcd6f",
        "text": "# Figure 8\n\nAs the system is cooled. As the correlation length increases, the Tc of more distant sites will be correlated. The local Tc and the correlation length are controlled by randomly assigning Tcs from a Gaussian distribution to a specific percentage of sites, and then smoothly changing the Tc between these sites. The correlation length is then defined as the average distance between uncorrelated sites, so that 1/1 indicates adjacent sites are uncorrelated and as 1 → 0 means the correlation length → ∞ and all sites are correlated. See Figure 8b for an example of a Tc map for a realization with 3.16 sites. In each realization of the simulation, the system follows a standard RRM protocol and calculates the ΔT plot between the “reading” curve and “base” curve. For more details on the numerical simulation see SM S10.[54]\n\n|Temperature (K)|Homon memory C-CDW|Homon memory T-CDW|\n|---|---|---|\n|175| | |\n|180| | |\n|185| | |\n|190| | |\n|195| | |\n|200|200| |\n|205| | |\n\n(a) Schematic of the RRM memory writing stages, different CDW phases, and resistance as a function of temperature for a bulk TaS. (b) Tc distribution map for 3.16. (c) ΔT vs temperature calculation for TR = 189K plotted as a function of different values, appearing color coded in the legend. (d) ΔT vs temperature simulation for different TR with 1.3. (e) ΔT vs temperature simulation for different TR with 10. The local Tc shift in d. and e. is 1.5K."
    },
    {
        "id_": "f1d1cae2-bf42-4210-816d-6645c96f8199",
        "text": "# Results for simulations with different\n\nare plotted in Figure 8c. The ΔT vs temperature curves of an RRM protocol for TR = 189K are shown, the correlation length is marked in the legend, ranging from 22.4 sites, to short correlation length 1.1, see legend. The local TC shift for the sites at the phase-boundaries during the reversal were set to 1.5K. As the correlation length increases the peak increases, starting from 0.4 and growing toward the local Tc shift of 1.5. In addition, the width of the ΔT also grows. This demonstrates our claim that the measured ΔT will be larger as the correlation length becomes smaller.\n\nWe attain additional insight from the simulations in Figure 8d and 8e, where we simulate the ΔT vs temperature for different reversal temperatures (see legends) and two different correlation lengths, Figure 8d for 1.3 sites and 8e for 10 sites (the local Tc shift is 1.5K). In both cases the ΔT peak value is larger at the center of the transition, where many sites are switching so there are more scars, and smaller toward the beginning and end of the transition where there are fewer scars. However, there are notable differences. First, the magnitude and the width of the ΔT peak is larger for the shorter for all reversal temperatures, as explained above and shown in Figure 8c for a single TR. Second, for short there is a wide range of reversal temperature, between 185K and 195K, that have a similar ΔT magnitude, while for longer correlation length the peak magnitude changes with each reversal temperature."
    },
    {
        "id_": "30c2722d-ff12-4c11-a600-064547b0966c",
        "text": "# Considering the experimental results\n\nwhich show that the ΔT is larger and wider in TaS2 as compared to TMOs, and that the magnitude is similar for different reversal temperatures (compare Figure 3a with reference [5]), we hypothesize that the correlation length in TaS2 is shorter than in TMOs. This is plausible since the TMO were thin granular films, where each grain can be a nucleation site, and the composition of adjacent grain should, in general, have similar characteristics of oxygen vacancies, strains, etc., resulting in a similar transition temperature that changes only in grains further away. Note that the correlation length should be normalized to the average size of the domains that are switching of course. The TaS2, is a single crystal, so the domains with different transition temperatures are probably larger and could have much less correlations between them."
    },
    {
        "id_": "edc67f8c-261a-4472-929e-34e7d5675257",
        "text": "# Conclusion\n\nIn summary, we have measured the presence of the RRM in bulk 1T-TaS₂, demonstrating the generality of the ramp reversal effect. While 1T-TaS₂ has the main RRM properties as previously demonstrated in TMO systems, a notable difference is that the effect exists in the cooling branch, and not in the heating branch. We show the mechanism of the RRM is related to the phase coexistence between T- and C- CDW phases, explaining why it can only be observed on the cooling branch. However, a microscopic mechanism for memory writing in this system is still lacking. We hope this study will encourage further experimental and theoretical research into this intriguing phenomenon. Importantly, the discovery of RRM in an additional system so different from TMOs emphasizes the universality of this memory effect. Our results suggest that RRM could be a more general phenomenon in correlated materials with a phase transition occurring through spatial phase separation. Meaning, it should exist in systems with ferromagnetic, ferroelectric and other types of phase transitions, where the ramp-reversal of a driving force can lead to emergent memory phenomena in these correlated systems."
    },
    {
        "id_": "ea0a133f-5823-452d-8ce5-3fac3af448fd",
        "text": "# Methods"
    },
    {
        "id_": "b6c03c0a-c012-4617-a729-d75435d9e1b2",
        "text": "# Resistance vs Temperature measurements\n\nSilver paste was used to connect wires to the 1T-TaS₂ bulk sample. The sample was cooled by our home-made cryostat with a temperature range of 77K to 370K. The resistance was measured by a Keithley 2400, with current source of 4mA. The temperature was controlled by a Lakeshore 335 and was ramped with 5 kelvin/min. Both 2 and 4 probe measurements were performed. We compared the two and prove that the 2 probe measurements are reliable, see SM S3 for more information.[54]"
    },
    {
        "id_": "8b609879-7fa7-44b1-822f-29c50a47150b",
        "text": "# Flakes fabrication and measurements\n\n1T-TaS₂ flakes were fabricated by using an exfoliating technique. 1T-TaS₂ bulk was pressed to a tape, and then the tape was pressed onto a SiO₂ 300nm/Si substrate, leaving flakes on the surface. Then, Au contacts were added by a photolithography mask planned for each flake. The flakes were measured by the same setup measurement of the bulk, with a voltage source of 1mV."
    },
    {
        "id_": "70bb7196-148f-4d05-b247-42632f08c490",
        "text": "# Numerical simulations\n\nThe numerical simulations were performed using Matlab software. A resistor network with local resistances changing with temperature was defined, and a set of Kirchoff equations were written. The total resistance of the network was found by inverting the..."
    }
]