[
    {
        "id_": "d48a0820-0d21-4e1e-86db-d93d2afbcd32",
        "text": "# 1 Introduction\n\nThe solid-state, or “ceramic” method is a simple and ubiquitous technique for synthesizing inorganic crystalline solids in which powder precursors are heated to elevated reaction temperatures under controlled atmospheric conditions4. This method is used at both the small-scale (e.g., research laboratories attempting the synthesis of new materials) and large-scale (industrial manufacturing processes) to produce a wide variety of important functional materials such as battery cathodes (including LiMnPO45 and LiFePO46), the ferroelectrics BaTiO37, YMnO38, and BiFeO39, and many superconductors, including FeSe0.8810, YBa2Cu3O6+x11, and MgB212. Despite the ubiquity of the method, no conventional system for designing or modeling solid-state synthesis recipes exists. Instead, recipes have long been designed primarily using expert knowledge (e.g., precursor selection from a common library or via phase diagram analysis) and heuristic guidelines13;14.\n\nThe difficulty in modeling solid-state synthesis reactions can be illustrated by drawing a comparison to organic molecular synthesis in which recipes can be generated by working backward from a desired product molecule to a set of known precursors via a series of mechanistically well-defined steps in a process known as retrosynthesis15. In contrast, high-temperature solid-state synthesis proceeds by spontaneous thermodynamic reactions which lack clearly defined intermediates and reaction mechanisms. However, enabled by the recent rise of high-throughput density functional theory (DFT) calculations16;17 and the databases generated by them1;18;19;20, several new automatable methods for designing solid-state synthesis recipes have emerged. These methods, which include measures for determining the synthesizability of a desired target21;22, metrics for comparing the selectivity of reaction recipes23;24, tools for extracting synthesis data directly from natural language25;26;27, and reaction networks which identify thermodynamically favorable pathways between specified precursor and target materials28, have yielded early success in guiding synthesis recipe design, despite being built on zero-temperature simulations of ordered crystalline structures. Furthermore, advances in autonomous synthesis have increased throughput for synthesis experiments29;30;31 and motivated the development of synthesis design algorithms that utilize experimental results to improve their planning32. While each of these methods provides an element of recipe design guidance, none of them allows for the quantitative prediction of the time and temperature-resolved emergence and consumption of phases during the execution of a synthesis recipe.\n\nThough no a priori simulation exists for predicting the progression of solid-state synthesis reactions, other reaction classes have been captured by simulation methods that are not neatly transferable to the solid-state case. For example, the kinetic Monte Carlo method is frequently used to model the evolution of species in gas or liquid phase molecular reactions (often in conjunction with reaction rates calculated using transition state theory33;34). This method assumes integer numbers of discrete particles that transform via reaction into other sets of discrete particles, and it assumes that these particles are available to interact with each other with no heed paid to their spatial arrangement35. These two assumptions do not hold for solid-state reactions; instead, solid phases transform in continuous amounts from reactant to product and reactant particles do not move as freely as they do in liquid phase reactions (barring the presence of a molten flux or gas transport). Surface reactions have been successfully modelled by lattice Monte Carlo simulations to determine heterogeneous catalytic behavior, but they explicitly treat the motion of individual atoms36. This method is not feasible for modeling the evolution of the powder contents of a solid-state reaction vessel because the large number of atoms are involved (often on the order of 1010 - 1020 atoms or more) leads to intractable computing requirements. Indeed, any atomistic method presents similar limitations. Finally, phase field models have been used to model ionic diffusion during solid-state metathesis reactions37, but these methods require significant assumptions."
    },
    {
        "id_": "17bbc508-1922-4c0d-92b3-944ee421ffd3",
        "text": "# Current Page"
    },
    {
        "id_": "a42096ac-662e-499f-96f5-e9618948891f",
        "text": "# 1. Introduction\n\nIn light of these challenges, we present in this work a simulation framework (ReactCA) that predicts the time-dependent, quantitative evolution of phases over the course of a prescribed solid-state reaction as a function of precursor ratio, heating profile, and reaction atmosphere. To achieve this, we leverage the cellular automaton (CA) formalism which offers a flexible framework for addressing the unique challenges posed by solid-state reactions.\n\nA CA is defined by a grid of sites, each of which is assigned a state value. At each step in the evolution of the automaton, the state in each site is updated according to its own current value and the states of the sites neighboring it (the “neighborhood”). The specific nature of the state values and the rule governing evolution (the “evolution rule”) can be chosen to best suit the simulation problem at hand. As a result of this flexibility, cellular automata have been used in materials science and chemistry to model a variety of processes, including grain growth, crystallization, and surface adsorption/desorption.\n\nDue to the fundamentally spatial nature of the neighborhood and the flexibility of the evolution rule, the CA structure is a natural choice for modeling solid-state synthesis.\n\nThe simulation framework described here utilizes zero-temperature thermodynamic properties of ordered crystalline compounds from the Materials Project as its primary input data. Importantly, some of the compounds we simulate here (and many of those found in the Materials Project) can accommodate disorder, which would increase the entropy of these phases and affect the energetics of the reactions which form them, especially at higher temperatures. To date however, no existing database of computed material properties contains rigorous representations of configurationally disordered materials and their entropy.\n\nAs a result, for the ordered materials in the Materials Project, we consider only the vibrational entropy contribution to the Gibbs formation energies as estimated by the machine learning method of Bartel et al. These estimates, in conjunction with the cellular automaton formalism, are used to capture the thermodynamic and spatial features of solid-state reactions in addition to some rudimentary kinetic effects based on machine learning estimates of phase melting points. Our framework offers new functionality in automated solid-state synthesis planning in that it enables the facile prediction of quantitative reaction outcomes a priori as a function of temperature profile, reaction atmosphere and precursor choice.\n\nWe envision our framework being used as a straightforward, easily implemented method for testing hypothesized recipes before attempting them in the lab, for implementing a digital twin in an autonomous laboratory designing its own synthesis recipes, and for refining synthesis parameters when used in conjunction with optimization frameworks."
    },
    {
        "id_": "69e01f24-ecc7-4894-a478-e507590062df",
        "text": "# 2. Theory and Computation"
    },
    {
        "id_": "0fc4c56b-6112-4edd-ab48-2cd5e1698601",
        "text": "# 2.1 Cellular Automaton Model\n\nThe solid-state reaction cellular automaton simulation described herein (ReactCA) is constructed based on the pairwise model of solid-state reactions. This model states that solid-state powder reactions proceed predominantly via sequential reactions at pairwise interfaces (i.e., between only two solid species at a time). This model has its theoretical basis in the spatial geometry of the contact regions between particles, and has been verified with in situ experiments.\n\nThe solid-state reaction process, illustrated in Figure 1a, proceeds via the diffusion of atomic species driven by chemical potential differences across the interface between two reactant particles. As the reaction"
    },
    {
        "id_": "617069c8-e61a-4ae6-8379-2b99ba18e11b",
        "text": "# Modeling Solid-State Reactions\n\nProgresses, nuclei of one or more stable product phases form and grow at the interface, converting reactant material into product. Importantly, the local composition of the interface region is determined by the kinetic availability of reacting species and not constrained to reflect the overall composition of the precursor mixture. The first product phase to form is then a function of the “local” composition (as opposed to the overall composition) and the relative energetics of the possible product phases41."
    },
    {
        "id_": "81ec5676-195f-4492-964c-9887b7dfd222",
        "text": "# a)"
    },
    {
        "id_": "b301bd03-b892-4fc7-946a-10bfc4d2e7cb",
        "text": "# b) Composition\n\nReaction Sites\nPrecursors mixed\nReactions initiate at interfaces\nProduct phases form"
    },
    {
        "id_": "8b3340d7-f4d0-4fa8-8607-b44511a37552",
        "text": "# c) Data Preparation"
    },
    {
        "id_": "c160949f-2db1-42bd-bd8b-15ff1f9859b5",
        "text": "# ii) Simulation Setup and"
    },
    {
        "id_": "50bdaa7d-5f4b-4fc4-a9df-019389ef3fd1",
        "text": "# iii) Trajectory Construction"
    },
    {
        "id_": "2ea2421f-e9c4-4bc0-b55f-d44d7e18c275",
        "text": "# Evolution\n\n|Calculate phase energies|Initial State|A + B|\n|---|---|---|\n|Enumerate|Score Rxns|2A + 3D - 2C + B|\n|Specify Recipe|B + 3D - - 2F +|Precursor Ratios|\n|Heating Profile|Final State|Reaction coordinate|\n\nFigure 1: Modeling solid-state reactions with a cellular automaton. a) The progression of the initial stages of a solid-state reaction occurring via the pairwise interface reaction model; b) convex hull schematic representing the thermodynamics of reactions between two hypothetical solid precursor phases drawn as orange squares and light blue hexagons, with possible products given as the pink diamond and blue oval phases; c) schematic illustrating the main stages of the simulation: i) formation energies are obtained from the Materials Project and machine learning estimators are used to calculate the vibrational entropy part of the Gibbs energy of formation as a function of temperature and the melting point for each phase, reactions are enumerated and scored, and a recipe is specified which defines the desired precursors, a heating profile, and a reaction atmosphere; ii) a random initial arrangement of particles is generated, and the evolution rule is repeatedly applied to simulate the reaction; iii) simulation steps are concatenated into a trajectory which is analyzed to determine phase evolution over the reaction pathway.\n\nThe thermodynamics of the pairwise interface reaction model are conveniently represented by the convex hull construction, in which the Gibbs free energy is shown as a function of the mixing ratio (i.e., mixture composition) of the two precursor phases (Figure 1b). The interior points (i.e., pink diamond and blue oval) represent product phases that can form as the result of the reaction."
    },
    {
        "id_": "f5c32039-cbaf-42d1-8303-1c689ba5e8e4",
        "text": "# 2.2 Phase Data Acquisition\n\nThe input data for ReactCA is determined by the desired synthesis recipe which includes precursor ratios, a heating profile, and a reaction atmosphere (currently gaseous atmospheres consisting of only a single element are supported, e.g. N, O2 or Ar). The heating profile is defined by the user as a list of heating stages which each have a temperature and duration (specified by number of simulation steps). Once this recipe is defined, ordered crystal structures in the chemical system spanned by the reaction atmosphere and precursor phases are identified and their calculated formation energies are acquired from the Materials Project. Note that these formation energies are calculated via zero-temperature DFT while solid-state reactions occur at elevated temperatures. However, exact calculations of finite temperature formation energies are not available from existing high-throughput databases. To bypass this data deficiency, a machine learning descriptor given by Bartel et al.3 is used to estimate the vibrational entropy contribution to the Gibbs energy of formation for ordered solid phases at each of the temperatures specified in the reaction recipe. The Gibbs free energies of formation for common liquid/gaseous phases are acquired from experimental thermochemistry data (NIST-JANAF tables)42. Finally, the melting points of all phases are estimated using the graph neural network model from Hong et al.2."
    },
    {
        "id_": "ef576037-7199-428d-98f2-817e365862d3",
        "text": "# 2.3 Reaction Enumeration and Scoring\n\nWith the phases and energies acquired from the Materials Project, the reaction-network28 Python package is used to identify all stoichiometrically possible reactions and calculate the changes in Gibbs free energy associated with them at each of the specified temperatures. While no general strategy exists for estimating the rate of solid-state reactions, predicting the evolution of phases during a reaction necessitates a model for relative reaction rates. To accomplish this, a score, S, is calculated for each reaction at each temperature using a heuristic function (Eq. 1), which returns the relative likelihood of each reaction occurring:\n\nS = 1ln[1 + exp(a → ( Tm,reactant2 Trxn ↑ b))] → [1 + erf(↑c(!Grxn + d))] (1)"
    },
    {
        "id_": "9336aaa7-469a-4987-a4e2-6acc972384ff",
        "text": "# Figure 2: Scoring the likelihood of reactions as a function of reaction energy and temperature.\n\n|a)| |AG rxn|b)|Tit|0.67|c)| | |\n|---|---|---|---|---|---|---|---|---|\n| |3.5|3.5|2.5|2.5|1.5|1.52| | |\n|0.5|0.5| | | | | | | |\n| |-0.3|-0.2|-0.1|0.1|0.2|0.4|0.6|0.8|\n\nThe score function described by Eq. 1 is composed of two primary terms: a softplus function term and an error function term. The shape of this function (shown in Figure 2) captures: 1) the spontaneity of exergonic reactions, 2) the onset of reactions at temperatures equal to two-thirds of the melting point of the lowest melting point precursor (i.e., Tamman’s Rule) and 3) the increase of reaction rate with temperature. The scaling parameters a = 14 and b = 0.8 were chosen to shift/scale the softplus function such that its “onset” is around the Tamman temperature (Trxn Tm = 23) and the parameters c = 35 and d = 0.03 were chosen to shift/scale the error function such that it is centered on the region just below ΔG = 0 eV/atom. Other values near the ones shown here for a, b, c and d were experimented with, but the variations did not significantly alter the simulation outcomes.\n\nThe softplus function was chosen to encode Tamman’s rule because of its “soft” activation (i.e., above the Tamman temperature). The error function was chosen to encode spontaneity because it behaves as a dial that abruptly “ramps up” for exergonic reactions. While these effects could also have been encoded using piecewise functions (e.g., a rectified linear unit in place of the softplus function, or Heaviside function in place of the error function), we opt for smooth alternatives which “smear” the onset of each effect over a range of values. This smearing allows for a degree of accommodation for uncertainty in our input Gibbs energy and melting point estimates. Most importantly, the scoring function can easily be updated to accommodate more sophisticated functionality, e.g. based on kinetics and local availability of reactive species."
    },
    {
        "id_": "f14ee806-1d6b-4574-acdb-1100f1cc5700",
        "text": "# 2.4 Simulation Evolution\n\nAfter phase data is collected and reactions are enumerated and scored, an initial simulation state is defined. The simulation box for this automaton is a three-dimensional region of space subject to periodic boundary conditions and discretized into a grid of cubic cells. To establish an initial state, each cell is randomly assigned a phase occupancy according to the precursor ratios given by the reaction recipe along with a volume equal to 1.0. We assign no scale or unit to this value."
    },
    {
        "id_": "ff77c37d-c9cb-4d7d-9b2e-f9b7b22c9385",
        "text": "because only the ratio of the volumes of neighboring cells is relevant to this simulation. This value is used in achieving conservation of mass and should not be interpreted as a literal measure of the physical extent of the simulation.\n\nThe evolution rule determines the phase occupancy and volume value of the selected cell in the next simulation time step. It is applied to a single cell at a time, selected at random, meaning that this simulation is an asynchronous cellular automaton (as opposed to a standard cellular automaton, in which every cell is updated simultaneously)43. This rule ensures that one of two actions occurs: 1) a swap, or 2) a reaction. These actions are illustrated in Figure 3. The definitions for the simulation state and shape, along with the evolution rule were implemented using the pylattica Python package44."
    },
    {
        "id_": "f682f093-243f-4780-9f16-9eaa99438be1",
        "text": "# 2.4.1 Action 1: Melted Phase Swap\n\nIf the current reaction temperature is above the melting point of the phase in the selected cell, the state of the selected cell is swapped with one of its neighbors, chosen at random, as shown in Figure 3. To accommodate uncertainty in the estimation of the melting point, the onset of the likelihood of this swap is smeared over a range of relative temperature values. Specifically, the swap likelihood begins ramping up as a function of reaction temperature at Trxn = 0.8Tm, increases to a 95% probability when Trxn = Tm, and reaches a 99% probability at Trxn = 1.2Tm. This behavior is shown graphically in Supplementary Figure S1. The swapping motion facilitates movement of the reaction vessel contents and can capture heightened reactant movement during flux-mediated reactions in which the presence of a liquid phase makes reactants more able to access each other. This is crucial for capturing more realistic reaction dynamics in many solid-state reactions."
    },
    {
        "id_": "89bb84a0-1a22-4dcf-98cf-7eb70b25b789",
        "text": "# 2.4.2 Action 2: Reaction Progression\n\nIf the phase occupying the selected cell is determined to be solid (i.e., it has a melting point higher than the current temperature), a reaction is selected. In this step, the reaction library is consulted to identify possible reactions between the selected cell and each of its neighbors. Reactions between the phase in the selected cell and the reaction atmosphere are also considered. From this list of possible interactions, a reaction is chosen randomly with a probability that is proportional to its score obtained from Eq. 1. As a result, reactions with higher scores occur more frequently than reactions with lower scores. This scheme has the net effect that higher-scored reactions proceed faster. Once a reaction is chosen, the reaction proceeds at each of the reacting cells; note that only a single cell is involved if the other reactant is contained in the atmosphere (e.g., gaseous O2). This procedure entails several steps (Figure 3):\n\n1. A probability distribution over the reactants is constructed. The stoichiometric coefficients taken from the reaction are used as the weights in this distribution.\n2. A random draw from the resulting distribution is performed. If the resulting phase matches the phase of the reacting cell, the process proceeds to the next step. If it does not match, the step ends and the cell is left unchanged.\n3. If the reaction proceeds, a second distribution is constructed over the reaction products (again using their stoichiometric coefficients as weights).\n4. A draw from this distribution is used to select a product phase."
    },
    {
        "id_": "8d846ef3-a62a-4514-b8c7-24feecc77ae6",
        "text": "# Figure 3: Evolution of phases in the simulation according to the evolution rule.\n\nIn the top panel a cell is randomly selected (pale green) from the simulation and its neighbors are identified (teal). Next, if the simulation temperature is above the melting point of the phase in the selected cell, the Melted Phase Swap action occurs (middle-right). If not, reactions between the selected cell and its neighbors are enumerated and a reaction is randomly chosen using the reaction scores as probabilities (middle-left). Finally, each of the reacting cells’ phases are replaced (or not) according to probabilities given by the stoichiometric coefficients of the selected reaction. These probabilities are indicated by the small fractions decorating each arrow in the bottom panel. Note that the CA implemented in this work uses a three-dimensional simulation state, but only two dimensions are shown here for clarity.\n\n9"
    },
    {
        "id_": "2aea1590-3e04-4ca2-a672-99ce38b8e8f4",
        "text": "# 5\n\nThe reacting phase is replaced with the product phase."
    },
    {
        "id_": "598d3531-70d8-491c-a77a-c4983fa4f828",
        "text": "# 6\n\nThe volume of the cell is scaled according to the ratio between the volume of the products and the reactants. Importantly, the process described above utilizes probability distributions over the stoichiometric coefficients of the reaction to maintain conservation of mass within the automaton. For a given reaction, the coefficients of the reactants provide the probability that each will be consumed during a given occurrence of that reaction. This ensures that the reactants are consumed at the correct rate relative to each other. The coefficients on the products of the reaction provide the probability that each one will be produced by a given occurrence of the reaction, similarly ensuring that the products of each reaction are produced at the correct rate relative to each other. Finally, scaling the volume of the simulation cell after its contents have been replaced during a reaction ensures that the correct amount of product phase is produced relative to the amount of reactant consumed by the reaction. A more detailed explanation of this process in conjunction with an example is provided in the Supplementary Information."
    },
    {
        "id_": "944eaa9d-986e-4c98-829e-003c37480b29",
        "text": "# 2.5 Trajectory Construction and Analysis\n\nA simulation run typically entails hundreds of thousands of applications of the evolution rule described above. When the simulation is complete, the results are concatenated into a trajectory that can be analyzed to understand the reaction pathway as a series of steps and discrete intermediate species. Because ReactCA relies on random draws from probability distributions over the possible actions, reactions, and product phases, several simulations are run in parallel, each utilizing a different random starting state. Though the choice of starting state does not affect the qualitative outcome of the simulation, each run is characterized by differing fluctuations, and represents a unique sampling of the distributions in the automaton. As shown in Figures S2 and S3, when a sufficiently large simulation box is used, the standard deviation of the maximum and final mass fractions attained by each phase across a set of parallel trajectories is reduced to less than 1%. To construct the final result, the individual outputs of these parallel simulations are ensemble averaged to yield an overall trajectory."
    },
    {
        "id_": "e989b734-2ac1-42d3-a0e8-a9e1847f1814",
        "text": "# 3 Results and Discussion\n\nTo test the efficacy of ReactCA in describing real solid-state reactions, we apply it to model several case studies selected from the literature where high-quality in situ phase evolution data is available. For each case, we compare the predicted and observed final products of the synthesis reaction as well as the appearance (or disappearance) of intermediate and impurity phases."
    },
    {
        "id_": "71d9959f-967c-4bc5-94c8-58384b8c3363",
        "text": "# 3.1 Product Selectivity in BaTiO3 Recipes\n\nBarium titanate is a well-known multiferroic material with a significant body of synthesis literature. While there are a number of well-known recipes for producing this material, we refer to the recent solid-state reaction selectivity study of Ref. 24, which tested and compared nine different BaTiO3 synthesis recipes characterized over a range of temperatures with synchrotron X-ray diffraction (XRD). A selection of these recipes and the corresponding reactions are simulated here using ReactCA to illustrate the way reaction selectivity is expressed in a phase evolution prediction."
    },
    {
        "id_": "aacb1b60-4e41-451c-a682-b826b52c7566",
        "text": "# Simulation"
    },
    {
        "id_": "258448de-07c4-4973-bc44-34a600d58759",
        "text": "# Experiment\n\n|Recipe|BaCO3|TiO2|\n|---|---|---|\n|Recipe I: BaCO3 TiO2|0.8|1200|\n| |0.6|1000|\n| |0.4|800|\n| | |600|\n| | |400|\n|Recipe II: Ba2TiO4| |1200|\n| |0.8| |\n| |0.6|1000|\n| |0.4|800|\n| |0.2|600|\n|Recipe III: BaCl2 Na2TiO3| |900|\n| |0.8|800|\n| |0.6|700|\n| |NaCl|600|\n| |Na TiO|500|\n| |BaTiO|400|"
    },
    {
        "id_": "3d7770ae-6215-45ae-ab01-d6d203fbb2fc",
        "text": "# Reaction Coordinate\n\nFigure 4: Simulated (left) and experimental (right) reaction evolution plots for the selected BaTiO3 recipes. In each of these plots, the x-axis corresponds to the reaction coordinate, and the y-axis corresponds to mass fraction. The background of each plot is colored according to the amount of precursor (grey), impurity/intermediate (pink), and target/byproduct (light green) over the course of each simulation or experiment. Each of the traces represents the amount of each phase during the reaction. Traces marked with circles correspond to precursor phases, those marked with crosses correspond to intermediate or impurity phases, and those marked with diamonds correspond to BaTiO3, the expected target product phase. The dashed red lines show the heating profile used for each simulation or experiment.\n\nSelectivity was assessed in previous work according to two metrics: primary competition, which quantifies the likelihood of impurities forming from reaction of precursors, and secondary competition, which quantifies the likelihood of subsequent reactions consuming the desired products after they form. In the case of both of these metrics, a lower value corresponds to a more selective reaction, that is, one that is more likely to form only the desired product phase. To illustrate the way that selectivity presents itself in ReactCA simulations, three recipes were selected: the conventional recipe (Recipe I - BaCO3 and TiO2), a recipe with improved selectivity but a lower overall driving force (Recipe II - Ba2TiO4 and TiO2), and a metathesis reaction with excellent selectivity (Recipe III - BaCl2 and Na2TiO3).\n\nRecipe I. The simulation results for Recipe I are shown in Figure 4a and the corresponding experimental outcome is shown in Figure 4b. This reaction received a low primary competition score."
    },
    {
        "id_": "cdd1c11f-c34f-4760-b815-4905641fac4f",
        "text": "# Results and Discussion\n\nbut a perfect (zero) secondary competition score, suggesting that there were competing phases that could form from the original precursors but that if the desired products were formed, they would be unlikely to be consumed by any secondary reactions. In the corresponding experiment from Ref. 24, the BaTi2O5 phase formed as an impurity in conjunction with the product, BaTiO3, at around 1100 K. The result of the reaction automaton simulation for this recipe, shown in Figure 4a, predicts the formation of the target phase BaTiO3 as well as the BaTi2O5 impurity phase at the same onset temperature (1100 K). However, it also predicts the appearance of two additional phases (Ba2TiO4 and BaTi4O9). The three impurities grow at a similar rate to the desired product, BaTiO3, an effect also seen in the experiment. This result illustrates the way that secondary competition appears in a reaction: competing phases form during the reaction of the precursor materials, but once the desired product, BaTiO3, is formed, it is not consumed by any subsequent reaction."
    },
    {
        "id_": "b6b527a7-9629-4bbb-8174-374845f7641c",
        "text": "# Recipe II\n\nThe second reaction chosen here was shown 24 to improve the selectivity of the first at the cost of lowering the driving force of the reaction by choosing compositional members toward the interior of the complex hull as precursors. The ReactCA simulation (shown in Figure 4c) predicts a majority BaTiO3 formation, and the formation of the impurity BaTi2O5. In the corresponding experiment (shown in Figure 4d), BaTi4O9 is observed as an impurity but the simulated BaTiO5 is notably absent. This will be discussed below."
    },
    {
        "id_": "3286b896-4967-4812-b72b-7626f4adb22c",
        "text": "# Recipe III\n\nThe final BaTiO3 reaction selected for simulation is a metathesis reaction using NaTiO3 as the Ti source and BaCl2 for the Ba source. In the original work, this reaction was selected for its strong exergonicity, and its strong selectivity scores. The high selectivity of this reaction is on display in the ReactCA prediction, and the prediction (shown in Figure 4e) is in good agreement with the experimental results (Figure 4f) – the dominant products are the intended metathesis products: BaTiO3 and NaCl. The main discrepancy between the prediction and the experiment is that the automaton predicts no other Ba-Ti-O phase formation, while the experiment indicates appearance of BaTi2O5, though it is only a trace amount.\n\nAcross these three reactions, the selectivity differences between the recipes are apparent in the results from the CA simulations. The size of the green regions in Figure 4 show the overall trend from low selectivity (in the case of Recipe I), to increased selectivity (in the case of Recipe II) and finally to perfect selectivity (in the case of Recipe III). We also note a tendency for ReactCA to predict the appearance of unobserved impurity phases (particularly in the case of Recipe I, shown in Figure 4a). This is a result of the evolution rule which samples reactions based on their calculated rates. The effect is especially strong for the Ba-Ti-O chemical system which contains many phases with similar energetics and which have similar melting points (the two features which are used in ReactCA to calculate reaction rates). Finally, in the reactions shown here, we also highlight a tendency of the automaton to overpredict accumulation of Ba-rich Ba-Ti-O ternary phases. For example, in the Recipe I simulation the most prevalent byproduct is Ba2TiO4 (Ba-rich), but in the corresponding experiment it is BaTi2O5 (Ba-poor). In the Recipe II simulation BaTiO5 (Ba-rich) is the primary impurity, but in the experiment only BaTi4O9 (Ba-poor) appears.\n\nFinally, in Recipe III, the simulation predicts the formation of pure BaTiO3 (Ba-rich) while in the experiment, small quantities of BaTi5 (Ba-poor) were also observed. In light of this observation, we hypothesize that - given the similar energetics of these compounds - the preferential formation of Ba-deficient compounds in experiments may be related to kinetics of the ionic species across the reaction interface. This discrepancy between simulation and experiment motivates future work to develop new reaction rate estimators using system-specific kinetic models, perhaps in conjunction with yet-unrealized high-throughput databases of kinetic calculations.\n\n12"
    },
    {
        "id_": "dd04427c-995f-4325-a697-fe7af375e45e",
        "text": "# 3.2 Intermediate Identification in CaZrN2 Synthesis\n\nTernary nitride systems provide a wealth of materials discovery and synthesis opportunities. Recently, Rom et al. identified metathesis synthesis pathways that allowed them to produce the novel ternary nitrides CaZrN2 and CaHfN246. Using in situ XRD analysis, they constructed trajectories for each phase present during their synthesis reaction which used precursors Ca3N2 and ZrCl4 to yield CaZrN2. This trajectory is reproduced in Figure 5a. We performed a simulation for this reaction using a simulation box with side length of 15 cells, a heating profile consisting of a ramp phase from room temperature to 1400K, and an N2 reaction atmosphere. The resulting phase trajectories are shown alongside the experimental results from Ref. 46 in Figure 5b. We note that in panel a) of this figure, the phase prevalence trace for Ca4Cl6O is excluded. This phase appeared in the experiment due possibly to either impure precursor material or reaction with the quartz ampule46, two effects which certainly represent practical synthesis considerations but are not relevant to the ideal environment represented by the automaton.\n\n|Experiment - CaxNy|ZrCl4|\n|---|---|\n|Ca4Cl6O| |\n|CaN2| |\n|CaZrN2| |\n\nFigure 5: Resulting phase trajectories from simulation and experiment for CaZrN2 synthesis. The experimental phase trajectories for the reaction using a) Ca3N2 and ZrCl4 as precursors and b) the simulated phase trajectories for the reaction using CaN2 and ZrCl4 as precursors. In a) the steep drop-offs of CaCl2 and ZrCl4 are caused by their melting and sublimating, respectively.\n\nThis simulation successfully captures the reaction pathway present in the experiment. The first intermediate phase to reach its peak in the simulation is ZrCl3, which agrees with the early reduction of ZrCl4 to ZrCl3 in the experiment. The two intermediates which then follow in the experiment (a small amount of Zr6NCl15 and significant Ca2NCl) are also present in the simulation with the same relative prevalences. Finally, the simulation predicts the major product (CaZrN2) and byproduct (CaCl2) with confidence, though some unreacted Ca2NCl also remains. In addition to this pathway, the simulation predicts the appearance of two phases which are not observed in the experiments, ZrNCl and ZrN. In the following analysis we discuss the mechanisms by which these phases appear in the simulation and explain why those mechanisms may not have been."
    },
    {
        "id_": "83ccf309-f685-49dd-9bca-ead147ce22be",
        "text": "# Active During the Experiment\n\nZrNCl appears in the simulation at roughly the same stage in the temperature trajectory as Ca2NCl and the three reactions which facilitated the bulk of its formation are shown in Table 1. The most frequent of these reactions, Reaction (1), may have incorrectly occurred in the simulation because ReactCA, in its current form, does not include sublimation. Reaction (1) consumes Ca2NCl, which only forms in the experiment (Figure 5a) when the temperature has reached 600K and ZrCl4, the other reactant, has sublimated. As a result, the two reactants may never have been sufficiently available to one another for this reaction to occur in the experiment. In contrast, since ReactCA has no method for estimating sublimation temperatures, ZrCl4 remains available when Ca2NCl appears, allowing Reaction (1) to proceed. This hypothesis is supported by another experiment by Rom et al. in which Ca2NCl and ZrCl4 were reacted directly as the initial solid precursors. In that experiment, both phases are present as solids and ZrNCl appears as a prominent intermediate46, suggesting that Reaction (1) does occur if both precursors are present.\n\n|Reaction| | |Score (600K)|! ” rxn|eV|Occurrences|\n|---|---|---|---|---|---|---|\n|(1) Ca2NCl + ZrCl4 ↑↑↓ 2 CaCl2 + ZrNCl| | |0.165|-0.562|6683| |\n|(2) 2Ca3N2 + ZrCl4 ↑↑↓ ZrNCl + 3 Ca2NCl| | |0.165|-0.636|5103| |\n|(3) Ca3N2 + 2 ZrCl4 ↑↑↓ 3 CaCl2 + 2 ZrNCl| | |0.165|-0.788|4533| |\n\nTable 1: The most frequently occurring ZrNCl-forming reactions in the automaton simulation shown in Figure 5b. We use the notation !” rxn as opposed to !G rxn to indicate that the relevant thermodynamic potential in this system is a grand potential with N2 as the open species.\n\nReactions (2) and (3) in Table 1 consume the same precursors: Ca3N2 and ZrCl4. In the experiment however, Rom et al. propose that these phases instead react according to the following reaction:\n\nCa3N2 + 6 ZrCl4 ↑↑↓ 6 ZrCl3 + N2 + 3 CaCl2\n\nS = 0.165, !” rxn = ↑0.194 atom (T = 600K)eV\n\nThis reaction and the three reactions in Table 1 are all assigned the same score because they are highly exergonic (the thermodynamic component of the score function is maximized for all of them) and they share a lowest melting point precursor, ZrCl4 (so the melting point component of the score takes on the same value for all of them). Consequently, ReactCA does not differentiate the rates of these reactions, and they all occur with similar frequencies during the simulation. It is surprising that evidence for neither Reaction (2) nor Reaction (3) appears in the experiment, given their energetics (they are even more exergonic than the reaction proposed by Rom et al.) but there may be important differences in the kinetic accessibility of their product phases. In particular, the formation of the two binaries, ZrCl3 and CaCl2, (along with the release of gaseous N2) from these two compositionally dissimilar precursors may be more kinetically facile than the formation of the nitrogen-containing ternary phases ZrNCl and Ca2NCl. In support of this hypothesis, we note that Rom et al. observe the formation of a small amount of Zr6NCl15 (Figure 5a), which could be interpreted as an incomplete incorporation of nitrogen while transforming of ZrCl3 into ZrNCl. Additionally while CaNCl does appear in the experiment, Rom et al. suggest that its formation2 is facilitated by the reaction of more compositionally similar binaries, CaCl2 and Ca3N2 (which is precisely how it is formed in the simulation). When ZrNCl does form, it is in the second experiment performed by Rom et al. (reacting CaNCl with ZrCl4)."
    },
    {
        "id_": "62b88ad0-d81b-48cb-898e-af11f4140e7e",
        "text": "# 3.3 Recovery of Observed Reaction Pathways in YMnO3 Synthesis\n\nThe multiferroic YMnO3 has been the recent focus of a number of synthesis investigations into the effect of precursor selection, reaction atmosphere, and reaction temperature on both reaction pathways and also on the identity of the dominant product8;28;47. In the first of these studies, Todd et al. propose reaction pathways at work during the formation of YMnO3 in a flux-assisted metathesis reaction and explain the lower reaction temperature required by their recipe in terms of the interplay between these pathways8. Building on this work, McDermott et al. were able to confirm using a reaction network that the suggested pathways were thermodynamically predicted by data within the Materials Project28. We use this example here to illustrate the ability of ReactCA to predict temperature-dependent reaction pathways and intermediate and product mass fractions and to provide insight into the interactions between simultaneously occurring pathways.\n\nThe simulation for this reaction was configured to use a simulation box with a side length of 15 cells and a heating profile consisting of a ramp phase to 1300K followed by a hold phase at 1300K. We note that the peak temperature used here is slightly higher than the experimental maximum temperature of 1100K. This choice was made in order to accommodate uncertainty in the melting point and vibrational entropy estimates. A view of the resulting trajectory for this simulation is shown in Figure 6a and a longer trajectory which includes the stabilization of the product phases is available in Supplementary Figure S4. The overall result shown here predicts YMnO3 as the dominant product phase and a number of intermediate phases, including YOCl, Mn8Cl3O10, YMn2O5, and Mn3O4. In Figure 6b, a magnified view of the bottom of the trajectory is shown for those phases which never formed greater than 2.5% of the overall mass content in the simulation box. The multitude of phases present in this result illustrate the way that the reaction automaton samples many possible reaction pathways that can be traced from the initial precursor set.\n\nAmidst the complexity shown in Figure 6, the reaction pathways identified by Todd et al. are remarkably well predicted by the ReactCA simulation. From XRD refinements, Todd et al. calculated the trajectory of each intermediate phase, and plotted them in groups according to cation. We reproduce these plots for the experimental data alongside similar plots generated from"
    },
    {
        "id_": "2a53d765-0766-4d4f-8833-92a9a2384209",
        "text": "# Figure 6: Resulting trajectory from simulation of the Li2 CO3 -YCl3 -Mn2 O3 reaction.\n\n|a)|0.6|YCla|1200|\n|---|---|---|---|\n| |0.5|YMnO3|1000|\n|J|0.4| | |\n| |0.3|YOCI|800|\n| |0.2|MnzC|Licl|\n| |3|Mnsc Cl3|600|\n| |Lizo|Mn; 04 YzO3| |\n| |0.1|YMnz|400|\n|b)|0.025|LiMno|'304CI|\n| |0.02| |LiYoz|\n| |0.015| |Mno|\n| |0.01|2Mnzc| |\n| |0.005|Li,Mno_| |\n\nthe simulation data in Figure 7. Every intermediate phase identified by Todd et al. is predicted by the reaction automaton. The relative amounts of these phases as well as the order of their appearance are also predicted with good accuracy, though Y O4 Cl appears in only trace quantities3 in the simulation. However, we note that previous work highlights the high degree to which both Y3O4Cl and YOCl accommodate defects and disorder48. Indeed, in another study Todd et al. assert that the transformation between these phases proceeds through an off-stoichiometric YO1+ωCl1-ω phase48. Because our input data is limited to only the ordered, perfectly crystalline phases present in the Materials Project we do not include the effects of defects and disorder. As a result, we neglect the likely significant contribution of configurational entropy to the stability of these phases. This omission may explain the underestimation of YO4Cl in this simulation result.3\n\nIn addition to prediction of reaction intermediates, the ReactCA trajectory contains information about the specific reactions which yielded each phase. Of particular interest here is the formation mechanism for the product phase, YMnO3. Todd et al. propose dual mechanisms for the formation of this phase - first, the faster, lower temperature ternary metathesis reaction between\n\n16"
    },
    {
        "id_": "db91c7fe-abd8-49da-91a4-b5a41b9a4d0c",
        "text": "# Experiment\n\n| |LizCO3|Licl|\n|---|---|---|\n|L|Mn|YMnO3|\n|2|Mn;C 0|2|\n| |Mn;C 04| |\n| |YCI;|YCI;|\n| |YOCI|YMnO3|\n| | |Yzo_|"
    },
    {
        "id_": "c68ec3cb-e587-4b57-a038-b33144bd0917",
        "text": "# Simulation\n\n| |Liz CO3|Licl|\n|---|---|---|\n|1|Mnz|YMnO3|\n|2| |Mn;C 04|\n| |YOCI| |\n| |YMnO3| |\n| |Yzo| |"
    },
    {
        "id_": "f4507078-6adc-470b-a16c-303b79cd9bc9",
        "text": "# Figure 7:\n\nReaction pathways extracted from both a) the experimental synthesis results from Todd et al.8 and b) the simulation trajectory of the reaction between Li2CO3, YCl3 and Mn2O3. The top panels illustrate the early emergence and subsequent plateau of LiCl, the middle panels capture the emergence and then recession of the reduced MnO4 phase and the bottom panel shows the ordering and relative prevalence of the three key Y-O-Cl intermediates. Note that LiCl disappears from the experimental phase trajectory in a) (which was generated using XRD data) only because it melts.\n\nLiMnO2 and YOCl, and second, the higher temperature reaction between Mn2O3 and Y2O3 (the latter of which is formed in part by consumption of YOCl). Within the ReactCA trajectory, we identify two major classes of reactions that align with these two proposed reaction pathways. The first of these classes (Class I) is the reaction of LiMnO2 with one of a number of yttrium-containing intermediates (the most frequently occurring of which is YOCl, followed by YCl). These reactions correspond to the low temperature, ternary metathesis step. The second of the two classes of reactions (Class II) producing YMnO3 are reactions between the refractory Y2O3 and either Mn2O3 and Mn3O4. That reactions in the first class occur with any substantial frequency in this simulation is a surprising finding because the total amount of LiMnO2 never exceeds 3% by mass, suggesting that the phase is consumed at nearly a rate nearly equal to that at which it is produced. This may be a reasonable prediction, however, because the failure of this phase to accumulate in our simulation agrees strongly with the experiment performed by Todd et al, in which LiMnO2 appears in only trace quantities (its XRD pattern is poorly resolved from MnO4 which implies that the data in Figure 7a suggests the appearance of only small quantities of both Mn3O4 and LiMnO2 in the experiment)."
    },
    {
        "id_": "20602c31-5814-4b45-ab17-1b2f69079246",
        "text": "# LiMnO2 and Y2O3 reactions (Class II)"
    },
    {
        "id_": "c1065172-6fa8-4996-8ee7-600fca7a4d75",
        "text": "# Reaction Coordinate\n\n|Counts|Class I (LiMnO2 intermediate)|Class II (Y2O3 reactions)|\n|---|---|---|\n|1200|800|1000|\n|600|400|200|\n\nFigure 8: Histogram illustrating the dominance of different classes of YMnO3-forming reactions over the course of the simulation. The counts shown in red correspond to reactions which involve the LiMnO2 intermediate (the ternary metathesis route, i.e. Class I), and the counts in blue show reactions between the refractory Y2O3 and phases in the Mn-O chemical system (i.e. Class II).\n\nBy counting the frequency of each of these classes of reactions as a function of the reaction coordinate, we illustrate in Figure 8 that the first ternary metathesis reaction class dominates early in the simulation at lower temperatures, and that the second reaction class which consumes the refractory Y2O3 occurs later in the simulation at higher temperatures. This result reflects the mechanism that Todd et al. proposed based on their experimental observations - ternary metathesis dominates at lower temperatures, and Y2O3 reactions proceed at higher temperatures, and indeed both mechanisms contribute to the formation of YMnO3.\n\nWe emphasize that the analysis presented here represents an important increase in capability over the previous reaction network approach. In particular, the reaction network requires a set of expected product phases as input while ReactCA predicts the product without any prior target input. Additionally, the reaction network identified isolated pathways of a finite length at a single temperature at a time. In contrast, ReactCA can explore pathways of unlimited length (and allow them to interact) over a range of temperatures in a single simulation. These improvements both simplify the analytic process and broaden the range of reaction behavior that can be predicted compared to the reaction network.\n\nIn addition to the reaction intermediates identified by Todd et al., the ReactCA simulation predicts a number of other unobserved intermediates, most of which appear in the simulation at only trace levels (less than 1-2% by mass, as shown in Figure 6b). These unobserved intermediates reveal the alternate pathways which are present in the trajectory as a result of the automaton sampling many available reactions during its evolution."
    },
    {
        "id_": "74d73a09-b0fa-40cf-a098-09e1e14dd7aa",
        "text": "# Investigating even low-prevalence intermediates, such as LiMnO2, can yield insights into overall reaction pathways, the prevalence of a given intermediate in a ReactCA simulation generally reflects the relative amount predicted to appear during the synthesis reaction. In other words, while we do show that LiMnO2 plays a role in the reaction that aligns well with the experimental hypothesis, its low prevalence suggests that it may not accumulate in significant quantities during the reaction. Similarly, because these other low-prevalence phases appear in only trace quantities, the ReactCA simulation should be interpreted as assigning low likelihood to the appearance of those phases in experimental characterization.\n\nBesides these low-prevalence unobserved impurities, two others (YMn2O5 and Mn8Cl3O10) achieve significant amounts comparable to the predictions for the observed intermediates (&gt;10% by mass). The first of these phases, YMnO5, does not appear in the experiment originally presented by Todd et al., but is recognized in a later work by the same authors as a common impurity in the synthesis of YMnO3 by this metathesis method47. The second of these phases, Mn8Cl3O10, was recently synthesized by the solid-state method from precursors MnCl2 and MnO2 at 600°C, hence its appearance is not implausible in this reaction.\n\nHowever, by examining the reactions which consume Mn8Cl3O10 during the ReactCA simulation, we find that its primary role is as an intermediate between reactants YCl3 and Mn2O3 (which react to form it), and experimentally verified downstream intermediates (most significantly, LiMnO2, Mn3O4, and LiCl). As a result, we hypothesize that MnCl3O10 functions similarly to ZrN in our discussion of the CaZrN2 synthesis8 above. That is, MnCl3O10 may be the best representation the simulation can provide of a process which is actually facilitated by highly defective or amorphous intermediates with a similar Mn-Cl-O composition that are not present among the ordered, crystalline, stoichiometrically exact phases on the Materials Project. This uncertainty further emphasizes the necessity of future work to improve the ability of the automaton to navigate more sophisticated intermediate landscapes."
    },
    {
        "id_": "dcfc03a5-3ef7-44db-9d5f-aab893a35277",
        "text": "# 4 Conclusions\n\nWe present ReactCA, a new simulation framework based on the cellular automaton formalism for predicting the evolution of crystalline phases during the course of a solid-state reaction. This simulation utilizes thermodynamic data from the Materials Project and machine learning estimated melting points in conjunction with a cost function to assign reaction rates as a function of temperature. The evolution of the reacting material is determined by a rule based on the pairwise interface reaction model that considers reactions between neighboring particles. The flexibility of the form of both the cost function and the evolution rule lend great extensibility, meaning that as new data become available from as of yet unrealized high-throughput methods or machine learning frameworks, both empirical rules and heuristics based on those data can be incorporated into ReactCA to improve its performance.\n\nWe illustrate the current performance of the simulation framework using three case study systems, the first of which serves as a platform for viewing the relative selectivity of various reaction recipes and the importance of precursor choice with regard to product purity, and the second and third of which demonstrate power of ReactCA in predicting likely reaction pathways, the temperature dependence of those pathways, and the order and amounts of intermediate phases which appear during the course of complex ternary metathesis reactions.\n\nWhile we believe that ReactCA is of immediate utility in both “testing” reaction recipes before utilizing physical or monetary resources to experimentally execute them, we also foresee the simulation being used to determine recipe parameters using an optimization framework or to facilitate the autonomous design of synthesis recipes by acting as a digital twin for experimental."
    },
    {
        "id_": "67fec15e-e14a-42cf-a71f-ed66153a8663",
        "text": "# 5 Methods"
    },
    {
        "id_": "1185fc0f-6772-43ec-bf1f-5ce2b73b19eb",
        "text": "# 5.1 Thermochemistry Data\n\nTo prepare data for the simulation of the BaTiO3, CaZrN2 and YMnO3 recipes, entries from the Materials Project from the Ba-Ti-O-C, Ba-Ti-O-Na-S, Ba-Ti-O-Na-Cl, Ca-Zr-N-Cl, and Y-Mn-Cl-Li-C-O chemical systems were collected. Additionally, a density functional theory structure relaxation calculation was performed at the GGA level of theory using parameters from the MPRelaxSet in atomate2 to obtain a formation enthalpy for Y3O4Cl, a phase known to appear during the synthesis of YMnO3, but not present within the Materials Project. For each entry in these chemical systems, the machine learning descriptor by Bartel et al. was used to estimate the vibrational entropy contribution to the Gibbs energy of formation at 300K.\n\nPhases with formation energies greater than 30 meV/atom above the hull were removed at this temperature. This value for a metastability cutoff filter was chosen based in part on the work of Sun et al., which present statistics on the metastability of compounds in the Materials Project and connects them to synthesizability. We also removed compounds which were marked as “theoretical” on the Materials Project unless they appeared explicitly in the experimental results. In addition, several phases which have previously only been successfully produced using synthesis methods other than the solid-state method considered here were excluded. These are ZrCl (synthesized using high pressure methods), ZrCl2 (synthesized via hydrogen disproportionation reactions), CaN2 (synthesized using high pressure methods), CaN6 (synthesized in solution), Ca2N (synthesized via metallothermic reduction), and Zr3N4 (synthesized via high pressure methods or ammonolysis).\n\nData from the Materials Project was collected using the mp-api package and the possible reactions in each of these systems were enumerated using the reaction-network Python package. The CA model was implemented using the pylattica Python package."
    }
]