[
    {
        "id_": "3a5f1b07-3586-43ea-af2c-f0db45a83e54",
        "text": "# 1. INTRODUCTION\n\nIn human brains, sodium ions (Na+), when exposed to an electric field gradient of negatively charged macromolecules and proteins, experience nuclear quadrupolar interaction that results in bi-exponential decay in transverse (T2) relaxation of nuclear spins when the ions are not in fast motion, a situation in which correlation time between sodium ions and electric field gradient is much shorter than the inverse of Larmor frequency, τc &lt;&lt; 1/ω01,2. Sodium ions in fast motion cancel out the effect of quadrupolar interactions, resulting in mono-exponential T2 decay1-4. Sodium ions in bi-exponential T2 decay were historically, but incorrectly, considered as invisible “bound” (chemically) sodium5,6 because their short-T2 components were not detectable by then-NMR (nuclear magnetic resonance) techniques1-4. The terminology however remains in use in today’s sodium MRI, although concerns have been raised recently by some researchers, with no better substitutes yet7. For convenience, this article refers “bound” (not chemically) sodium to those showing bi-exponential T2 decay and “free” sodium to those showing mono-exponential T2 decay.\n\nThe free and bound sodium ions can appear in both intra- and extra-cellular spaces8-10 depending on their relative correlation time with electric field gradient1,2.\n\nSodium (23Na) MRI currently acquires signals from both free and bound sodium ions, and quantifies total sodium concentration (TSC) at voxels of an image. TSC is a unique measure for non-invasive assessment of disruption in ionic homeostasis of cells in, or recovery from, pathological conditions such as stroke, tumor, multiple scleroses, epilepsy, bipolar disorder, and mild traumatic brain injury8-12. However, TSC is dominated by free sodium from cerebrospinal fluid (CSF) which has a high sodium concentration (~145 mM) and overshadows alteration in intracellular sodium which has a much lower concentration (~15 mM). Separation of mono- and bi-T2 sodium signals can remove CSF impact and highlight intracellular alterations, especially at early stage of a disease happening at cellular level or in early (cellular) response to a treatment.\n\nThe difference in T2 relaxation was extensively explored in sodium MRI as a means to separate the two populations of sodium in the brain. Triple quantum filtering (TQF) was considered a standard for human studies, in which MR signals were generated solely from triple-quantum (TQ) transitions13. TQF techniques, however, require multiple radiofrequency (RF) pulses for excitation and multi-step phase cycling to eliminate single-quantum (SQ) signals13-17, leading to long scan time (20–40 min) and high specific absorption rate (SAR, causing a safety concern)."
    },
    {
        "id_": "e5f02b7f-b76d-411c-a14e-d890719746b6",
        "text": "More problematic is that TQF has much low signal-to-noise ratio (SNR) about 10 times lower than SQ.15-17 These difficulties hamper TQF to be widely used on humans.\n\nAlternative approaches were proposed. Inversion recovery (IR), adopted from proton (1H) MRI, exploits a difference in T1 relaxation between the mono- and bi-T2 sodium ions, and suppresses signals from the mono-T2 sodium of longer T1 time.18-20 The IR approach needs an extra RF pulse for the suppression and worsens SAR issue, not favorable to human studies. It also suffers from incomplete suppression of the mono-T2 sodium signals which are ~10 times higher than the bi-T2 sodium signals, due to spatial inhomogeneity of B1+ field although adiabatic pulses are usually used, and complicates quantification of the bi-T2 sodium owing to unknown residual mono-T2 sodium signals.9,11,18 To overcome these drawbacks, another alternative approach, called short-T2 imaging, was proposed in which SQ images were acquired at multiple echo times (TEs) and then subtracted from each other to produce an image of the short-T2 component of bi-T2 sodium.21-24 In such a way, SAR was reduced to, and SNR was increased to, the level of SQ images, favorable to human studies in clinic. Unfortunately, the subtraction could not completely eliminate mono-T2 sodium signal (~20% in residual), degrading accuracy of bi-T2 sodium quantification.24\n\nIn this study, the short-T2 imaging is generalized to multi-TE single-quantum (MSQ) imaging to improve accuracy of the separation between mono- and bi-T2 sodium signals, by replacing the subtraction with a matrix inversion. To develop MSQ technique, we optimized the TEs for data acquisition, investigated impact of T2 values on accuracy of the separation, and acquired the free induction decay (FID) signals to generate T2* spectrum for the matrix equation. To test MSQ technique, we implemented numerical simulations, phantom studies, and human studies. The results were supportive of the proposed MSQ technique. We also itemized limitations of MSQ technique and potential pitfalls in interpretation of separated sodium signals."
    },
    {
        "id_": "637dcd42-290b-4b0e-b05a-bd8c9c408c1e",
        "text": "# 2. THEORY"
    },
    {
        "id_": "28ee43c2-7e40-4521-91ec-50f1caa96060",
        "text": "# 2.1. Model of sodium signals\n\nA two-population model is used to describe single-quantum sodium signal m(t) evolving with time t at an imaging voxel ∆V.\n\nm(t) = m1 'S1 (t) + m2 'S2 (t), &nbsp; t ≥ 0 &nbsp; &nbsp; &nbsp; Eq. [1a]\n\nm1 ≥ 0, m2 ≥ 0, and m1 + m2 = m(0)"
    },
    {
        "id_": "3c26f890-f4a9-4b93-bc79-52cad087e9a4",
        "text": "# 2.2. xeyavation of tze mono- and wi-T2 sodium signals\n\nGiven SQ sodium images at {TE1, TE2, …, TEN}, Eq. 1a becomes a matrix equation Eq. 2.\n\n|6|7|\n|---|---|\n|6 ≡ (!), !%, …, !*)+|! = !(0;), < = 1,2, … , ?|\n|8 ≡ (!!\", !#$)+| |\n|'!\"(0;))|'#$ (0;))|\n|7 ≡ ⎛'!\" (0;%)|'$(0;%)⎞|\n|⎜ ⋮|⋮ ⎟|\n|⎝'!\"(0;*)|'#$ (0;*)⎠|\n\nSuperscript T is operator for matrix transpose. A solution to Eq. 2 is given by Eq. 3 via an established algorithm called non-negative least-squares (NNLS)25 in which non-negative condition on X is incorporated into the solution.\n\n8 = ??=H(78 − 6)                                                            Eq. [3]"
    },
    {
        "id_": "e3383e7c-40c4-4b36-b5f2-6e8a1f9d27d8",
        "text": "# 2.3. Measuvement of T2 salues fov tze mono- and wi-T2 sodium yoyulations\n\nThe T2 values (T2,fr, T2,bs, T2,bl) in Eqs. 1b and 1c are required to perform the separation. They can be measured by acquiring FID signal s(t) on whole imaging volume and using effective T2 (i.e., T*) decay model of multi-exponential components to fit the FID signal in magnitude, i.e.,\n\n|J(#)| = ∑ -L- exp (−#/0%∗ ,-)                                                 Eq. [4]\n\nHereinafter, T2* replaces T2 as spin echo is not favorable to sodium MRI. The curve-fitting is accomplished also through the NNLS algorithm 25 when T* values are pre-distributed in a range."
    },
    {
        "id_": "191c2e17-a9b7-4bb3-85bc-4dd2ca249f7b",
        "text": "# 2.4. Impact of T2* values on the mono- and bi-T2 sodium evaluation\n\nIdeally, T2* values are measured at individual voxels. Practically, the measurement is time consuming and not favorable in clinical studies. A fast estimate is necessary. Intuitively, solutions to Eq. 1 are not very sensitive to T2* values due to exponential decays in Eqs. 1b and 1c. This observation can be verified theoretically and numerically. Theoretically, small changes in T2* values, {P0%2*, 0, u=fv, ws, wl}, lead to small changes {P!1, y=fv, wd} in !!\" and !#$ under the same m(t), that is,\n\n0 = P(!!\"'!\") + P(!#$'#$)\nEq. [5a]\n\n−!2 = '!\"P!!\" + '#$P!#$\nEq. [5b]\n\n!2 ≡ !!\"P'!\" + !#$P'#$\nEq. [5c]"
    },
    {
        "id_": "2c2a5cc8-4b84-4db3-bf1c-29a45f281a62",
        "text": "# Amplitudes\n\n{L-}, called T2* spectrum, determine relative incidence of T2* components in the imaging volume which counts all T* components from both mono- and bi-T2 sodium populations. To pair up the short- and long-T* components of the bi-T2 sodium, the 60-40 split in intensity is a helpful guidance.\n\nAlternatively, empirical estimates of the brain tissues may be applicable to T2* values, because solutions to Eq. 2 are not so sensitive to T2* values due to exponential decay (see Sections 2.4 and 4.2 for details).\n\nFID signals, when acquired with an array coil, may have unique initial phases {O/,(, l=1, 2, …, Nc} at individual elements, and need to be aligned to produce a resultant FID signal. Alignment (via phase correction) can be towards a reference phase such as zero phase, one of the initial phases, or mean phase across elements. In addition, signal intensity at individual elements needs to be scaled via “FFT factor” which is stored in the header of a raw FID data file.\n\nFID signals at the first few samples are distorted by hardware filtering during analog-to-digital conversion (ADC). The number of affected samples are in a range of 3–10 points, depending on sampling bandwidth, with the first sample having the largest distortion. This distortion alters measurement of T* components, especially the short T2* components which are critically important to the bi-T2 sodium. Correction for the distortion can be performed using an established exponential extrapolation (see Appendix A for details)."
    },
    {
        "id_": "0ea77a8a-e85a-46cf-b2de-905cba9e1e58",
        "text": "# 2.5. Oytimalization of tze numwev of TEs\n\nIn principle, the more TEs the better differentiation between the T* relaxations of the mono- and bi-T2 sodium populations, and the better solutions to Eq. 2. In practice, the number of TEs is restricted by total scan time (TA), SNR, signal decay, and risk of motion artifacts across TEs. Therefore, a trade-off must be made for the number of TEs. To determine an optimal number of TEs, it is necessary to understand noise propagation in Eq. 2. Let singular value decomposition (SVD) of the matrix Y in Eq. 2a be\n\n7 = W X Y+\nEq. [6a]\n\nX = diag(^), ^%)\nEq. [6b]\n\n8 = _ X56 W7 6\nEq. [6c]\n\nSingular values (^), ^%) determine noise transfer (amplification or suppression) in Eq. 6c from the measured TE-images M to the separated mono- and bi-T2 sodium images X. However, Eq. 6c allows negative values in X when random noise contaminates M. This violates the “non-negative” condition on X. Therefore, SVD analysis is applicable only to X elements with SNR ≥ 2 where the elements, with Gaussian noise, have 95.4% of chance in the territory of non-negative value."
    },
    {
        "id_": "4d24e791-cdb3-4f48-8f47-0a1450a896a7",
        "text": "# 3. METHODS\n\nThe proposed MSQ technique is graphically illustrated in Fig. 1. The inputs are multiple TE images and an FID signal. The outputs are the mono-T2 (free), bi-T2 (bound), and total sodium images, as well as the map of field inhomogeneity ∆B0 and the map of single-T*. In between are the data."
    },
    {
        "id_": "b43f441a-4251-4232-96af-aa4982e50cd5",
        "text": "# Processing Functionalities for the T* Spectrum\n\nMono- and bi-T2 sodium separation, and mapping of ∆B0 and single-T*.\n\nMotion correction (MoCo) across multi-TE images is optional. Also optional is the low-pass (LP) filtering, which is a 3D averaging over a size of 3×3×3 voxels for instance, to reduce random noise on the bi-T2 sodium. The ∆B0 and single-T* maps present spatial distributions of the B0 field inhomogeneity and the short- and long-T2* components, and provide indications for uncertain short-T* decays possibly caused by the B0 inhomogeneity. These maps are critical and complimentary to quantification and explanation of the separated mono- and bi-T2 sodium signals."
    },
    {
        "id_": "e8277dfc-988f-4a53-857c-cb123d1ef239",
        "text": "# 3.1. Measurement of T* Values\n\nFID signals were acquired on whole brain of the study subjects right before sodium imaging. A product pulse sequence, either AdjXFve embedded in the manual shimming task or independent fid_23Na, was employed with parameters: TE=0.35–1.0ms, TR=100–300ms, and averages =1–128, and TA=0.2–39s. When a dual-tuned (1H-23Na) 8-channel Tx/Rx head array coil was used, there was a difference in initial phase and in FFT scale factors across channels. The initial phases were measured on channel image at central slice, and removed by aligning to zero phase. Channel signals were weighted with FFT scale factors and complex-value combined into a resultant FID. An additional step was performed to correct for distortion at the first few points of the resultant FID signal. Finally, a spectrum of T* values was calculated according to Eq. 4, at a resolution of 0.5ms for T* in 0.5–100ms. Assignment of T* peaks to {T2*fr, T2*bs, T*bl} was based on their relative positions and intensities, i.e., T*fr ≥ T2*bl >> T2*bs and intensity ratio 6:4 for the bi-T2 sodium. Repeatability of the T2* measurement is addressed in the Supporting Information."
    },
    {
        "id_": "69fbd7d3-4541-436c-8021-bc2357c03271",
        "text": "# 3.2. Sensitivity to T* Values\n\n9"
    },
    {
        "id_": "07b647e2-b047-467c-bfc2-70345a69e34e",
        "text": "# 3.3. Optimization of TEs\n\nThe simulations were implemented via Eq. 6 for three cases: an ideal case serving as reference, practical case 1 having a large number of TEs, and practical case 2 having a small number of TEs. The ideal case had 80 TEs, i.e., TE = (0, 1, 2, …, 79) ms, to cover entire range of T2* decays. The two practical cases, suggested by existing human studies24,29-31, had total scan time (TA) limited to 22 min for 8 TE-images, and the TEs were chosen to be most sensitive to T2* decays29. Thus, the case 1 had 8 TEs = (0.5, 1, 2, 3, 4, 5, 7, 10) ms, and the case 2 only had two TEs = (0.5, 5.0) ms but 4 averages at each TE. The SVD singular values (λ1 ≥ λ2 ≥ 0) were calculated for each set of TEs via Eq. 6. The optimal set of TEs would be the one that had λ2 producing the minimum amplification of random noise in the separated mono- and bi-T2 sodium images."
    },
    {
        "id_": "f63af239-980c-416e-a5c6-556fd2da4ee9",
        "text": "# 3.4. Tomyutev Simulations\n\nThe mono- and bi-T2 sodium separation was carried out via Eq. 3 at a typical set of T2* values, (TE0%, TE1, TE2%, TE3) = (50.0, 3.5, 15.0) ms, and an optimal two-TE scheme, TE = (0.5, 5.0) ms. Sodium signals were calculated via Eq. 1, with an additive Gaussian noise, N(0, σ2), at each of noise trials (independent from each other), S(t) + N(t). The mono- and bi-T2 signal amplitudes (A1, A2) were simulated to vary in a normalized range of 0.0–1.0 at a step size = 0.1. The separation was implemented using the function lsunonneg() in MATLAB, and repeated Nnoise times at each of the specific amplitudes. Mean and standard deviation (SD) were reported as separated sodium signal. Nnoise = 1054 was chosen to detect a 10% of SD, or 0.1 effect size d = Δμ/SD, in difference between the mean and true value at 90% power and 5% significant level under the two-sided Student’s t-test27."
    },
    {
        "id_": "954ae0b4-26af-4b0e-b5fd-0a320b92784d",
        "text": "# 3.5. Phantom studies\n\nFour phantoms, custom-built and described in previous work, were studied. They were 50-mL centrifuge tubes filled with a mixture of distilled water, 10% w/w agar powder, and sodium chloride (NaCl) at three concentrations (90, 120, and 150mM) and at 150mM without agar, mimicking bi- and mono-T2 sodium signals in the brain tissues. Sodium MRI was performed on a clinical scanner at 3T (MAGNETOM Trio Tim, Siemens Medical Solutions, Erlangen, Germany) with a dual-tuned (1H-23Na) volume head coil (Advanced Imaging Research, Cleveland, OH). The data acquisition was implemented using an SNR-efficient, three-dimensional (3D) pulse sequence called the twisted projection imaging (TPI), with parameters: rectangular RF pulse duration = 0.8ms, flip angle=80º (limited by SAR and TR), field of view (FOV)=220mm, matrix size=64, nominal resolution=3.44mm (3D isotropic), TPI readout time=36.32ms, total TPI projections =1596, TPI y-factor=0.4, TR=100ms, TE1/TE2=0.5/5ms, averages=4, and TA=10.64min per TE-image. The image reconstruction was offline implemented on a desktop computer (OptiPlex 7050, 8GB memory, Windows 10, DELL, Round Rock, TX) using a custom-developed programs in C++ (MS Visual Studio 2012, Microsoft, Redmond, WA). Separation of the mono- and bi-T2 sodium signals was implemented using a custom-developed program as described above."
    },
    {
        "id_": "ddb3902b-53d7-4a06-8a3c-8b9f4070d02f",
        "text": "# 3.6. Human studies\n\nThe human studies were conducted with the approval of local Institutional Review Board (IRB) at NYU Grossman School of Medicine, New York, NY, USA. The study subjects included nine healthy adults (age 39.6±21.4 years between 21–74 years; 3 males and 6 females) and six patients with diverse neurological disorders (1 bipolar disorder, 3 epilepsy, 1 multiple sclerosis, and 1 mild traumatic brain injury; age 30.5±15.1 years between 18–59 years; 3 males and 3 females), after the exclusion of one subject and one patient due to motion between the two TE-images. The study was performed on a clinical 3T MRI scanner (Prisma, Siemens Healthineers, Erlangen, Germany) with a custom-built 8-channel dual-tuned (1H-23Na) head array coil. The same TPI pulse sequence as in the phantom studies was used for data acquisition. Images were reconstructed using the gridding algorithm, off-line and channel-by-channel, and combined into a resultant image via the sum-of-squares (SOS) algorithm. To decouple random noise across channels, an orthogonal linear transform (detailed in Ref. 30) was performed in which physical channel data."
    },
    {
        "id_": "c7fa2485-5066-4da8-a59a-a869811ca921",
        "text": "# 3.7. Mayying of ∆B0 and single-T2*\n\nTo map ∆B0 (or ∆f0 = a∆B/2b), Hermitian product method was performed via Eq. 7 at individual imaging voxels to calculate phase differences {(O,, < = 1, 2, 𝑓𝑓 𝑓𝑓 𝑓𝑓 , ? − 1} between TEs {0;, < =, 1, 2, 𝑓𝑓 𝑓𝑓 𝑓𝑓 , ?}. Image amplitude at individual channels were corrected with the FFT factors {e, f = 1, 2, 𝑓𝑓 𝑓𝑓 𝑓𝑓 , ?8}. Phase unwrapping was not performed due to small intervals in the TEs and, in general, small inhomogeneity in the B0 field in sodium MRI. Computation for ∆B0 map is fast (0.078s) on a Mac laptop computer for images of size 64×64×64 at two TEs.\n\n(g/ = %9(*5)) ∑ ,<)) *5)Δ\", ⁄Δ#$, Eq. [7a]\n\n(O, = iℎ1JT{∑*8) e(% ∙ !(∗(0;) ∙ !((0;,=))} (< , Eq. [7b]\n\n(0;, = 0;,=) − 0;, Eq. [7c]\n\nTo map single-T*, a MATLAB curve-fitting function fit(x, y, ‘exy1’) was used to calculate single-T* values at each voxel via Eq. 8. A restriction (T*max<100ms) was enforced to exclude unreasonable values caused by noise. The computation time is acceptable (10min17s).\n\n|!(0;)| = L/exp (−0;/0%∗) , , 0 ≤ 0%∗ ≤ 0%,>?@∗ Eq. [8]"
    },
    {
        "id_": "b08f61b2-7263-42fc-8db2-c3738dee24db",
        "text": "# 3.8. xignal-to-noise vatio\n\nIn a region of interest (ROI), SNR was calculated via Eq. 9 in a simplified way for both volume and array coils by taking the ratio of mean intensity x to noise standard deviation (SD) in noise-only background regions. A factor of 0.655 was applied to noise SD to account for Rician distribution in magnitude images. For SNR mapping, pixel signal is used in the calculation.\n\nH?l = 0𝑓𝑓ℎ55 H/Hn Eq. [9]"
    },
    {
        "id_": "0be5e0c3-6958-4af7-914e-dff8c3495779",
        "text": "# 3.9. Estimation of extva- and intvacellulav solume fvactions\n\nThe estimates give the up-band of volume fractions when all the mono-T2 sodium are assigned to extracellular space while the bi-T2 sodium to intracellular space, in the case that mono- and bi-T2"
    },
    {
        "id_": "5f58613a-5837-4946-bb87-6c553ed52c36",
        "text": "# 3.10. Statistical Significance\n\nA regular statistical significance (P=0.05) was applied to the comparisons, via Student’s t-test, between the two sets of data in this work. Minimum sample size for the t-test is 16, with 80% power, 5% significance level, two-sided test, and 1.0 effect size.27"
    },
    {
        "id_": "b68ed598-8543-4f7f-a5dc-e4d1bb717065",
        "text": "# 4. RESULTS"
    },
    {
        "id_": "bda99149-6c5f-40bd-bf4d-cce2dec3ff02",
        "text": "# 4.1. Measurement of T* Values\n\nFig. 2 presents a representative of T* values on a healthy subject (52 years old, male), with and without correction for the distortion at the first five ADC samples (Figs. 2a1,b1). The correction removed distortion and reduced overall residual fitting error from 2.33% to 1.49% (Figs. 2a2,b2). The correction also improved resolution of short-T* components: from singlet at 2.5ms to doublet at 0.5ms and 2.5ms (Figs. 2a3,b3). A high resolution in T* was achieved at 0.5ms, with residual fitting error less than 1.5%. Notably, a few of sparse peaks appear in the T2* spectrum, indicating that T* values are well clustered in the human brain and that a single set of T2* values is applicable to the separation of mono- and bi-T2 sodium."
    },
    {
        "id_": "dd6bd388-116c-495f-8ff9-02ac7c814c6d",
        "text": "# 4.2. Sensitivity to T* Values\n\nFig. 3 shows the computed impact of T2* values on the accuracy of separation of the mono- and bi-T2 sodium signals (mfr, mbd). The calculation was performed at a typical set of (T2*fr, T*bs, T*bl) = (50.0, 3.5, 15.0) ms in two extreme cases: the mono-T2 sodium dominating, mfr = 0.9, and the bi-T2 sodium dominating, mbd = 0.9. The impact of individual T* components are shown in columns. In column A, an error in T*fr caused an error in mfr or mbd much smaller for the dominant one (e.g., ∆mbd < 2.2% when ∆T2*fr < 20%, and ∆mfr < 2.9% when ∆T*fr < 5.0%). In column B,"
    },
    {
        "id_": "e66959a3-e39f-408c-bbec-b189132b61dd",
        "text": "# 4.3. Optimization of TEs\n\nThe ideal scheme of 80 TEs is presented in Fig. 4a on Yfr(TE) of the free sodium at a typical Tfr=50ms and on Ybd(TE) of the bound sodium at a typical {T2*bs, T2*bl} = {3.5, 15.0}ms. The intuitively-favorable scheme of 8 TEs was presented in Fig. 4b, while the optimal candidate of two TEs was presented in Fig. 4c. Singular values (^1, ^2) of the three TE schemes were compared against each other in Fig. 4d. In Fig. 4e is singular values of the 2-TE scheme, slowly changing with the TE2 increasing. The ^2 is less than 1.0 for the 8-TE and 2-TE schemes, leading to an amplification of noise. Therefore, a better choice for less noise amplification is the 2-TE scheme, in which TE2 at 5ms produced a value near maximum of ^2 while preserving higher signal than the larger TE. Thus, the 2-TE scheme is selected for the human studies."
    },
    {
        "id_": "8fc642b2-1bef-4968-bb83-f8969bab085b",
        "text": "# 4.4. Phantom Simulations\n\nFig. 5 demonstrates the simulated separation of mono- and bi-T2 sodium signals (mfr, mbd) at a typical set of (Tfr, T2*bs, T2*bl) = (50.0, 3.5, 15.0) ms and two-TE scheme TEs=(0.5, 5.0), at three SNRs: extra-high (100), high (50), and regular (25). The mean and standard deviation (SD) of the separated mfr and mbd were presented. The SD (error bar) consistently decreased with SNR increasing. There was an underestimate for mfr or mbd near the maximum value 1.0, but an overestimate near the minimum value 0.0, with an amount decreasing with SNR increasing."
    },
    {
        "id_": "c658e94d-8a82-49f9-bbce-9eb34a972b5a",
        "text": "# 4.5. Phantom Studies\n\nFig. 6 summarizes the outcomes of phantom studies. Fig. 6a shows phantom arrangement of four tubes and sodium images at TE1/TE2=0.5/5ms. Fig. 6b shows FID signal from the four tubes at"
    },
    {
        "id_": "d32f372b-9e5c-4fe5-8bfb-0c750b511a23",
        "text": "# 4.6. Human studies"
    },
    {
        "id_": "509456a6-85fc-4881-8ae0-4e64864a154e",
        "text": "# 4.6.1. T* salues in wzole wvain acvoss suwjects\n\nFig. 7. presents a scattering plot of individual T2* components from the T* spectra across all the subjects studied. Typical T2* spectra and FID signals are shown in Fig. 7a for a healthy young subject (21 years old, male) and in Fig. 7c for an epilepsy patient (31 years old, male). The peaks in the T* spectra were sparse and just 2–4 peaks, suggesting that a global set of T2* values (T*fr, T*bs, T2*bl) be a plausible estimate for the whole brain (Figs. 7a, c). However, these T* values are slightly different from subject to subject (Fig. 7b). The short-T* component is clearly crowded in a range of 1-5ms, while the long-T2* is widely scattered in three bands centered at 10, 20, and 30ms, respectively. Interestingly, the long-T* component is shifted to lower values in the patient group, compared with the healthy group. There seems no difference between males and females in the healthy group. Therefore, the T2* values are heterogeneous across the subjects."
    },
    {
        "id_": "7d182746-dad9-4a3a-afc5-dbc826953f8d",
        "text": "# 4.6.2. Mono- and wi-T2 sodium seyavation\n\nFigs. 8 and 9 present two typical cases of the human studies in full implementation of the mono- and bi-T2 sodium separation. Case 1 (Fig. 8) is from a 26-year-old healthy female, and includes 3D sodium images of the brain at TE1/TE2=0.3/5ms (Fig. 8a), FID signal of whole brain and associated fitting error and T* spectrum (Fig. 8b), the separated sodium images from the two-TE2 images using (T2*fr, T2*bs, T2*bl) = (50.0, 6.0, 19.0) ms (Figs. 8c1-c3), and inverse-contrast displays (Figs. 8c4-c5). In Fig. 8d are SNR, ∆B, and single-T* maps calculated from the two-TE."
    },
    {
        "id_": "64ea4471-5034-4006-9061-ef104b92ccfc",
        "text": "# 4.6.3. Estimates of extva- and intvacellulav solume fvactions\n\nIn the healthy group (Fig. 10), the difference in volume fraction between the gray and white matters is significant (P=0.023): 89.6±4.5 % vs. 94.0±2.6 % for the intracellular space (in line with the literature, 75% vs. 92%8), and 10.4±4.5 % vs. 6.0±2.6 % for the extracellular space. No significant\n\nimages in Fig. 8a. Case 2 (Fig. 9) is from a 59-year-old male patient with bipolar disorder. The separated sodium images were attained at (T*fr, T2*bs, T2*bl)2 = (50.0, 2.5, 7.0) ms according to the peaks in Fig. 9b3.\n\nFig. 8 indicates that signals from CSF in the brain were effectively separated into the mono-T2 sodium image (Fig. 8c2 or c4), while signals from brain tissues such as gray and white matters were separated into the bi-T2 sodium image (Fig. 8c3 or c5). Notably and surprisingly, signal intensity across brain tissues looks more uniform in the bi-T2 sodium images than in the mono-T2 sodium images (Fig. 8c2), total sodium images (Fig. 8c1), and TE1-images (Fig. 8a1). SNR in Fig. 8d1 are 25+ in most regions of the brain, assuring a robust separation as suggested in the simulations in Fig. 5. The field inhomogeneity ∆B0 in Fig. 8d2 varied between ±20Hz across the brain, with the largest off-resonance in the prefrontal and occipital lobes, leading to visible blurring of the tissues in the bi-T2 sodium images (Fig. 8c3 or c5, sagittal). The single-T* map in Fig. 8d3 provides a spatial distribution of short and long T* components across the brain, complementary2 to T* spectrum in Fig. 8b3. It also indicates that majority of long T2* components are located in the prefrontal lobe in this particular case (Fig. 8d3, sagittal).\n\nFig. 9 demonstrates potential benefits from the bi-T2 sodium images of patients with neurological disorders such as bipolar disorder which is known to cause abnormally-high intracellular sodium concentration in the brain but locations are unknown.38,39 The bi-T2 sodium images (Fig. 9c3 or c5) clearly highlighted brain regions of an elevated bi-T2 sodium signal against surrounding tissues, with a ratio of 1.78 vs. 1.40 (or 27.1% increase) before the separation (Fig. 9c1). These regions have no visible contrast in the total or TE-images (Fig. 9a1 or c1). SNR in these regions is 40+ (Fig. 9d1), supporting a robust separation. The field inhomogeneity ∆B0 in these regions is low (<5Hz, Fig. 9d2), excluding field-induced artifacts. The single-T* map in Fig. 9d3 shows abnormally low T2* values in these regions, confirming an increase in short-T2* components."
    },
    {
        "id_": "22fd7c12-43cd-46df-a2f2-7e3056128e8d",
        "text": "# 5. DISCUSSION\n\nThe proposed MSQ technique has been demonstrated, using the computer simulations, physical phantoms, and human subjects, to be able to separate mono- and bi-T2 sodium signals voxel-wise. The physics behind the technique is the intrinsic difference in T2 relaxation between sodium nuclear spins: mono- vs. bi-exponential decay. In the restriction of total scan time, the two-TE scheme, instead of the eight-TEs, was selected for smaller transfer of random noise during the separation (Fig. 4). The measurement of T* spectrum from FID signals of entire brain and the application of a global set of T* values (T2*fr, T2*bs, T2*bl) were tested feasible to humans. In case of not plausible for a global set of T2* values (i.e., T* spatially varying substantially 40-47), multi-regional sets, or a linear combination of them, may be used.\n\nThe quantification of sodium concentration after the separation is not addressed in this study because it is involved in a complicated procedure of 1) calibration that transforms sodium signal into concentration and 2) correction for inhomogeneous sensitivity of coil elements. These processes deserve a separate study to deal with.\n\nThe limitations of MSQ technique are obvious, and understanding them is crucial to practice of the technique. The first limitation is the two-component model (mono- and bi-T2 populations) which is of risk to produce a false-positive error for bi-T2 sodium. If there are mono- and bi-T2 sodium populations in a voxel, then they are separatable. If not, such as two mono-T2 sodium decays at different T2* values in a voxel, they would be falsely separated into bi-T2 sodium because they can be combined mathematically (not physically) into a bi-exponential decay mimicking a true bi-T2 sodium decay. This kind of false positive error stems from the fact that the separation is based on mathematical model, instead of physical model as does the TQF separation. Understanding this kind of false positive errors is critical to proper interpretation of the separated bi-T2 sodium signals.\n\nThe second limitation is the misguided separation of single mono-T2 sodium component of short T* 2 value in a voxel, such as regions in nose and sinuses (Figs. 8c3 and 9c3)."
    },
    {
        "id_": "a6a9c2d3-ac9d-450b-b0b0-068b0902d543",
        "text": "situation, the MSQ separates it into bi-T2 sodium of underestimated intensity. These mis-separated regions can be identified by means of the maps of ∆B0 and single-T* (Figs. 8d and 9d).2\n\nThe third limitation is the underestimate of bi-T2 sodium signal caused by the TE1 image, as illustrated in the phantom study (Fig. 6c3). The separation (Eq. 2) assumes TE-image intensity1 exactly at TE1 (i.e., a very short readout time). Actual TE1-image intensity is an average over readout time during which short-T2* components decay significantly when readout is relatively long, such as readout T=36.32ms about ten times long of a short-T2* at 3ms in this study. Therefore, the underestimation alters with readout time or pulse sequence. To mitigate the problem, two strategies may apply. One is to replace TE1 value in Eq. 2 with an effective (larger) value that accounts for short-T* decay during the readout. The other is to shift T2*bs to a larger2 value, as did in previous work on the phantoms.48 Alternatively, correction for the underestimates is integrated into calibration of image intensity for sodium concentration (Fig. 6c4)."
    },
    {
        "id_": "a65e783b-1e22-4bd9-a06b-473ab124a6a4",
        "text": "# 6. CONCLUSION\n\nThe data presented in this study have demonstrated the feasibility of proposed multi-TE single-quantum sodium MRI technique to separate between mono- and bi-T2 sodium signals in a fashion of voxel by voxel. The MSQ technique is based on a solid physics related to the intrinsic difference in T2 relaxation between the two populations of sodium nuclear spins. The two-TE sampling scheme stands out for smaller noise transfer during the separation. A global set of T2* values (T*fr, T*bs, T2*bl) measured on T* spectrum of whole brain was tested applicable to humans. However, the MSQ technique has limitations and requires cautions in practice."
    }
]