[
    {
        "id_": "ec9a7b09-f9b6-41c1-96d8-de03d1732ef7",
        "text": "# 1. INTRODUCTION\n\nThe early-life environment is crucial in shaping individuals’ outcomes, with potentially life-long, irreversible impacts in older age. The existing “Developmental Origins” literature has mostly focused on the long-term impacts of adverse nutritional, health and economic conditions during the prenatal and early childhood period (for reviews, see e.g., Almond and Currie, 2011; Almond et al., 2018). There is relatively little empirical evidence however, on the prolonged and cumulative consequences of early-life pollution exposure, despite the well-known adverse contemporaneous effects on infants’ health (see e.g., Graff Zivin and Neidell, 2013, for a review). One of the main reasons for this is a lack of high-quality historical pollution data. Evidence on the long-term effects however, is important, since ignoring these substantially underestimates the total welfare effects caused by exposure to environmental toxins.\n\nThis paper addresses this directly, estimating the immediate and long-term impacts of a UK pollution reduction programme introduced in the mid 1950s. We deal with the general lack of historical pollution data by digitising local monthly measurements of black smoke and sulphur dioxide for a 20 year period, covering 1954 to 1973. We then exploit the staggered introduction of so-called “Smoke Control Areas” (SCAs) – i.e., zones introduced by local authorities that banned smoke emissions from residential as well as non-residential dwellings.\n\nWe study both (i) the effect of the introduction of SCAs on local pollution levels, and (ii) their (long-term) impact on individuals’ human capital and health. The former relies on our digitization of historical monthly pollution measurements. The latter uses UK Biobank data: a large population-based cohort of approximately 500,000 individuals living in the United Kingdom for whom we observe their year-month of birth, as well as their eastings and northings of birth. The data also include rich information on individuals’ later life health and economic outcomes, linked to administrative records. We focus on those born in England and merge in the exact location, boundary, and month of introduction of all SCAs introduced in English County Boroughs (CBs), obtained from Fukushima (2021). CBs are local authorities with administrative autonomy due to their population size or historical significance (i.e., relatively urban areas). Our identification"
    },
    {
        "id_": "5286c4ba-6bbb-4137-87b6-f658fba63b2f",
        "text": "# Impact of Smoke Control Areas on Local Pollution Levels\n\nThis strategy exploits the spatial and time variation in the staggered roll-out of Smoke Control Areas using an event study approach and we show that our results are robust to using group-time average effects that account for staggered treatment (Sun and Abraham, 2021; Callaway and Sant’Anna, 2021; Borusyak et al., forthcoming). In other words, we compare measurement stations (individuals) located (born) in or downwind of smoke control areas before and after its creation, relative to those of a control group of never-treated stations (individuals), whilst controlling for weather variation, local area-specific trends in the outcomes of interest (and individual-level controls).\n\nWith that, we provide one of the first estimates of the dynamic and time-varying impact of the introduction of Smoke Control Areas in the 1950s and 1960s on local pollution levels. We also explore the determinants of the timing of SCA introduction, and investigate whether areas selected to become smokeless were systematically different from those not selected. We show that – as expected – more densely populated CBs introduced SCAs earlier. We find no evidence however, that the timing of SCA introduction is related to the socio-economic composition of local areas, nor to pre-programme pollution levels, suggesting that the timing of SCA introduction is largely unrelated to local area characteristics. We do find that areas that were selected to become smokeless during this period were different from areas not selected within the same CB, in that they were slightly less polluted and of higher SES prior to SCA introduction. We describe these differences in detail and directly account for them in our analyses."
    },
    {
        "id_": "800abb1b-450e-4a98-b4ca-d356486b41d2",
        "text": "# Immediate and Long-term Impacts\n\nWe then examine the immediate as well as long-term impacts of the introduction of Smoke Control Areas on individuals. Whilst there is a large literature on the contemporaneous effects of pollution on children’s birth outcomes, we are aware of only a handful of papers that empirically examine the causal impacts of early-life pollution exposure on outcomes in older age.1 All of these exploit the 1952 London smog as an exogenous pollution event and show that those exposed to the smog are less likely to have a degree, work fewer hours, have lower fluid intelligence and are more likely to have developed respiratory disease (Bharadwaj et al., 2016; Ball, 2018; von Hinke and).\n\nThere is also an increasing literature studying the effects of pollution on outcomes in childhood or early adulthood, showing negative impacts on e.g., human capital formation, labour force participation and wages (Sanders, 2012; Isen et al., 2017; Bharadwaj et al., 2017; Persico, 2020; Persico and Venator, 2021; Heissel et al., 2022).\n\n1"
    },
    {
        "id_": "2d32c186-c90d-456c-a51f-b6225d65af5c",
        "text": "# Impact of Large-Scale Pollution Reduction Programme\n\nCompared to this literature that exploits a single extreme event, we investigate the impact of a large-scale pollution reduction programme, the aim of which was to improve air quality and with that, public health. This is similar to Isen et al. (2017), who exploit the introduction of the 1970 Clean Air Act Amendments that forced US counties with pollution levels that exceeded maximum concentrations to reduce their emissions but left others unaffected."
    },
    {
        "id_": "75608647-b674-407b-86cd-79706d446ea0",
        "text": "# Section 2\n\nAs we discuss in more detail in Section 2, the 1956 UK Clean Air Act that allowed for the introduction of SCAs was one of the most comprehensive and influential pieces of legislation of its time and marked a significant step in national air pollution control. It was among the first to address industrial as well as domestic sources of air pollution on a national scale. The introduction of SCAs required all coal burning to be replaced with smokeless fuels, which was considered an innovative approach to reducing pollution from residential dwellings; a major source of pollution at the time. The Clean Air Act was also one of the first pieces of legislation to clearly link air pollution to public health and to take steps to mitigate its impacts. It subsequently served as a model for other countries to tackle air pollution and protect public health (e.g., the 1963 US Clean Air Act).\n\nWe provide the first empirical analysis of the long-term consequences of the Act."
    },
    {
        "id_": "cd6305e6-c874-43a5-b424-5ddafaa9f292",
        "text": "# Findings\n\nOur findings show that the roll-out of Smoke Control Areas substantially and persistently reduced black smoke emissions for at least five years post-introduction. We find no consistent impacts on sulphur dioxide. This is not surprising since, first, SCAs targeted black smoke only and second, bituminous coal (the predominant form of heating at the time) and smokeless fuel (its replacement) are known to release similar amounts of sulphur dioxide (Mitchell et al., 2016).\n\nWhen studying the impacts on individuals’ health and human capital outcomes, we find that the introduction of SCAs led to an increase in weight at birth as well as height in adulthood. In contrast, we find no consistent evidence of impacts on years of education and intelligence, though our results."
    },
    {
        "id_": "5e814150-3553-4449-acb9-e4872d18b4e2",
        "text": "# Footnote\n\n2 The vast majority (>98%) of particles emitted from coal combustion are smaller than 2.5 micrometers in diameter (also referred to as PM 2.5); sufficiently small to penetrate the lung system and reach the blood circulation and is therefore considered particularly harmful. Black Smoke consists of fine particulate matter and is emitted mainly from fuel combustion. Since pollution from road traffic was still minimal at the time, the vast majority of PM2.5 would have come from coal."
    },
    {
        "id_": "47cc3ee6-2dd1-43f7-8c47-08d3bc4ae0e6",
        "text": "are suggestive of some heterogeneity by SES, with these outcomes more likely to improve in high SES areas. These findings are robust to a host of sensitivity checks, but they are in contrast with the studies above that find long-term deteriorations of human capital in response to pollution exposure.\n\nWe highlight two possible reasons for this. First, rather than exploring a huge but transitory pollution spike (i.e., the London smog), we examine the long-term consequences of smaller but persistent changes in pollution exposure. It is possible that such different patterns of exposure differentially impact individuals’ short as well as longer-term outcomes. Second, the different estimates may reflect differences in exposure to specific pollutants. Indeed, the 1952 London smog dispersed a range of toxins, including tar, carbon monoxide, carbon dioxide and sulphuric acid (Wilkins, 1954). In contrast, the introduction of SCAs targeted black smoke only, since a reduction in gaseous pollutants was not considered feasible at the time. The evidence suggests that the main change in moving from bituminous coal to smokeless fuel is a drop in particulate matter, with no changes in e.g., nitrogen oxides (including nitrogen dioxide), sulphur oxides (including sulphur dioxide) and carbon monoxide (Mitchell et al., 2016). Indeed, one of the strengths of this study is that we directly estimate this “first stage”, showing clear reductions in black smoke concentrations but not sulphur dioxide. Our findings therefore suggest that pollutants other than black smoke may be responsible for the adverse effects on human capital, whereas black smoke affects fetal and child growth.\n\nWe explore three sources of heterogeneity in the estimated impact of SCAs. In addition to heterogeneity by gender and SES, we examine whether the impact of SCAs varies by individuals’ genetic “endowments”, as measured by one’s polygenic score (also known as a polygenic index) that is specific to the outcome of interest. We consider genetic heterogeneity for three reasons. First, we are interested in whether the significant public health investment in smoke control affected genetic inequalities. Gene-by-environment analysis allows us to explore this empirically. Although we cannot change our genetic make-up, we can change the environment. Hence, understanding the extent to which (local) government policies affect population subgroups differently informs us about potential impacts on inequalities in relevant (health and economic) outcomes."
    },
    {
        "id_": "56676821-f7b3-4afa-8e0d-a185f541acc8",
        "text": "ing gene-by-environment interplay helps us improve our understanding of the health and human capital production function. This literature emphasizes the role of complementarities between endowments and investments, suggesting that individuals with higher endowments benefit more from subsequent investments (Becker and Tomes, 1986; Cunha and Heckman, 2007). Muslimova et al. (2020) suggest the use of genetic information to capture such endowments, exploring its interaction with (a proxy for) exogenous parental investments.3 We follow this literature, but instead examine the interplay with public health investments. As such, positive gene-by-environment interactions are consistent with such complementarities. Third, finding evidence of gene-by-environment interplay provides evidence against arguments of genetic or environmental determinism. This in turn is crucial in the debate about whether one’s success in life is due to efforts or circumstance (see e.g., Roemer, 1993; Roemer, 1996).\n\nOur genetic heterogeneity analyses provide suggestive evidence that the introduction of SCAs increased inequalities in population health but not in economic outcomes. Indeed, we find that the introduction of SCAs led to larger increases in birth weight and height among those with a high polygenic score for these outcomes. These results are consistent with the existence of complementarities in the health production function (see also van den Berg et al., 2023), but not the human capital production function (as in Muslimova et al., 2020).\n\nThe rest of the paper is structured as follows. Section 2 provides the background to roll-out of Smoke Control Areas in England and Section 3 describes the data sources used in our analyses. We set out the empirical strategy in Section 4, and discuss the results in Section 5. We explore the sensitivity of our findings in Section 6 and conclude in Section 7."
    },
    {
        "id_": "c30d2074-9719-4114-8838-ef95b7bf5245",
        "text": "# 2. BACKGROUND\n\nOne of the oldest accounts on the impact of smoke on health was addressed to King Charles II in 1661 in a treatise called “Fumifugium; or The Inconvenience of the Aer and Smoake of London.\n\nSuch complementarity analysis would ideally use parent-child trio or sibling data (as in Muslimova et al., 2020) to allow one to also isolate exogenous endowments. However, although there are around 40,000 siblings in the UK Biobank, our analysis sample only contains about 160 sibling pairs, making within-sibling analysis infeasible."
    },
    {
        "id_": "946d3f99-ed35-4d31-a800-877bdb2abcb5",
        "text": "# Impact of Smoke Pollution in London\n\nDissipated” (Evelyn, 1661). This suggested that smoke pollution shortened the lives of Londoners. Despite this, the industrial revolution, the massive migration of workers to urban areas, and the overall increase in population meant that the smoke problem would continue to escalate for many centuries. Only after the Great London Smog in December 1952, which brought premature death to thousands of citizens, lawmakers and the public became fully aware of the potential damage of smoke, which led to the swift passing of the Clean Air Act in 1956 (Clean Air Act 1956)."
    },
    {
        "id_": "3bafaa8b-cb37-400b-862d-418fd28d65c2",
        "text": "# Clean Air Act of 1956\n\nBefore the Clean Air Act, the UK’s primary source of air pollution was emission from burning bituminous coal, with coal fires being the predominant form of heating in most dwellings far into the 1960s. The 1956 Clean Air Act consisted of two main parts. In the first part, the Act prohibits the emission of dark smoke from all buildings. The Act defines smoke as fly ash, grit, and gritty particles, and the shade of the smoke was determined by comparing the colour of the smoke against the Ringelmann Chart. The fine for breaching the law was a maximum of ten pounds for a private dwelling and 100 pounds for all other buildings. While the regulation contributed to improving the air quality in the nation, many exemptions to the law and generous lead times of up to seven years for industries hampered its full potential."
    },
    {
        "id_": "2e1e8cf8-46a0-4050-81ac-a4aafd7e8799",
        "text": "# Smoke Control Areas (SCAs)\n\nIn contrast, the second part of the law gave local authorities across the UK the mandate to introduce so-called Smoke Control Areas (SCAs), which banned any smoke emissions inside the area. At the start, the fine for violating a smoke control order carried a penalty of up to ten pounds per offense which increased to 20 pounds in the revised 1968 Clean Air Act. It is important to note that, while the Act regulates the emission of smoke, it does not target gaseous pollutants that are present in coal such as sulfur dioxide (SO2). In fact, the reason for not targeting SO2 emissions was that its elimination was thought unattainable at the time since SO2 is equally present in bituminous and smokeless fuel."
    },
    {
        "id_": "64f57b2f-5603-41bb-8ede-475a9ae1cc23",
        "text": "# Application Process for SCAs\n\nLocal authorities had to apply to the Ministry of Housing and Local Government to implement a Smoke Control Area. This application process had a number of ‘milestone dates’ (National Society for Clean Air, 1956). First, the local council would survey the area, propose a boundary and..."
    },
    {
        "id_": "09dcfdc6-5e11-4964-af20-43aa610e2820",
        "text": "# Footnote\n\nSO2 is formed by the oxidation of sulfur in fuel combustion. It can cause direct harm to health by damaging the lung capacity and indirectly as a secondary particulate matter when reacting to other airborne particulate matters."
    },
    {
        "id_": "6d3480a7-6bd3-493f-8b6f-14b5121bfc9d",
        "text": "operation date, and announce it to the public in a local newspaper as well as in the London Gazette. 5\n\nThe ‘submission date’ refers to the date on which the proposal was submitted for review to the Ministry of Housing and Local Government, usually leading to the Ministry confirming, perhaps with adjustments, the agreed date of operation and boundary for the proposed SCA. The SCA would then come into effect at the ‘operation date’, after which the monitoring and enforcement measures would start.\n\nTo comply with a smoke control order, the dwelling owner could substitute bituminous coal for (manufactured) smokeless fuel such as anthracite or gas (if available). For older dwellings, this typically required owners to adapt their appliances to new fuel types; 70% of the costs associated with such conversions were reimbursed by the local council, as long as the adjustment work was done before the ‘operation date’ (National Society for Clean Air, 1958; National Society for Clean Air, 1960). The local council would in turn receive a 40% (four-seventh of 70%) contribution from the exchequer to cover these additional costs; the other 30% was borne by the council. The total costs for these adaptations were not negligible, highlighting the willingness of local authorities and central government to control pollution levels despite significant expenses associated with them.6"
    },
    {
        "id_": "5dda5abc-12a3-4c89-9fd4-5a31eeb6eba8",
        "text": "# 3. DATA AND DESCRIPTIVE STATISTICS\n\nWe combine four sources of data for our main analysis: (1) exact locations, boundaries and ‘mile-stone dates’ for all smoke control areas introduced in County Boroughs between 1957 and 1973, (2) weather data for the same period, (3) monthly measurements of black smoke and sulphur dioxide for the years 1954-1973, and (4) individual-level data from the UK Biobank that includes residential location at birth as well as individuals’ human capital and health outcomes at older ages for cohorts born before and after the introduction of smoke control areas. We discuss each of these in more detail below. To differentiate between the data used to explore the impact on levels of\n\n5 Local authorities were free to decide SCA’s boundaries and operation dates but were required to provide a minimum of six months’ notice before operation.\n\n6 For example, Sheffield local authority spent approximately 2.3 million pounds (26 million pounds in 2023 prices) on reimbursement of adjustment work to complete the district’s smoke control programme during 1957–1972 (Shaw, 1972)."
    },
    {
        "id_": "fdd71281-e014-4ede-b110-843da92b2872",
        "text": "# 3.1. Smoke Control Areas\n\nWe use the data from Fukushima (2021) that record the exact location, boundaries and year-month of submission and operation for all 1,027 smoke control areas that were introduced in so-called County Boroughs (CBs) across England by 1973. These data come from multiple sources: local historical archives, notices in historical editions of the London Gazette, relevant Medical Officer of Health reports, as well as historical issues of “Smokeless Air”; a quarterly publication by the National Smoke Abatement Society (see, e.g., National Society for Clean Air, 1958). We restrict our attention to SCAs in CBs only, as these are predominantly residential areas. Indeed, although they only make up →3% of the total land area, they cover over a third of the English population (35% according to the 1951 Census).\n\nWe further collect data on the universe of SCAs (rather than those in CBs only) introduced from September 1958 to December 1973. These are reported by National Smoke Abatement Society, but they are only available at a more aggregate level (year-quarter rather than year-month). More importantly, they do not provide SCA boundaries, meaning we cannot pinpoint their exact location and shape within a CB. Our main empirical analysis therefore focuses on the exact boundaries and year-month of submission and operation of SCAs in County Boroughs only.7 The more aggregated data however, are useful for descriptive purposes, showing the extent to which local governments engaged with the new legislation and introduced areas of smoke control. Indeed, Figure 1 uses these data (Baker et al., 2024b) to present the number of submitted SCAs in England by year.8 This shows a steady increase in the number of SCAs during this time, reaching over 4,000 by 1973. Figure A.1 in Appendix A plots the spatial distribution of SCAs across England in 1973. Although any local authority could submit an application for a new SCA, the figure shows that\n\n7 We use the information on the universe of SCAs in our robustness analysis to identify geographical areas outside CBs that never introduced any SCA within our period of interest; see Section D.1.\n\n8 Although the first smoke control areas were introduced in 1957, shortly after the passing of the 1956 Clean Air Act, their exact ‘milestone dates’ were not recorded. We therefore only report the number of SCAs from 1958 onwards."
    },
    {
        "id_": "e62ac3b9-2e94-4dbb-8b02-ddbc28e1f7ff",
        "text": "they are concentrated in and around urban areas such as County Boroughs. While this may suggest that more densely populated areas were more likely to implement SCAs, and to do so earlier than other districts, we show in Appendix B that conditional on population density, the timing of SCA implementation across CBs is not strongly or systematically driven by predetermined district-level characteristics (i.e., socioeconomic composition), nor by pre-treatment pollution levels."
    },
    {
        "id_": "c955fcdc-668a-4f86-a8c1-dc651358c3ce",
        "text": "# Figure 1: Smoke control areas in England by year and status.\n\n|Year|Submitted - England|Operating - England|Operating - England, CBs|\n|---|---|---|---|\n|1958|0|0|0|\n|1959|0|0|0|\n|1960|0|0|0|\n|1961|0|0|0|\n|1962|0|0|0|\n|1963|0|0|0|\n|1964|0|0|0|\n|1965|0|0|0|\n|1966|0|0|0|\n|1967|0|0|0|\n|1968|0|0|0|\n|1969|0|0|0|\n|1970|0|0|0|\n|1971|0|0|0|\n|1972|0|0|0|\n|1973|0|0|0|\n\nPlots the number of submitted and operating smoke control areas in England by year. Also shows the subset of smoke control areas operating in CBs in England, as these are the ones we use in our analysis. The totals for England have been digitised from reports by the National Smoke Abatement Society.\n\nWhen estimating the impact of the introduction of SCAs, we drop 15 out of the total 85 CBs because of significant boundary changes during our study period (e.g., total/partial splits and merges with neighbouring local authorities that make it impossible to consistently observe them over time). Of the remaining 70 CBs, 55 adopted at least one SCA before 1974, and 15 did not. We refer to these as “adopting” and “non-adopting” CBs, respectively.9\n\n9 The following 15 CBs are dropped due to significant boundary changes: Croydon, Derby, Dudley, East Ham, Hartlepool, Middlesbrough, Smethwick, Teesside, Torbay, Walsall, Warley, West Bromwich, West Ham, West Hartlepool, Wolverhampton. Table A.2 lists the CBs remaining in our analyses by adoption status. The “non-adopting” CBs include those that either never adopted a SCA or only adopted one in greenfield land areas within their jurisdictions (i.e., undeveloped land used for agriculture or landscape design)."
    },
    {
        "id_": "0e91fca7-0ae6-416c-bf0f-b927a51460d5",
        "text": "# 3.2. Weather\n\nGiven the importance of the weather for pollution dispersion as well as individuals’ health (see e.g. Hanlon et al., 2021), we merge in daily data on wind speed, wind direction, precipitation, and temperature from the ERA5 reanalysis data (Hersbach et al., 2020). These have an approximate grid resolution of 25km and we assign weather measurements to SCAs, stations, and individuals by linking them to the nearest grid point. For SCAs, we link to its centroid, while we use the actual measurement and birth locations for stations and individuals, respectively.\n\nWe use these weather data in two ways. First, we directly control for weather conditions in our analyses, averaging individuals’ exposure to the weather conditions during the prenatal period and the first two years of life. Second, we use the historical weather data to identify stations that are downwind from an SCA, and therefore potentially indirectly affected by its introduction. We discuss this in more detail below."
    },
    {
        "id_": "7cba58eb-ad51-4a6d-82b5-adbb2a9135d1",
        "text": "# 3.3. Pollution\n\nTo construct our “pollution panel”, assessing the impact of the introduction of SCAs on local air pollution, we digitise six years of monthly pollution measurements and station locations from the Department of Scientific and Industrial Research (1954–1961).10 We combine these with measurements and station locations for 1961–1973 (DEFRA, 2022), allowing us to construct a panel of monthly black smoke and sulphur dioxide levels taken at measurement stations across England between 1954 and 1973. Note that this is an unbalanced panel, with fewer measurement stations at the start of the observation period and new ones being introduced over time. Indeed, we do not observe any pollution measurements in non-adopting CBs until 1962 when the first measurement.\n\n10 The pollution data from 1954-1960 comes from Fukushima (2021); the 1961 pollution data are from Baker et al. (2024a). The data were collected by the world’s first coordinated national air pollution monitoring network: the UK Investigation of Atmospheric Pollution, run by the Warren Spring Laboratory. Historically, it monitored and compiled data on two main pollutants: black smoke and sulfur dioxide. Black smoke was measured using smoke samplers, drawing 50 cubic meters of air through a white filter paper over 24 hours. The density of the deposit was then assessed using a reflectometer. Sulphur dioxide was measured by drawing the same sample of air through a chemical solution that reacts with sulphur dioxide to form sulphuric acid. The measured acidity of the solution was then used to approximate the concentration of sulphur dioxide in the air sample. Loader (2002) gives a detailed description of these processes in the context of the monitoring network."
    },
    {
        "id_": "a0007dfe-acf9-4775-81ec-a0cb88828748",
        "text": "# Pollution Stations and Their Classification\n\nWe assign pollution stations to SCAs as well as CBs by projecting the stations’ locations onto our digitised SCA boundaries and the 1971 CB boundaries (University of Portsmouth, 2011; Southall, 2011), respectively. We define stations located inside a SCA as ‘treated’, and stations in non-adopting CBs as ‘never-treated’ (controls). When a CB is only partly covered by one (or more) SCA, we add stations that are inside the CB but outside the SCA boundaries to the group of ‘never-treated’ stations. We show the robustness of our results to dropping these altogether in Section 6 below."
    },
    {
        "id_": "f72621c0-1985-4499-97d7-0d55b66d639d",
        "text": "# Data Restrictions\n\nStarting from 160,833 station-year-month observations for black smoke and 156,395 for sulphur dioxide, we restrict our pollution panel as follows. First, since our SCA boundary data are restricted to stations located in CBs, we drop those located outside CBs, reducing our sample to 52,234 and 50,803 observations for black smoke and sulphur dioxide respectively. Second, we include only stations in adopting or non-adopting CBs, dropping those with border irregularities (see Section 3.1). Furthermore, since pollution is not measured in any of the non-adopting CBs until after 1961, the pollution panel covers 1962 onwards, leaving us with 35,145 station-year-month observations (401 stations) for black smoke and 34,951 station-year-month observations (399 stations) for sulphur dioxide."
    },
    {
        "id_": "b7320870-99ae-472b-861b-cdda28f1b9c9",
        "text": "# Trends in Air Pollution\n\nFigure 2 plots the trends in air pollution during the roll-out of the smoke control programme, plotting the monthly black smoke (left panel) and sulphur dioxide (right panel) levels as measured at treated and control stations; that is, stations located respectively inside or outside the exact boundaries of all smoke control areas in English County Boroughs. The graphs highlight three key points:\n\n1. It shows clear seasonality in pollution, with peaks in both black smoke and sulphur dioxide during the winter months, and lower levels during the summer.\n2. There is a reduction in air pollution levels measured at both treated and control stations over time, as shown by the smoothed averages (dashed lines).\n3. The decrease in levels of black smoke was larger at treated stations compared to controls, resulting in the average black smoke levels converging over time. For sulphur dioxide, the gap between treated and control stations only narrowed slightly."
    },
    {
        "id_": "2ddaea3d-b955-4c40-a2b3-42c7a67c8234",
        "text": "# Avg. concentration, mcg / m3\n\nsuggesting that the adoption of smoke control areas had a smaller impact on levels of SO2."
    },
    {
        "id_": "ca9f5121-9010-4e79-86d3-e5558be956ca",
        "text": "# Figure 2: Historical measurements of pollution (black smoke and SO2) by station treatment status.\n\n|Pollutant|Control|Control|Treated|Treated| | |\n|---|---|---|---|---|\n| |Black smoke| | |Sulphur dioxide|\n|500| | | | |\n|400| | | | |\n|300| | | | |\n|200| | | | |\n|100| | | | |\n|0| | | | |\n\nHistorical measurements of pollution (black smoke and SO2) from 1962 to 1973 averaged over stations by treatment status and year-month. Average for treated stations in grey and average for control stations in black. Dashed lines show long term trends by group using locally weighted polynomial regression (LOESS).\n\nIn addition to defining treated pollution measurement stations as those located inside a SCA, we also construct an indicator for stations that are downwind of a SCA. Using the historical wind direction data from ERA5, we construct vectors of SCAs’ prevailing wind directions in the two years prior to their submission, and use them to simulate the boundaries of pollution dispersion from the SCAs. We then classify as downwind any stations that are located within the dispersion boundary but outside the boundary of the originating SCA. We detail this procedure, and explore the robustness of our estimates to alternative approaches, in Appendix C."
    },
    {
        "id_": "84bc1cbb-f4c7-455a-bd1e-966071a53473",
        "text": "# 3.4. Individuals\n\nTo examine the long-term impact of the introduction of SCAs on individuals’ human capital and health outcomes, we use the UK Biobank: a large prospective, population-based cohort living in the United Kingdom. Baseline information on approximately 500,000 individuals was collected between 2006 and 2010, when they were 40–69 years old. Participants are born between 1938.\n\n13"
    },
    {
        "id_": "12854548-8f07-4141-9a09-84998293374f",
        "text": "and 1971, with the majority in the 1940s to mid 1960s. The UK Biobank is not representative, with individuals being on average healthier and wealthier than the general UK population (Fry et al., 2017). The data include detailed information on demographics, physical and mental health, cognition, and economic outcomes, obtained via interviews, questionnaires, and measurements taken by nurses. The data have also been linked to hospital and mortality records.\n\nWe use individuals’ location of birth (i.e., eastings and northings) to assign them to SCAs and CBs by projecting their birth locations onto our digitised SCA boundaries and the 1971 CB boundaries, respectively. We classify individuals born in CBs that never introduced an SCA as ‘never-treated’ (controls), and those born inside SCA boundaries as treated, depending on their dates of birth. Analogous to the sample construction for the pollution panel, when a CB is only partially covered by one (or more) SCAs, we define individuals born inside the CB but outside the SCA boundaries as never treated and explore the robustness of our results to dropping the latter group altogether.\n\nTo study the consequences of smoke control on human capital and health production, we focus on four broad outcomes motivated by the existing literature on the early-life pollution environment. First, building on the literature on pollution exposure and individuals’ health (see e.g., Currie and Walker, 2011), we rely on birth weight and adult height as two general indicators of early- and later-life health and development, allowing us to examine both the short and long-term impacts of pollution along these dimensions. Second, following the literature on the effects of pollution exposure and human capital production (see e.g., Isen et al., 2017; Ball, 2018; Persico, 2020; von Hinke and Sørensen, 2023), we explore individuals’ years of education and fluid intelligence.\n\nOur measure of birth weight is self-reported and therefore likely to be measured with error, while adult height was measured by a nurse following a standardised protocol.11 We define years of education using individuals’ qualifications, and measure fluid intelligence using a battery of questions designed to measure logic and reasoning ability, independent of acquired knowledge.\n\n11Despite birth weight being self-reported at a later age, it has been shown to correlate with a range of covariates in the expected direction (e.g., with non-singleton pregnancies, gender, maternal smoking) and it has good reliability (Tyrrell et al., 2013; Zhang et al., 2021)."
    },
    {
        "id_": "b2e5dba7-b042-4a9d-914c-4c0b81d7553c",
        "text": "We standardise the latter with mean zero and standard deviation one.12\n\nStarting with 444,707 individuals with non-missing data on birth location and year-month of birth, we restrict our estimation sample as follows. First, we drop individuals who are born before September 1957, as this coincides with the UK education reform that raised the minimum school leaving age, affecting individuals’ education, income and potentially health outcomes (Harmon and Walker, 1995; Clark and Royer, 2013; Davies et al., 2018).13 We also drop the last two birth cohorts born in 1970 and 1971 as they are more selected and very small compared to earlier cohorts (van den Berg et al., 2023). This leaves us with 113,704 participants. Second, since we observe exact Smoke Control Area boundaries in County Boroughs only, we restrict our sample to individuals born in adopting or non-adopting CBs, reducing our sample to 41,329 individuals. Third, we restrict our sample to individuals with a precisely measured birth location, leaving 16,573 individuals.14 Our final sample size then ranges between 5,749 and 16,535 depending on the number of missing values for our outcome of interest. In the robustness analysis, we also use an auxiliary sample where we take our data on the universe of SCAs to identify individuals born in districts that never introduced any SCA and include these participants in the never-treated group, increasing the sample size to between 9,868 and 25,410 individuals, depending on the frequency of missing data on the outcome."
    },
    {
        "id_": "77dd24b8-dde3-45ad-b613-60482fd720a0",
        "text": "# 1. Descriptive Statistics\n\nPanel A of Table 1 presents the individual-level descriptive statistics from the UK Biobank, showing that approximately 45% of the sample is male, and individuals have just over 13 years of schooling, on average. The average birth weight is 3.3 kg, with an average height of 170 cm. We do not find strong differences between the treated and control groups, defined as individuals born.\n\n12 Table A.1 shows how we map qualifications to years of education using a definition similar to that of, e.g., Rietveld et al. (2013) and Okbay et al. (2022).\n\n13 Note that although the pollution analysis is restricted to the years 1962 onwards due to the absence of pollution data in never-treated CBs pre-1962, we do not apply this restriction to the individual-level analysis. Indeed, we obtain intention-to-treat estimates for the latter, examining the impact of the introduction of SCAs, as opposed to estimating the direct effect of a reduction in pollution. Hence, we use those born between September 1957 and the end of 1969 for the individual-level analysis.\n\n14 UK Biobank participants who could not report their birth location with any precision (e.g., areas within a larger town or city) were assigned a catch-all location in the approximate centre of the town or city. We drop these individuals since we rely on relatively precise birth location reports, e.g., distinguishing between two individuals born in the same CB but one inside and the other outside an SCA. However, our results are robust to including them in our estimation sample (see Section D.2). Note that birth locations are reported with 1km resolution."
    },
    {
        "id_": "8e83e0c6-7d25-411c-9864-61005b4274fc",
        "text": "# Table 1: Descriptives\n\n|Full sample|Treated|Control|Mean|SD|Obs.| | | | | | |\n|---|---|---|---|---|---|---|---|---|---|---|---|\n| |Mean|SD|Obs.|Mean|SD|Obs.|Mean|SD|Obs.| | |\n|Panel A – Individuals| | |0.453|0.498|11,974|0.455|0.498|3,968|0.452|0.498|8,006|\n|Male|3.317|0.612|8,528|3.320|0.623|2,883|3.316|0.607|5,645| | |\n|Birth weight, kg|169.919|9.260|11,952|169.918|9.270|3,962|169.919|9.256|7,990| | |\n|Adult height, cm|13.235|2.123|11,719|13.124|2.099|3,827|13.289|2.132|7,892| | |\n|Educational attainment, years|6.233|2.158|4,115|6.140|2.114|1,533|6.288|2.183|2,582| | |\n|Fluid intelligence, sd| | |103.767|99.870|26,302|110.920|100.874|8,855|100.137|99.162|17,447|\n|Panel B – Pollution|132.721|90.312|26,195|148.888|94.864|8,804|124.536|86.779|17,391| | |\n\nPanels: (a) descriptives calculated on individual-level data, (b) descriptives calculated on pollution data.\n\nPanel B of Table 1 presents the descriptive statistics of the pollution measurements, indicating average black smoke and sulphur dioxide concentrations of 104 mcg/m3 and 133 mcg/m3 respectively. Consistent with Figure 2, pollution measurements are higher in treated compared to control areas, defined as measurement stations that are located in and outside the SCA boundaries, respectively."
    },
    {
        "id_": "deb52a6d-6cc8-4f03-ab6b-2024d32a24df",
        "text": "# 4. EMPIRICAL STRATEGY\n\nThe first part of our analysis explores whether smoke control areas served their intended purpose of reducing air pollution, especially black smoke emissions, by estimating the impact of the introduction of SCAs on local pollution levels. The second part then explores the long-term consequences of smoke control on individuals’ human capital and health outcomes. The unit of interest in these two sections is the pollution station and the individual, respectively. For brevity, this Section refers to both as ‘unit’. Our identification exploits spatial and time variation in the roll-out of SCAs, comparing the outcomes of these ‘units’ (i.e., pollution levels or individual-level outcomes) located in a SCA before and after its creation, relative to those of a control group of ‘never-treated’ units. In our main analysis, we define the latter as units in non-adopting CBs as well as units located outside SCA boundaries but in adopting CBs. Since the latter may be affected by spillover (downwind)"
    },
    {
        "id_": "76d95816-493d-431e-98eb-95bcf433fea7",
        "text": "# Effects from Neighbouring SCAs\n\nWe also run our analysis dropping these units altogether and find very similar results."
    },
    {
        "id_": "5b71489d-4fe7-4260-898e-7436ab42e906",
        "text": "# Event of Interest\n\nOur ‘event’ of interest is the date on which SCAs are submitted to the Ministry. We focus on this date for two reasons. First, the proposed operation date was published at the time of submission, indicating when the area is most likely to become smokeless. Second, local councils reimbursed costs associated with stove conversions only if they were incurred before the operation date (see Section 2). Hence, households started requesting conversions immediately after the submission date."
    },
    {
        "id_": "62ca1162-619c-440f-a17b-b6f69439ef79",
        "text": "# Identification Assumptions\n\nOur identification assumes that, conditional on controls and fixed effects, the timing of the introduction of smoke control areas was random, and that the areas selected to be smokeless were not systematically different from those not selected. We explore both of these assumptions in detail in Appendix B."
    },
    {
        "id_": "cda94608-4e7c-44dd-b8b5-a4ceae68ba54",
        "text": "# Pre-Programme Characteristics\n\nFirst, we explore associations between pre-programme CB-level characteristics (i.e., population density, pollution levels, and socioeconomic composition) and the timing of SCA implementation, showing that apart from population density, these variables do not explain differences in the timing of SCA introduction, suggesting that the timing was largely random."
    },
    {
        "id_": "eedadf17-5c50-4fd7-9131-b0391f0b2bfe",
        "text": "# Systematic Differences\n\nSecond, we investigate whether stations and individuals inside SCAs were systematically different from those outside SCAs, but within the same CB. Although Figure 2 shows that treated stations on average report higher levels of pollution (i.e., between-CBs), we find that areas that are selected to become smokeless were slightly less polluted compared to those not selected within the same CB. Furthermore, our results suggest that residents in areas that were put under smoke control were of higher socio-economic status compared to those in control areas.\n\nTo alleviate concerns about these differences driving our findings, we include station/area fixed effects as well as station/area-specific trends in our analyses, accounting for systematic differences between areas that did and did not become smokeless within CBs.\n\n17"
    },
    {
        "id_": "0f3da0db-cd19-4503-b361-85022db540fc",
        "text": "# 4.1. Impact on pollution\n\nTo estimate the impact of the introduction of SCAs on local pollution levels, we estimate a two-way fixed effects model of the form:\n\nyst = ωs + εt + ϑst + Dst + ϖst (1)\n\nwhere yst denotes the average pollution measurement (i.e., black smoke or sulphur dioxide) at station s in year-month t. The parameters ωs and εt denote station and year-month fixed effects to account for systematic variation in pollution (or population density; see Appendix B) between stations, across time and for seasonality, and ϑt denotes station-specific linear trends. We consider three specifications of the term Dst. First, a dynamic event study specification, where Dst = ∑ϑ↑T ϱϑ SCAϑ, and SCAst is an indicator denoting whether station s in year-month t is ϑ months away from being treated (i.e., submitted to the Ministry) and where the month before submission (ϑ = ↓1) is the reference month.15\n\nSecond, a static difference-in-difference approach, where Dst = ϱAdj Insides ↔ Adjst + ϱPost Insides ↔ Postst. We define Insides to be an indicator that is equal to one if the location of the measurement station is inside the exact SCA boundary, and zero otherwise.16 Adjst is a dummy that is equal to one when the SCA in which pollution station s is located has been submitted to the Ministry, but not yet entered operation (we refer to this as the ‘adjustment period’), and zero otherwise. Its coefficient ϱAdj captures any immediate drops in pollution levels following submission of the SCA as well as gradual reductions in pollution in the period between submission and operation when appliances were being upgraded to allow for smokeless fuel. Postst is a dummy equal to one when the SCA in which pollution station s is located started operating, and zero otherwise. Its coefficient ϱPost then captures the overall impact of a fully operating SCA on local pollution levels, relative to other stations that are not located within an SCA. This specification allows for differential impacts.\n\n15 We trim our sample to five years (60 months) before and after treatment for each station, though our results are robust to not trimming the sample or trimming more/fewer years (see Section D.3).\n\n16 Note that Insides only enters our specification interacted with other dummies, as the main term would be absorbed into the station fixed effects that we include in all specifications."
    },
    {
        "id_": "c7d9d673-3114-425f-921b-838cc91859a8",
        "text": "of the adjustment period and that post-operation. Many CBs introduced multiple SCAs at different points in time. Although a station can only be within one SCA, they can be downwind of multiple SCAs given that pollution disperses along the wind direction vector. To investigate the importance of such spillovers, our third specification therefore allows for downwind stations to be differentially affected such that Dst = ϱAdj Inside s ↔ Adjst + ϱPost Inside s ↔ Postst + ϱAdj,DW Downwind s ↔ Adjst DW + ϱPost,DW Downwind s ↔ Postst DW. The terms Adjst and Postst are defined in the same way as in the previous specification, and Downwinds is a dummy for the station being downwind of any SCA. The binary indicator Adjst DW (PostDW) is equal to one when the upwind SCA enters the adjustment period (becomes operational) and zero otherwise.\n\nWe estimate Equation 1 using OLS, and – considering the recent literature on staggered treatments (Sun and Abraham, 2021; Callaway and Sant’Anna, 2021; Borusyak et al., forthcoming) – we also report the group-time average effects in Appendix E, finding very similar results. We cluster our standard errors by station throughout."
    },
    {
        "id_": "1132d00e-cf5d-492d-b9ab-7717e1f161d4",
        "text": "# 4.2. Individual-level analysis\n\nTo estimate the effect of the introduction of SCAs on individual human capital and health outcomes, we follow an approach analogous to the previous section but at the individual-level:\n\nyijt = ςj + εt + ϑjt + Dijt + ωxijt + ϖijt (2)\n\nwhere yijt is the outcome for individual i, born in area j in year-month t. The area is defined as [CB ↔ Inside], allowing for differences in areas that did and did not become SCAs within a CB. Hence, ςj are [CB ↔ Inside] fixed effects, controlling for spatial variation in the outcomes of interest (and accounting for systematic differences in socio-economic composition of treated and control areas within a CB; see Appendix B), εt are year-month fixed effects controlling for differences across cohorts and seasonality, and ϑjt are (CB ↔ Inside)-specific linear (yearly) time trends. The latter account for differential dynamics in outcomes across CBs, as well as within CBs across areas that"
    },
    {
        "id_": "57332383-8e03-4b67-aa29-b5c43520eee6",
        "text": "did and did not become smokeless.17\n\nThe vector *xijt* denotes additional covariates (sex, ethnicity and weather conditions in utero and in childhood) capturing further variation within CBs."
    },
    {
        "id_": "3627036f-10e3-42c1-bd54-029a65f67060",
        "text": "# 1. Definitions of Dijt\n\nWe explore two definitions of the term Dijt. First, a dynamic event specification where we set Dijt = ∑ *ϑ↑T ϱϑ SCAϑ, and define SCAijt to be an indicator that is equal to one if the relative number of six months intervals between conception and SCA submission is equal to ϑ*, and the individual is born within the exact boundaries of an SCA.18\n\nThe parameters *ϱϑ then compare the outcomes of interest for individuals born in SCAs and conceived at time ϑ relative to SCA submission, to those conceived at the same calendar time but outside smoke control areas. The parameters ϱϑ capture differences in the outcome of interest for individuals conceived prior to SCA submission. As ϑ grows in negative direction, individuals are exposed to increasing durations of pollution exposure in early childhood as they were born before SCA submission. This means that, depending on the dose-response relationship, as well as the timing of exposure relative to age, there may be heterogeneity in the estimates across different (negative) values of ϑ. For positive values of ϑ, the parameters ϱϑ* capture post-SCA submission differences in outcomes, relative to those conceived outside SCAs."
    },
    {
        "id_": "0d981097-3fef-4b9e-8017-997aed1416d2",
        "text": "# 2. Static Difference-in-Difference Specification\n\nSecond, we consider a static difference-in-difference specification where Dijt = *Adjijt + ϱPost Inside ↔ Postijt. We define Adjijt to be a dummy that is equal to one when the SCA surrounding the individual has been submitted but not yet entered operation (i.e., the ‘adjustment period’), and zero otherwise. Similarly we define Postijt as a dummy equal to one after the SCA has started operating, zero otherwise. This allows us to estimate the overall impact of smoke control on individuals’ outcomes, differentiating between the impact of being conceived during the adjustment period (when appliances are gradually replaced and pollution declining) captured by ϱAdj, and the impact during the period after SCAs are in operation, captured by ϱPost*.19\n\n17 We show in Section D.5 that our results are robust to using CB-specific trends or not including a trend. We trim our sample to birth cohorts within five years (60 months) of treatment to be consistent with the pollution analysis, though our results are similar to not trimming the sample or trimming more/fewer years (see Section D.3).\n\n18 For example, if an individual is conceived in an SCA six months before its submission date, SCAijt *ϑ=↓1 with SCAϑ ijt = 0 for all other ϑ. Similarly, if an individual is conceived in an SCA 12 months after its submission, SCAϑ=2 = 1 and SCAijt = 0 for all other values of ϑ*.\n\n19 We do not separately report the estimates for individuals being in and downwind of an SCA. Indeed, as we show below, we find no strong impact of the introduction of SCAs on pollution measurements in stations that are downwind.\n\nFor *ϑ < 0 the prior to ϱAdj Inside* ↔\n\n* = 1*"
    },
    {
        "id_": "157c09ee-2655-45bf-b988-8305e0c898f6",
        "text": "# 5. RESULTS\n\nWe first use our pollution panel to examine the impact of the introduction of SCAs on local pollution levels. Next, we use individual-level data to investigate the immediate and long-term effects on individuals’ health and human capital outcomes."
    },
    {
        "id_": "1411681f-ed0d-4b2c-8f97-02bc75c13158",
        "text": "# 5.1. Impact on pollution\n\nFigure 3 plots the dynamic event study estimates of ϱ ϑ from Equation 1, showing the time-varying impacts of the introduction of SCAs on local black smoke (left) and sulphur dioxide (right) levels. The first vertical line denotes our event of interest: the SCA submission date. The average duration between submission and operation (what we refer to as the ‘adjustment period’) in our sample is 16 months; this is reflected by the second vertical line (the end of the ‘adjustment period’).\n\nThe figures suggest no evidence of differential pre-trends in pollution levels across treated and control stations for both black smoke and sulphur dioxide. With the submission of an SCA, we find an immediate drop in levels of black smoke of about 10 mcg/m3, reducing further over time and settling at just under 30 mcg/m3. The drop remains visible until at least five years after submission. The submission (and subsequent operation) of a SCA shows no visible impact on sulphur dioxide levels. Although this may seem surprising, it is consistent with the descriptive analysis in Figure 2 as well as with expectations at the time. First, smoke control areas targeted visible (black) smoke emitted from chimneys rather than specific pollutants such as sulfur dioxide that could only be observed using suitable instrumentation (and which was not the local government focus). Second, traditional and solid smokeless fuels had similar sulfur contents and thereby released similar amounts of sulphur dioxide when burned.\n\nTo quantify the impact on pollution, we also present the difference-in-difference estimates from the SCA, suggesting that the introduction of smoke control areas mainly affected local pollution.\n\n20 This period differs across SCAs; we plot the distribution of months between the submission and operation date in our data in Figure A.2."
    },
    {
        "id_": "f1ba6529-7da3-4978-925d-cdc515b516ef",
        "text": "# Figure 3: Event estimates – Impact on local pollution levels.\n\n|Estimate, mcg per cubic metre| | | | | | |Black smoke| | |Sulphur dioxide| | |\n|---|---|---|---|---|---|---|---|---|---|---|---|---|\n| | | |Before| | | | |Adj.|After|Before|Adj.|After|\n|20|0|-20|-40|-605448423630241812−6−−|-|-| | | | | | |\n|0|6121824303642485460|-605448423630241812−6−−|-|-|-| | | | | | | |\n\nMonths relative to submission of SCA\n\nOLS event estimates showing the impact of smoke control on individuals. OLS specification includes year-by-month and station fixed effects, and includes a station-specific yearly linear time-trend to capture differences in linear dynamics between stations. Control group consists of never-treated stations from both adopting and non-adopting county boroughs.\n\nTrims the sample to 5 years before and after the SCA submission date, and restricts the sample to pollution data for years 1962 to 1973. The dashed red lines indicate the average of the pre- and post-adjustment period estimates, where the former are averaged to zero. The grey part refers to the adjustment period. Clusters standard errors by station.\n\nEquation 1 with a binary indicator for the pollution station being inside an SCA. Table 2 reports the OLS estimates of the introduction of SCAs on the local levels of black smoke (Columns 1–2) and sulphur dioxide (Columns 3–4) aggregated across all post-periods. Note here that the variable Post st is specific to the measurement station (rather than taking the average duration of the adjustment period of 16 months that is shown in grey in Figure 3). Columns 1 and 3 show that the submission of SCAs caused black smoke concentrations to drop by 8 mcg/m3 on average, with no significant changes in levels of sulfur dioxide. Given mean black smoke levels of 104 mcg/m3 prior to the introduction of SCAs, this is an →8% reduction. Black smoke concentrations drop by approximately 19 mcg/m3 (18%) once the SCA is in operation. Distinguishing between pollution measurements that are taken inside SCAs and those downwind, Column 2 shows that the treatment effect for black smoke is primarily driven by the former, with no significant reductions in pollution."
    },
    {
        "id_": "d1ee97ab-6dad-4aa2-a820-7a78c5888088",
        "text": "# Table 2: Difference-in-difference estimates – Impact on pollution.\n\n|Depedent variable:|(1) Black smoke|(2) Black smoke|(3) Sulphur dioxide|(4) Sulphur dioxide|\n|---|---|---|---|---|\n|Inside ↔ Adj.|↓8.053 ↗↗↗|↓7.866 ↗↗↗|↓1.180|↓1.148|\n| |(3.010)|(3.031)|(3.740)|(3.747)|\n|Inside ↔ Post|↓19.737 ↗↗↗|↓19.811 ↗↗↗|↓3.480|↓3.677|\n| |(4.380)|(4.425)|(5.337)|(5.347)|\n|Downwind ↔ Adj.| |↓1.032| |↓6.245|\n| | |(3.727)| |(4.743)|\n|Downwind ↔ Post| |↓8.225| |↓7.317|\n| | |(5.631)| |(6.441)|\n|Observations|26,302|26,302|26,195|26,195|\n|Mean dep. var.|103.767|103.767|132.721|132.721|\n|R2|0.81|0.81|0.79|0.79|\n\nColumns: (1-2) level of black smoke, (3-4) level of sulphur dioxide.\n\nControl group consists of never-treated from both adopting and non-adopting county boroughs. Clusters standard errors by station. Includes year-by-month and station fixed effects, and includes a station-specific yearly linear time-trend to capture differences in linear dynamics between stations. Trims the sample to 5 years before and after the SCA submission date, and restricts the sample to pollution data for years 1962 to 1973. (*): p &lt; 0.1, (**): p &lt; 0.05, (***): p &lt; 0.01.\n\nfor downwind areas, though the sign of both estimates is negative.21\n\n21 Table A.3 in Appendix A explores the robustness of these findings by specifying alternative treatment variables: (1) the number of square kilometres (km2) of SCA surrounding a pollution station and the number of km2 of SCA upwind of the station, and (2) the sum of the two. These specifications are likely to be less precise, since the SCA km2 is not necessarily a good proxy for the number of dwellings affected (and therefore of actual pollution exposure).2 While the estimates have large standard errors and are not statistically significant, they suggest that an additional km of SCA is negatively related to black smoke concentrations, with more mixed results for sulphur dioxide.\n\n23"
    },
    {
        "id_": "25b8549f-3c86-4538-b298-d0e334e73970",
        "text": "# 5.2. Impact on individuals\n\nWe next examine how the introduction of smoke control areas and the subsequent reduction in local pollution translates into individual outcomes by plotting the dynamic event study estimates of ϱϑ from Equation 2. Figure 4 shows the impact of smoke control areas on individuals’ birth weight and adult height, while Figure 5 reports the estimates for years of schooling and (standardised) fluid intelligence. The red dashed line before and after the adjustment period denotes the average of the pre- and post-adjustment period estimates."
    },
    {
        "id_": "a3cc0a87-18a1-4964-99e9-e9ffd2e92341",
        "text": "# Figure 4: Event estimates – Impact on individuals.\n\n|Birth weight (kg)|Conceived before|Adj.|Conceived after| | | | |\n|---|---|---|---|---|---|---|---|\n|0.2|0.1|0.0| | | | | |\n|Height (cm)|Conceived before|Adj.|Conceived after| | | | |\n| |2|1|0| | | | |\n\nOLS event estimates showing the impact of smoke control on individuals. OLS specification includes year-by-month and (CB ↔ Inside) fixed effects, and includes (CB ↔ Inside)-specific linear time trends. Control group consists of never-treated individuals from both adopting and non-adopting county boroughs. Trims the sample to 5 years before and after the SCA submission date, and restricts the sample to birth cohorts in years 1958 to 1969. The dashed red lines indicate the average of the pre- and post-adjustment period estimates, where the former are averaged to zero. The grey part refers to the adjustment period. Clusters standard errors by CB.\n\nFigure 4 shows no evidence of trends in birth weight or adult height for individuals conceived prior to the SCA submission date. This is expected for birth weight, since these children were only exposed to the SCA in childhood and birth weight cannot be affected by changes in pollution after birth. Instead, we find that the birth weights of individuals conceived after the SCA operation."
    },
    {
        "id_": "853ebec2-ddf0-401f-b80f-f98d8167c779",
        "text": "# Event estimates – Impact on individuals"
    },
    {
        "id_": "ab64d7b6-ec08-4d9f-b586-fcc6d44e9b38",
        "text": "# Figure 5\n\nFigure 5 presents the same estimates but for years of education and fluid intelligence. This shows no evidence that the introduction of SCAs – whether during the in utero or in childhood period – impacts on these human capital outcomes, with average estimates around zero.\n\n|Educ. attain.|Conceived before| |Conceived after| | | | | |\n|---|---|---|---|---|---|---|---|---|\n| | |Adj.| |0.50|0.25|0.00| | |\n| | | | |0.5| | | | |\n|0.0| | | | | | | | |\n|−0.5| | | | | | | | |\n\nOLS event estimates showing the impact of smoke control on individuals. OLS specification includes year-by-month and (CB ↔ Inside) fixed effects, and includes (CB ↔ Inside)-specific linear time trends. Control group consists of never-treated individuals from both adopting and non-adopting county boroughs. Trims the sample to 5 years before and after the SCA submission date, and restricts the sample to birth cohorts in years 1958 to 1969. The dashed red lines indicate the average of the pre- and post-adjustment period estimates, where the former are averaged to zero. The grey part refers to the adjustment period. Clusters standard errors by CB.\n\nTo further quantify the average impact on individuals’ human capital and health, we also present the difference-in-difference estimates from Equation 2, using a binary indicator that equals one if the individual is conceived within the boundaries of an SCA during the adjustment or operation period, relative to those conceived outside the SCA boundary at these times. Table 3 confirms the event study estimates, showing that – compared to those who are conceived prior to SCA submission – the birth weights of those conceived when the SCA is in operation are 60g higher."
    },
    {
        "id_": "251b4145-7038-4776-aed5-9cdd2dc625cc",
        "text": "# 5.2.1. Heterogeneity by gender\n\nThe existing literature suggests that males are more susceptible to environmental insults in early life. Hence, we next explore whether there are gender differences in the impacts of smoke control. A priori it is not clear whether we would expect to find different impacts of smoke control for individuals."
    },
    {
        "id_": "407205ba-36a6-4d9d-8644-b62a92bc5ada",
        "text": "# Table 3: Difference-in-difference estimates – Impact on individuals.\n\n|Dependent variable:|(1) Birth weight|(2) Adult height|(3) Educ. attain.|(4) Fluid intelligence|\n|---|---|---|---|---|\n|Inside ↔ Adj.|0.039|0.365|0.040|↓0.152|\n| |(0.034)|(0.343)|(0.178)|(0.131)|\n|Inside ↔ Post|0.058↗↗|0.942↗↗↗|↓0.025|0.035|\n| |(0.027)|(0.180)|(0.135)|(0.065)|\n|Observations|8,510|11,922|11,689|4,106|\n|Mean dep. var.|3.317|169.917|13.236|0.000|\n|R²|0.066|0.543|0.107|0.149|\n\nColumns: (1) birth weight in kilograms, (2) adult height in centimeters, (3) years of education, (4) standardised fluid intelligence score. OLS specification includes year-by-month and (CB ↔ Inside) fixed effects, and includes (CB ↔ Inside)-specific linear time trends. Controls for sex, ethnicity, and weather in utero and during childhood. Control group consists of never-treated individuals from both adopting and non-adopting county boroughs. Trims the sample to five years before and after the SCA submission date, and restricts the sample to birth cohorts in years 1958 to 1969. Clusters standard errors by CB. (*): p < 0.1, (**): p < 0.05, (***): p < 0.01.\n\nIn Table A.4 we show the impact on the probability of being born with low birth weight (< 2, 500g). While these point estimates are negative, suggesting slight reductions in this risk of about 2 percentage points, they are not significant. This suggests that the impact we find on birth weight is not driven specifically by improvements among low birth weight individuals, but rather a general shift of the birth weight distribution.\n\nTable A.5 decomposes the total years of education into binary indicators for specific qualifications. This shows suggestive evidence that the introduction of SCAs decreased the probability of exiting the education system with lower secondary qualifications, while it increased the probability of obtaining an upper secondary degree, though the latter is not significant."
    },
    {
        "id_": "70114699-6545-47ae-9875-6149547c6d04",
        "text": "men and women. On the one hand, if a reduction in pollution has a larger impact on male infant mortality due to them being weaker on average, it may increase the probability of survival of weaker boys, leading to a drop in average male birth weights. On the other hand, holding the survival rate constant, a reduction in pollution may help vulnerable populations more, increasing male birth weights."
    },
    {
        "id_": "dadbd482-94fb-4d97-bce7-912daf639b92",
        "text": "# 4. Gender Differences in Birth Weights\n\nTable 4 shows the estimates when we split the sample by gender. We find that the introduction of SCAs benefits males’ birth weights more than females’, with the former seeing an increase of 126 grams on average, while females see a modest rise of 21 grams.24 We find no strong gender differences for adult height with both genders experiencing an average increase of about 1 cm. Similarly, and consistent with the main analyses, we do not find strong evidence of impacts on educational attainment and fluid intelligence.\n\n24 This is consistent with the above example that holds survival rates constant. To explore this empirically, we examine the impact of smoke control on the probability of being female, shown in Table A.6. These results indicate that there are no gender-specific mortality impacts, and therefore provide suggestive evidence that the gender-specific estimates for our main outcomes are not driven by mortality selection. One plausible explanation for the bigger increase in male birth weights is therefore that the reduction in pollution disproportionally helps male (as opposed to female) growth.\n\n27"
    },
    {
        "id_": "c129ef5c-e37e-4d41-9361-7214ed744e07",
        "text": "# Table 4: Difference-in-difference estimates – Impact on individuals.\n\n|Dependent variable:|(1) Birth weight|(2) Adult height|(3) Educ. attain.|(4) Fluid intelligence| |\n|---|---|---|---|---|---|\n|Panel A – Female|Inside ↔ Adj.|0.011|0.618|↓0.006|↓0.187|\n| |(0.037)|(0.470)|(0.268)|(0.158)| |\n| |Inside ↔ Post|0.021|1.097 ↗↗↗|0.087|0.023|\n| |(0.038)|(0.309)|(0.180)|(0.095)| |\n| |Observations|5,031|6,522|6,390|2,280|\n| |Mean dep. var.|3.244|163.845|13.248|0.000|\n| |R²|0.079|0.071|0.118|0.213|\n|Panel B – Male|Inside ↔ Adj.|0.090|0.091|0.120|↓0.075|\n| |(0.058)|(0.591)|(0.093)|(0.079)| |\n| |Inside ↔ Post|0.126 ↗↗|0.948 ↗↗|↓0.138|0.041|\n| |(0.050)|(0.431)|(0.175)|(0.069)| |\n| |Observations|3,479|5,400|5,299|1,826|\n| |Mean dep. var.|3.424|177.250|13.221|0.000|\n| |R²|0.102|0.092|0.154|0.233|\n\nColumns: (1) birth weight in kilograms, (2) adult height in centimeters, (3) years of education, (4) standardised fluid intelligence score. Panels show estimates using subsamples of (A) females and (B) males. OLS specification includes year-by-month and (CB ↔ Inside) fixed effects, and includes (CB ↔ Inside)-specific linear time trends. Controls for sex, ethnicity, and weather in utero and during childhood. Control group consists of never-treated individuals from both adopting and non-adopting county boroughs. Trims the sample to five years before and after the SCA submission date, and restricts the sample to birth cohorts in years 1958 to 1969. Clusters standard errors by CB. (*): p < 0.1, (**): p < 0.05, (***): p < 0.01."
    },
    {
        "id_": "c3ec304d-37d6-4722-820c-a371d50ff8ab",
        "text": "# 5.2.2. Heterogeneity by individuals’ genetic “endowments”\n\nNext, we examine heterogeneity by individuals’ genetic “endowments”, as measured by one’s polygenic score (or polygenic index) that is specific to the outcome of interest. As highlighted in the introduction, this analysis not only sheds light on the impact of smoke control on population inequalities, but is also informative about the existence of complementarities between endowments and public health investments and contributes to the debate about the importance of effort and\n\n28"
    },
    {
        "id_": "abcd8d15-a813-4cff-acc3-e51b7c155307",
        "text": "circumstance in shaping individuals’ outcomes. We construct proxies for individuals’ genetic “endowment” by running a Genome-Wide Association Study (GWAS) for each of our main outcomes in the UK Biobank, using only individuals who are not in (or related to individuals in) our main analysis sample. We then use these summary statistics to construct polygenic scores (PGS) for each outcome for the individuals in our analysis sample. We standardise all polygenic scores to have zero mean and unit variance in the analysis sample. We discuss the polygenic score construction in more detail in Appendix F, and report their predictive power in Table F.2."
    },
    {
        "id_": "dd5f97bc-8b5a-46f7-9afc-9c1d8d9b6444",
        "text": "# Table 5: Difference-in-difference estimates – Impact on individuals.\n\n|Dependent variable:|(1) Birth weight|(2) Adult height|(3) Educ. attain.|(4) Fluid intelligence|\n|---|---|---|---|---|\n|Inside ↔ Adj.|0.039|0.561 ↗|0.050|↓0.114|\n| |(0.032)|(0.294)|(0.152)|(0.108)|\n|Inside ↔ Post|0.044↗|0.778↗↗↗|↓0.011|0.071|\n| |(0.025)|(0.221)|(0.103)|(0.077)↗|\n|Inside ↔ Adj. ↔ PGS|↓0.017|0.574↗↗|↓0.158↗|0.106|\n| |(0.040)|(0.250)|(0.088)|(0.056)|\n|Inside ↔ Post ↔ PGS|0.043↗|↓0.029|0.033|0.034|\n| |(0.025)|(0.168)|(0.055)|(0.060)↗↗↗|\n|PGS|0.102↗↗↗|3.706↗↗↗|0.562↗↗↗|0.236|\n| |(0.008)|(0.056)|(0.020)|(0.020)|\n|Observations|7,982|11,108|11,056|3,825|\n|Mean dep. var.|3.323|170.052|13.234|0.000|\n|R2|0.1|0.702|0.177|0.2|\n\nColumns: (1) birth weight in kilograms, (2) adult height in centimeters, (3) years of education, (4) standardised fluid intelligence score. OLS specification includes year-by-month and (CB ↔ Inside) fixed effects, and includes (CB ↔ Inside)-specific linear time trends. Controls for sex, genetic principal components, and weather in utero and during childhood. All covariates have been normalised to mean zero. Control group consists of never-treated individuals from both adopting and non-adopting county boroughs. Trims the sample to five years before and after the SCA submission date, and restricts the sample to birth cohorts in years 1958 to 1969. Clusters standard errors by CB. (*): p &lt; 0.1, (**): p &lt; 0.05, (***): p &lt; 0.01.\n\nFor each outcome, we add interactions between the two variables of interest and the PGS, capturing the extent to which the introduction of SCAs differentially affected individuals with different genetic “endowments”.25 Table 5 reports the results. We find that the impact of smoke control on\n\n25 Following Keller (2014), we also add interactions between the PGS and all covariates and principal components."
    },
    {
        "id_": "a09619d0-45ff-4616-9fe5-f7f7a03a585d",
        "text": "# 5.2.3. Heterogeneity by socioeconomic status\n\nFinally, we examine whether the policy had differential impacts on individuals depending on the socio-economic composition of their local area. Since the UK Biobank does not have information on the socio-economic status of participants (or their parents), we merge district-level information on occupation from the UK Census to the UK Biobank to classify CBs as either high or low SES. To do this, we calculate the share of CB residents that are in professional, managerial, or technical occupations, and define CBs as high SES if they are above the median share of this distribution across all CBs, or low if they are below the median.\n\nWe estimate our main specification with additional interactions between the variables of interest and the dummy for being born in a low SES area. The results are presented in Table 6. We do not find strong evidence of differential effects by SES for birth weight and height. In contrast, the results suggest that high SES areas experienced an increase in education after SCA submission, with no impacts for lower SES areas, or even a reduction in intelligence relative to those born in higher SES neighbourhoods.\n\nbirth weight is larger for individuals with a high genetic endowment for birth weight, suggesting that this local government pollution reduction programme exacerbated genetic inequalities in birth weight. It is also consistent with the existence of complementarities between endowments and (public health) investments in producing child health: the returns to the investment are larger for those with higher endowments. For height, we see some evidence of complementarities during the adjustment period, but little evidence of heterogeneity in the effect size post SCA operation. Similar to the main analysis, we find no main effect on years of education and intelligence, though some evidence of genetic heterogeneity during the SCA adjustment period. Although these are of opposite sign for education and intelligence, they are only marginally significant, with no impacts post-SCA operation. We are therefore cautious not to overinterpret these."
    },
    {
        "id_": "8362bbfa-0111-4534-9357-6a4025d06599",
        "text": "# Table 6: Difference-in-difference estimates – Impact on individuals.\n\n|Dependent variable:|(1) Birth weight|(2) Adult height|(3) Educ. attain.|(4) Fluid intelligence|\n|---|---|---|---|---|\n|Inside ↔ Adj.|0.059|↓0.054|0.304 ↗↗↗|0.091|\n| |(0.036)|(0.314)|(0.077)|(0.066)|\n|Inside ↔ Post|0.019|1.025 ↗↗↗|0.157|0.045|\n| |(0.027)|(0.201)|(0.101)|(0.074)|\n|Inside ↔ Adj. ↔ Is low SES|↓0.028|0.691|↓0.477↗|↓0.422 ↗↗↗|\n| |(0.065)|(0.609)|(0.255)|(0.157)|\n|Inside ↔ Post ↔ Is low SES|0.070|↓0.104|↓0.359↗|↓0.035|\n| |(0.048)|(0.333)|(0.196)|(0.139)|\n|Observations|8,510|11,922|11,689|4,106|\n|Mean dep. var.|3.317|169.917|13.236|0.000|\n|R2|0.068|0.544|0.109|0.152|\n\nColumns: (1) birth weight in kilograms, (2) adult height in centimeters, (3) years of education, (4) standardised fluid intelligence score. OLS specification includes year-by-month and (CB ↔ Inside) fixed effects, and includes (CB ↔ Inside)-specific linear time trends. Controls for sex, genetic principal components, and weather in utero and during childhood. All covariates have been normalised to mean zero. Control group consists of never-treated individuals from both adopting and non-adopting county boroughs. Trims the sample to five years before and after the SCA submission date, and restricts the sample to birth cohorts in years 1958 to 1969. Clusters standard errors by CB. (*): p &lt; 0.1, (**): p &lt; 0.05, (***): p &lt; 0.01."
    },
    {
        "id_": "bf423421-b723-48f0-8b80-cc46bbb8e987",
        "text": "# 6. ROBUSTNESS\n\nOur main analysis shows that the introduction of SCAs substantially and persistently reduced black smoke emissions, but did not impact local sulphur dioxide concentrations. This in turn improved child health outcomes (in particular birth weight), with longer-term impacts on adult height. However, we find no consistent evidence of impacts on economic outcomes, including years of education and intelligence.\n\nThis section highlights that our findings are generally robust to a range of different specifications, samples and assumptions. We discuss these sensitivity checks in detail in Appendix D, but summarise them graphically in Figure 6. The figure shows six panels for our main outcomes of interest: the two pollution measures and four individual-level outcomes. The dots present the estimates of the impact of exposure during the ‘adjustment period’; the triangles present the estimates for the SCA being in operation. Both are shown with 95% confidence intervals, with opaque colours indicating that they are significantly different from zero. The first row in each panel repli-"
    },
    {
        "id_": "032d79ae-64ef-4bac-80e4-b3c53d3310f9",
        "text": "# Robustness Checks and Specifications\n\nThe following table indicates the main specification, showing significant impacts on black smoke concentrations, as well as birth weight and height (the latter two only for those exposed after the operation date). Each of the following rows correspond to different robustness checks, where the row refers to the specific section in Appendix D.\n\n|Row|Description|\n|---|---|\n|2-4|Use alternative definitions of the control group (Section D.1)|\n|5|Specific to the individual analysis, using alternative definitions of the sample depending on individuals’ geolocation within County Boroughs (Section D.2)|\n|6-8|Explore the sensitivity to different bandwidths around the event time (Section D.3)|\n|10-17|Specific to the individual analysis showing different restrictions of the relevant birth cohorts (Section D.4)|\n|18-19|Show different specifications of the time trend, specifying no time trend, or allowing for a CB-specific annual time trend (Section D.5)|\n\nThe main take-away from Figure 6 is that the estimates are very robust to the use of different specifications, samples, or model assumptions. In almost all specifications, we see a reduction in black smoke concentrations ranging from →10–30 mcg/m3, followed by an approximately 60g increase in birth weight and a 1 cm increase in adult height. We again find no consistent evidence of impacts on years of education, nor on fluid intelligence."
    },
    {
        "id_": "5245275b-5f7a-4c37-a997-1e0df3da7de8",
        "text": "# Figure 6: Overview of robustness checks.\n\n|Coefficient|Inside x Adj.|Inside x Post|Black smoke|Sulphur dioxide|Birth weight (kg)|Height (cm)|Educational attain.|Fluid intelligence|\n|---|---|---|---|---|---|---|---|---|\n|Main specification| | | | | | | | |\n|Non−adopting CBs control group, Sec. D.1| | | | | | | | |\n|Adopting CBs control group, Sec. D.1| | | | | | | | |\n|All non−adopting districts control group, Sec. D.1| | | | | | | | |\n|Include catch−all birth locations, Sec. D.2| | | | | | | | |\n|Trim to 2 years, Sec. D.3| | | | | | | | |\n|Trim to 4 years, Sec. D.3| | | | | | | | |\n|No trimming, Sec. D.3| | | | | | | | |\n|Restrict cohorts to 1958−−1965, Sec. D.4| | | | | | | | |\n|Restrict cohorts to 1958−−1966, Sec. D.4| | | | | | | | |\n|Restrict cohorts to 1958−−1967, Sec. D.4| | | | | | | | |\n|Restrict cohorts to 1958−−1968, Sec. D.4| | | | | | | | |\n|Restrict cohorts to 1959−−1969, Sec. D.4| | | | | | | | |\n|Restrict cohorts to 1960−−1969, Sec. D.4| | | | | | | | |\n|Restrict cohorts to 1961−−1969, Sec. D.4| | | | | | | | |\n|Restrict cohorts to 1962−−1969, Sec. D.4| | | | | | | | |\n|No time trend, Sec. D.5| | | | | | | | |\n|CB−specific yearly trend, Sec. D.5| | | | | | | | |\n\nPlots the point estimates and their 0.95 confidence bands for our main coefficients and outcomes across our various robustness checks. First two columns show estimates from the pollution sample, remaining four columns show estimates from individual sample. For checks that are specific to the individual analysis, we do not report the estimates for the first two columns, but only in the final four (individual-level) columns."
    },
    {
        "id_": "ded703d3-11d7-4083-9391-c1310cf1222c",
        "text": "# 7. CONCLUSION\n\nThis paper examines the long-term effects of a national, large-scale pollution reduction programme that was rolled out in the UK in the late 1950s. We exploit temporal and spatial variation in the introduction of so-called “Smoke Control Areas” (SCAs); areas that banned all smoke emissions within its boundaries. Our identification compares pollution measurement stations (individuals) located (born) in or downwind of SCAs before and after their introduction, relative to those of a control group of never treated stations (individuals), controlling for weather variation, local area fixed effects, area-specific trends (and individual-level controls). Our main analysis specifies an event study approach, but we show that our results are robust to using group-time average effects that account for staggered treatment.\n\nUsing digitised historical pollution measurements, we provide one of the first empirical analyses of the dynamic and time-varying impact of the introduction of SCAs on local pollution levels (see also Fukushima, 2021). We show that they substantially and persistently reduced black smoke (but not sulphur dioxide) concentrations for at least five years post-introduction. This, in turn, affected individuals who were born in areas of smoke control, relative to those born elsewhere. We show that those exposed to SCAs had – on average – 60g higher birth weights and are 1cm taller in adulthood. Relative to the mean, these represent increases of 2% and 0.6% respectively. In contrast to much of the existing literature, we find no evidence of impacts on years of education and intelligence, with estimates that are relatively close to zero throughout, though with some suggestive evidence of heterogeneity by the socio-economic composition of individuals’ district of birth.\n\nWe highlight two potential reasons for our null result on education and intelligence. First, we examine the long-term impacts of small but persistent changes in pollution caused by the phased introduction of SCAs, whereas the existing literature that investigates the very long-term effects of pollution exposure have generally examined one large transitory pollution spike: the London smog. This may suggest that small, permanent reductions differentially impact long-term outcomes compared to extreme, but one-off events. Although this is possible, it is less likely given that the existing literature also shows that early life pollution exposure adversely affects human capital and"
    },
    {
        "id_": "0c023448-3574-4b41-ad16-ab3d8eb5a552",
        "text": "Labour market outcomes already in early adulthood (e.g., Isen et al., 2017; Persico, 2020). Unless these individuals catch up later, or those unexposed drop down the distribution, this is perhaps unlikely to explain our findings.\n\nSecond, the fact that we do not find impacts on human capital outcomes may suggest that these are driven by exposure to pollutants other than those targeted by SCAs. Indeed, the quasi-experiments exploited in the existing economics literature (the London smog, but also e.g., toxic release inventory sites, and the US 1970 Clean Air Act Amendments) are likely to have affected a range of pollutants. In contrast, the introduction of SCAs targeted black smoke only, and the evidence suggests that moving from bituminous coal to smokeless fuel mainly affects black smoke/particulate matter, rather than other pollutants such as nitrogen oxides, sulphur oxides and carbon monoxide (Mitchell et al., 2016). This is also what we find, in that we show reductions in black smoke concentrations, but not in sulphur dioxide. Hence, this is consistent with the idea that pollutants other than black smoke are responsible for the adverse effects on human capital, whereas black smoke reduces fetal as well as child growth. Unfortunately, since black smoke and sulphur dioxide are the only two pollutants that are measured throughout our observation period, our data do not allow us to explore this possible explanation in more detail.\n\nWe also examine heterogeneity in our estimates by individuals’ genetic “endowments”, obtained from the molecular genetic data available in the UK Biobank. In addition to this shedding light on whether the introduction of SCAs affected inequalities in our outcomes of interest, it is also informative about the existence of complementarities between endowments and public health investments. Our findings suggest that the introduction of SCAs increased inequalities in population health but not economic outcomes, with larger increases in birth weight and height among those with higher “endowments”.\n\nOur analyses estimate intention to treat (ITT) effects, identifying the impact of the introduction of SCAs on individuals’ outcomes, rather than the impact of pollution. Indeed, the latter is endogenous, with lower social class individuals more likely to live in highly polluted areas. Given our newly digitised and rare historical pollution data, one option is to use an instrumental variable.\n\n35"
    },
    {
        "id_": "4118a027-66a5-449a-a2d9-454b6ad04ab7",
        "text": "approach, instrumenting local pollution levels with the phased introduction of SCAs. We are re-\n\nluctant to do so however, since the policy itself may have led councils to change their spending\n\npatterns more generally. For example, by increasing their spending on pollution reduction poli-\n\ncies, they may have had to reduce local expenditures on health and education, with potential direct\n\nimpacts on our outcomes of interest."
    },
    {
        "id_": "4fb3886a-408e-444a-bcc3-b8ee5d6e0596",
        "text": "# 1. The 1956 Clean Air Act\n\nthat allowed for the introduction of SCAs marked a significant step in the government’s aim to reduce air pollution and improve public health. With its requirement that coal be replaced with smokeless fuels, it was among the first that aimed to reduce pollution emitted from residential dwellings, with most previous policies aimed at industrial pollution. The move to smokeless fuels required adaptations of heating appliances, the cost of which was partially reimbursed by local authorities, which in turn would receive a contribution from the exchequer. By 1973, over 1,000 SCAs were introduced in English CBs, highlighting the widespread awareness of the health impacts of pollution as well as willingness to pay to reduce these not only by the government and local authorities, but also among the population."
    },
    {
        "id_": "2f55397e-7e5b-41e2-814c-4de465c58774",
        "text": "# 2. Selective Migration\n\nThis in turn may suggest the presence of selective migration in response to local levels of air pollution. Indeed, individuals who were living in areas characterised by high levels of pollution (and little prospect of local authority intervention) may have been more likely to move into less polluted areas. Such potential avoidance behaviour is a limitation of our research; with no data on house moves in early life, and a sibling sample that is too small for any within-family analy-\n\nsis (n→160), we cannot explore this. However, the existence of such avoidance behaviours would likely lead to an underestimate of our effect of interest. Indeed, we define individuals who are conceived in non-SCAs, but who moved during the prenatal period to a SCA, as treated, despite them being exposed to higher levels of pollution in the early gestational period. Similarly, individuals who were born outside a SCA but who moved into one in early childhood would be defined as control (since we only observe the location at birth), despite being exposed to less pollution in childhood. Both cases would lead to underestimating the difference between treated and control individuals.\n\n36"
    },
    {
        "id_": "c45692cf-db98-4088-b7a3-f05aa126ce5a",
        "text": "There are other reasons to believe that our coefficients underestimate the impacts of the introduction of SCAs. First, since pollution is linked to infant mortality and foetal loss, the higher levels of pollution in non-SCAs may have led to increased mortality (Fukushima, 2021). Assuming that these individuals were more vulnerable than those who survived, our estimates are likely to be a lower bound. Similarly, the fact that we only observe UK Biobank participants when they enter the data collection in 2006–10, we implicitly condition on survival until then. These survivors are likely to be stronger than those who did not make it, potentially attenuating our estimates of interest.\n\nNevertheless, our analysis highlights the importance of a healthy environment in early life, showing immediate as well as long term impacts on individuals exposed to pollution in the early childhood period. This has direct implications for policy, suggesting that interventions that aim to reduce pollution not only have contemporaneous health benefits, but also improve individuals’ outcomes in older age. Ignoring such longer-term effects underestimates the total welfare effects caused by pollution reduction.\n\n37"
    }
]