[
    {
        "id_": "52ea70b3-5e2a-4c2b-adf3-c61469ef0e76",
        "text": "# 2 Introduction\n\nWhat is the path to a flagship mission? Many astronomers and engineers spent the years leading up to the 2020 decadal survey providing worked examples of what could come next2,3. The Astro2020 Decadal Survey prioritized a Large IR/optical/UV space telescope (“Habitable Worlds Observatory”, HWO) to pursue an ambitious program of exoplanetary discovery and characterization, as well as cosmic origins astrophysics1. The decadal survey report recognized that many of the galactic ecosystem, exoplanet, and stellar science goals of the HWO require high-throughput imaging and spectroscopy at ultraviolet (UV) to optical wavelengths. The Astro2020 Panel on Electromagnetic Observations from Space1 recommended that “. . . [the] mission will also need focal plane instrumentation to acquire images and spectra over the range of 100 nm to 2 μms with parameters similar to cameras and spectrometers proposed for the Large Optical UV Infrared Telescope (LUVOIR)...”\n\nThe decadal survey endorsed an early program of technology maturation ahead of the pre-Phase-A start of HWO to reduce cost and schedule risks to the mission. This recommendation, the Great Observatories Mission and Technology Maturation Program, was adopted by NASA in the form of the Great Observatories Maturation Program (GOMAP)4 to finalize the science requirements from Astro2020 and prepare the requisite technologies for HWO (from stable telescopes to starlight suppression to ultraviolet-enabling mirror coatings).\n\nIn this white paper, we have collected key science cases that drive the UV baseline for our next flagship mission and captured the current state of UV technology development - combining the current state of the art with the steps required to reach the projected instrument capabilities of HWO. Our expectation is that the details will evolve as the work of the GOMAP progresses. However, this document provides a foundational understanding of UV development work, accelerating the ability of our community to move quickly — a necessity with the tight HWO timelines.\n\nThe reader might approach this paper in a variety of ways. First, we present a summary in Section 1. This provides a map to the rest of the text for those who have a particular area of question.\n\n32 https://www.jpl.nasa.gov/habex/documents/\n\n4 https://asd.gsfc.nasa.gov/luvoir/\n\nhttps://science.nasa.gov/astrophysics/programs/gomap/\n\n5"
    },
    {
        "id_": "77f66f7e-3d66-406a-b0ed-57a1a06805d0",
        "text": "# Motivating Science\n\nAt the heart of every flagship mission NASA builds and flies sits the scientific boundaries we plan to explore and surpass. HWO focuses on two key areas: discovery and characterization of habitable worlds, and the broad remit of transformational astrophysics. The primary purpose of HWO is to directly determine whether planets in nearby stellar systems exhibit potential for habitability and, if so, to search for signatures of extra-terrestrial life. Such an investigation begs answers to the question of what fundamental processes lead to the formation and evolution of life. Below we outline specific science questions in the two relevant topic areas from the Astro2020 Decadal: “Worlds and Suns in Context” and “Cosmic Ecosystems.” Both areas will stretch our understanding of the formation and evolution of stars, planets, and galaxies.\n\nBeing able to identify multiple Earth-analog systems would change our understanding of our own Solar system and the many systems we have found over the last decade. Beyond discovery, which will be accomplished with coronagraphy, characterization is crucial for us to differentiate planets, especially those that might have atmospheres that could support life as we know it. Biosignature identification requires spectrographic capability and a spectrograph operating down into the deep UV provides access to crucial diagnostic spectral lines in exoplanet atmospheres. Besides biocompatibility, UV spectroscopy will reveal the impact of UV radiation on the chemistry and heating of planetary atmospheres, an understanding that is critical as we move forward to truly understand the excitingly broad range of exoplanets in our nearby universe.\n\nOur understanding of galaxy evolution has shifted drastically in the last decade. Work with line-of-sight absorption systems and a small number of integral field emission maps has exposed the circumgalactic medium (CGM) to be a highly active and interactive ecosystem, one which is seemingly crucial to our understanding of both the evolution of galaxies themselves as well as the larger cosmological history of the Universe. The CGM feeds gas into galaxies to fuel star formation while simultaneously receiving energy and metal enriched gas as explosions and winds drive escape from the galaxy. We are just beginning to understand the mechanisms that govern the CGM and the overall role that this dynamic regime plays in how the history of matter in our universe unfolds. The UV is crucial to understanding the CGM in local systems where we are able to resolve them on physical scales that match the dominant processes.\n\nIn the sections below, we focus on particular science cases that drive ultraviolet observational requirements. We call out lower boundary wavelength ranges alongside each topic heading. We use the bandpass convention of extreme ultraviolet (EUV) defined as 10.0 – 91.1 nm, far ultraviolet (FUV) as 91.2 – 180.0 nm, and near ultraviolet (NUV) as 180.0 - 320.0."
    },
    {
        "id_": "24e26df7-7569-41c6-959f-bbc843607604",
        "text": "# 3.1 Worlds and Suns in Context\n\nExoplanetary science has witnessed an explosion of discovery in the last three decades, with over 5000 exoplanets now known and planetary occurrence rates of 10 – 60% for F, G, and K stars and 80% or more for M dwarf stars.2, 3 Now that large numbers of planets with basic properties (e.g., mass and radius) are known, the next task is to characterize the composition and evolution of their atmospheres, and ultimately to determine which of these worlds may support habitable conditions.\n\nUV radiation from protoplanetary and exoplanetary systems provides unique tracers of atomic and molecular gas in these environments, making spectral coverage at UV wavelengths (100 – 320 nm) essential to completing the exoplanet science goals of the HWO.\n\nThe Astro2020 panel on Exoplanets, Astrobiology, and the Solar System highlighted two key research questions where UV diagnostics and environmental context are critical:\n\n1. How does a planet’s interaction with its host star and planetary system influence its atmospheric properties over all time scales? (E-Q2d)\n2. What is the range of potentially habitable environments around different types of stars? (E-Q3c)\n\nThese questions are addressed by (1) comprehensive characterization of the radiation environment of exoplanet host stars as a function of stellar mass and age. UV photons and high-energy particle outputs regulate the chemical and physical state of exoplanetary atmospheres (Section 3.1.1). (2) Measurements of the chemical inventory and radial distribution of molecular gas in protoplanetary disks set the initial conditions for the planets that we will characterize with HWO (Section 3.1.2). In order to understand the full life cycle of habitable planets, we need to place observational constraints on the physical and chemical conditions where they are born, including mapping the molecular abundances and physical structure of the inner regions (&lt; 3 AU) around young stars."
    },
    {
        "id_": "ec1e6c66-0967-4b2e-84a2-f8ba584713cf",
        "text": "# 3.1.1 UV emission from exoplanet host stars: 102 – 160 nm\n\nIn parallel with the discovery of thousands of planets, it has become clear that the planetary mass and effective surface temperature alone do not predict the characteristics of a planet’s atmosphere. The physics and chemistry of all types of planetary atmospheres are driven by the ultraviolet radiation (100 – 320 nm; see Figure 1) from their parent stars. From the importance of the stellar FUV and NUV radiation on our ability to accurately predict and interpret biosignature gases on rocky exoplanets6–9 to the young Neptune-mass planets being sculpted by their host star’s EUV radiation (a leading theory to explain the “radius gap”;10, 11), the stellar UV radiation inputs are critical. Indeed, with the very first James Webb Space Telescope (JWST) transiting planet observations, we are seeing direct evidence of UV-induced photochemistry on the Hot Jupiter WASP-39b,12 moving this field from model predictions to empirical studies of the influence of stellar photons on exoplanetary atmospheres.\n\nAccess to the FUV bandpass, specifically coverage from 102 – 115 nm, is critical for calculating the EUV inputs into exoplanetary atmospheres. The EUV radiation is the key forcing function in determining the atmospheric escape timescale of all types of planets. The 102 – 115 nm range includes unique spectral tracers of portions of the host star chromosphere and coronae; this formation temperature (Tform) coverage greatly reduces the uncertainty of EUV reconstruction techniques.15"
    },
    {
        "id_": "445fcb2d-cdb2-4bca-9ac7-16665f6029a6",
        "text": "# Escape to Space"
    },
    {
        "id_": "263e835c-d03c-4ac5-a5e7-7e8f9e2af38f",
        "text": "# Lobase"
    },
    {
        "id_": "f03e83d6-4ffc-40ac-a5c8-b5d63b9129f5",
        "text": "# Photolysis"
    },
    {
        "id_": "8a1c48e1-6d7e-4b0b-96a6-5d44f3553274",
        "text": "# Homopause\n\nFig 1: A sketch demonstrating the interactions of UV light with different layers of a planetary atmosphere. The ultraviolet stellar spectrum drives photochemistry (FUV and NUV photons, 100 – 320 nm) and atmospheric escape (EUV photons, 10 – 90 nm) on orbiting planets. The EUV spectrum is calculated from chromospheric and coronal lines in the FUV spectrum, with the 100 – 115 nm band providing unique diagnostics for temperature and abundances. The host star spectra are used to predict the most promising habitable planet candidates and to interpret atmospheric spectra.4, 5"
    },
    {
        "id_": "7c1f4e49-92b5-4deb-9d16-d4ccca27ac87",
        "text": "# LUMOS T Tauri Star Simulation\n\n2.0x10-16\nE.Sx10-%\n2 8E L.OxlO-6\n5.0x10-17\nLUMOS\nH2\n\n15 Wavelength (A 125120 1130\n\nFig 2: Spectral simulation of the 111.1 – 113.2 nm spectrum of an edge-on protoplanetary disk, a spectral region containing strong lines of H2 and H2O.13, 14 Multi-object spectroscopy from 100 – 170 nm enables simultaneous detection of up to 30 young stars in a region like the Orion Nebula Cluster (ONC). A multiplexed instrument on a →6 m space observatory would eclipse the total UV disk archive of HST in 2 – 4 pointings in the ONC."
    },
    {
        "id_": "3bb6df5e-2525-4968-8a4d-7b2be4c96978",
        "text": "As there is no EUV spectroscopy observatory on the horizon, these techniques will remain our best means of calculating atmospheric escape rates from temperate, terrestrial planets in the HWO era. The 102 – 115 nm region includes emission lines of S IV (106.3, 107.3 nm) [log(Tform) = 4.9], O VI (103.2, 103.8 nm) [log(Tform) = 5.5], Ne V (113.6, 114.5 nm) [log(Tform) = 5.4], and Fe XIX (111.8 nm) [log(Tform) = 7.0]. In concert with the intermediate- and high-temperature lines found in the FUV redward of 115nm: C II and Si II [log(Tform) = 4.5], Si III [log(Tform) = 4.7] Si IV [log(Tform) = 4.8], C IV [log(Tform) = 5.0], N V [log(Tform) = 5.2], O V [log(Tform) = 5.3], Fe XII [log(Tform) = 6.2], and Fe XXI [log(Tform) = 7.1], this suite of lines provides the comprehensive temperature cover to calculate the EUV irradiance from all nearby planet-hosting stars without the need for coordinated X-ray measurements."
    },
    {
        "id_": "e08f1670-96da-4eff-bba0-2785d49d9707",
        "text": "# 3.1.2 Characterizing Protoplanetary Disks: 100 – 115 nm\n\nHow do planets form? To answer this question, it is crucial to trace the composition, distribution, and evolution of planet-forming material in protoplanetary disks. UV spectroscopy is a unique tool for observing the molecular gas in the inner regions of protoplanetary disks: the strongest electronic band systems of H2 and CO reside in the 100 – 170 nm wavelength range. UV-fluorescent H2 spectra are sensitive to gas surface densities lower than 10-6 g cm-2, making them an extremely useful probe of remnant gas at r < 10 AU during the disk dispersal stage after planet cores have formed. In cases where mid-IR CO spectra or traditional accretion diagnostics (e.g. Hω equivalent widths) suggest that the inner gas disk has dissipated, far-UV H2 observations can offer unambiguous evidence for the presence of a remnant molecular disk and ongoing protostellar mass accretion.\n\nA high-sensitivity space observatory with a multi-object, high-resolution capability (R &gt; 30,000, &gt; 4 square arcminutes per field) enables transformative absorption-line studies of high-inclination (i &gt; 60 degrees) disks. Absorption-line spectroscopy through high-inclination disks, currently limited on HST to a small number of bright stars, is important because the strongest molecular absorption systems of key disk volatile species such as CO, OH, H2O, CO2, and CH4 have their peak absorption cross-sections in the 100 – 170 nm range. Access to wavelengths from 100 – 115 nm is particularly critical as (1) absorption from cool H2 (T < 500 K) is restricted to ε < 111 nm, (2) the strongest absorption bands of H2O reside between 111 – 113 nm, and (3) the CO-dissociation bands reside at ε < 108 nm. UV absorption line spectroscopy is the only direct observational technique to characterize co-spatial populations of these molecules with H2, offering direct measurement of the absolute abundance and temperature of inner disk gas without having to rely on molecular conversion factors or geometry-dependent model results (as is required with emission-line spectroscopy)."
    },
    {
        "id_": "21fe2484-13ad-4973-86d5-66fa38e68d8b",
        "text": "# 3.1.3 Cometary Emissions: 100 – 205 nm\n\nUV spectroscopy has been instrumental in analyzing cometary emissions, especially when detecting molecules with subtle emission features. A pivotal advancement using the Rosetta Alice FUV instrument (70 – 205 nm) on comet 67P/C-G was the simultaneous measurement of both parent molecules like H2O, CO, CO2, and O2 ratios in a comet, from Rosetta, such as the high O2/H2 and their dissociative products (e.g., H, O, and C). Findings were groundbreaking. By assessing both the parent molecules and their subsequent products, we gain a deeper insight into comet composition, the conditions of the solar nebula where comets originated, and the dynamics within the."
    },
    {
        "id_": "92eb519b-2f54-449c-a88b-6810ce55a9ca",
        "text": "# 3.2 Cosmic Ecosystems\n\nAstro2020 identified “Cosmic Ecosystems” as a key scientific priority for the 2020s. How do galaxies acquire the gas they use to form stars? How do they sustain star formation over billions of years when they appear to contain much less gas than this requires? How does feedback from star formation and active galactic nuclei (AGN) expel gas and metals, and to what extent is this feedback recycled into later star formation? What happens to a galaxy’s gas when it quenches? Is it used up, ejected, or hidden? Inflows and outflows of gas likely shape the evolution of star formation within a galaxy. All of these flows meet in the CGM, a diffuse gaseous medium spanning roughly 30 times the radius and 10,000 times the volume of the visible stellar disk. This complex medium is diffuse, multi-temperature and multiphase medium, and encodes the histories of star formation, galaxy interactions, and other processes that shape galactic evolution. How can we measure this medium? It requires observations of the 100 – 200 nm bandpass.\n\nFUV wavelengths allow access to a host of species that trace gas with a wide range of ionization states and densities. These lines can be used to trace matter in emission or absorption and are ideal for probing the interstellar medium (ISM), CGM, and intergalactic medium (IGM). The wide range of lines, especially at wavelengths <100 nm, provide strong diagnostics to trace the physical, chemical, kinematic, and ionization state of the gas and enable the study of the baryon cycle that supports cosmic ecosystems. Figure 3 shows the abundance of lines and their expected strengths as a function of wavelength adapted from. The density of line tracing gas over four orders of magnitude in temperature (102→6 K) makes this wavelength range ideal for probing a range of physical processes (e.g., wind-driven feedback, gas accretion into galaxies, turbulence in the CGM and IGM, etc.) that have remained elusive so far. Spectroscopic capabilities throughout the UV bandpass allow access to a significant range of local redshifts to better understand the evolution of the galaxy-CGM-IGM relationship over time."
    },
    {
        "id_": "cdc031c0-2841-4c01-96d9-3d25b44da67d",
        "text": "# 3.2.1 Mapping multiphase gas in the CGM: 100 – 300 nm\n\nFigure 4 shows why UV coverage is essential to understanding the intrinsically “multiphase” galactic gas flows. The shaded map at lower left shows the distribution of gas in a simulated L* galaxy from the EAGLE project, which spans multiple “phases” from 103 - 106 K and eight orders of magnitude in density. In such ionized gas, the quantum-mechanical rules of electron orbits dictate that the gas will emit and absorb energy predominantly at UV wavelengths, up to 80% according to detailed simulations. Many of the transitions appear as strong UV absorption and emission lines. This inescapable physics means that access to UV wavelengths in space is essential if we are to resolve questions about how galaxies acquire, process, eject, and recycle their gas over the last 10 Gyr of cosmic time.\n\nSolving these problems requires pushing the boundaries of CGM characterization far beyond the limits of today’s measurements, to z = 1 – 2, for two major reasons. First, this period 7 – 10"
    },
    {
        "id_": "ab0d7d52-4d6b-4310-8d38-cb28289b5bb3",
        "text": "# 6.5 Temperature and Density of Galactic Gas\n\nHigher Temperature\n\n|Temperature (K)|HI|Mg II|CIV|O VI|Ne VIII|\n|---|---|---|---|---|---|\n|0|1216|2800|1550 A|1032 A|775 A|\n\nRedshift: 0.5, 1.5, 2, 3, 4, 6"
    },
    {
        "id_": "dae19ac4-fa82-464a-8cb0-8166f364e8cf",
        "text": "# Fig 3:\n\nThe distribution of resonance lines as a function of the rest-frame wavelength in the ultra-violet regime (figure adapted28). The strength of the line represents the elemental abundance and strength of the transitions. The colors indicate the ionization state of the gas the lines are expected to trace. The line density increases as we go deeper into the UV, demonstrating a wealth of scientific targets there."
    },
    {
        "id_": "476e9589-6613-4411-98d4-27c3635fc043",
        "text": "# Fig 4:\n\nDiffuse gas in and around galaxies requires UV capability for most of cosmic time. The top row shows a simulated galaxy at z = 0.7 from the FOGGIE suite,29 rendered in some key diagnostic ions. The temperature and density regimes probed by these ions are marked in the “phase diagram” of this galaxy’s gas. In upper right, we show how these lines, ranging from Mg X at 68nm to Mg II at 280 nm, vary in observed wavelength with redshift. Even with redshift, most of this diffuse gas is visible only in the UV for the last 10 Gyr of cosmic time. X-ray lines such as O VII and O VIII (both around 2 nm) probe gas at →1 million K but not the cooler phases where accretion and recycling occur. The 100 – 120 nm range marked “Far-UV” is critically important to capture O VI (103.2 nm) at z > 0.1 and the EUV ions Ne VIII and Mg X at z > 0.5 rather than z > 1."
    },
    {
        "id_": "e8a44ea0-e24a-4f2d-a881-069607f49391",
        "text": "# 3.2.2 Lyman continuum observations across cosmic time: 100 – 120 nm\n\nQuantifying the physical conditions that allow radiation emitted shortward of the hydrogen ionization edge at 91.18 nm (the Lyman Continuum; LyC) to escape the first collapsed objects and ultimately reionize the universe is a compelling problem for astrophysics. The escape of LyC emission from star-forming galaxies and active galactic nuclei is intimately tied to the emergence and sustenance of the metagalactic ionizing background that pervades the universe to the present day and in turn is tied to the emergence of structure at all epochs. The James Webb Space Telescope (JWST) was built in part to search for the source(s) responsible for reionization, but it cannot\n\nGyr ago encompasses the peak of cosmic star formation. Second, at z > 0.5 we gain UV access to a wide range of extreme UV lines such as Ne VIII, O II to IV, and Mg X (&lt; 80 nm in the rest frame, see Figure 4) that enable a much broader set of diagnostics of physical state and metal content that are only available with redshift. A large wavelength grasp (100 – 300 nm) provides coverage of critically important rest-frame extreme-UV ions that redshift into the FUV for z > 0.5. This includes nearly every ionization state of the most abundant heavy element, oxygen, from O I (cold gas), through O VI (warm ionized gas), which could be covered simultaneously for sightlines at z ↓ 1. The OVI line (103 nm) is a particularly important diagnostic. As can be seen from Figure 4, this line is a probe of environments between hot gas at T > 106 K (probed by Mg X and NE VIII) and cooler gas at T &lt; 105 K probed by other lines. As such this line can elucidate the mechanisms that maintain these temperature differentials, and help us understand the detailed histories of galaxies. Fortunately, very high ionization lines like Ne VIII (77.5 nm), Mg X (61 nm), and Si XII (50 nm) become available in (optically thin) IGM and CGM gas at z > 0.5, reaching a temperature regime (T > 106 K) that is usually thought to be the exclusive domain of X-ray telescopes.\n\nThe same broad wavelength coverage that enables a robust baryon census will also complete a multiphase metals census over a wide range of galaxy masses, star-formation rates, and environments. This is only possible with UV coverage and redshift that places EUV lines of O II, O III, and O IV into FUV. Using this capability, HWO’s users can complete the low-z metals census, constrain the physics of feedback from galaxies, and assess the importance of galactic recycling with robust statistics.\n\nThe combination of large UV wavelength coverage and the potential to include a UV integral field unit (IFU) instrument allows for truly transformational studies of the CGM and IGM. Observational evidence for enormous circumgalactic halos has historically come in the form of absorption lines in the spectra of bright background objects (e.g., quasars) that intersect the halos of galaxies. These studies have defined the current paradigm and taught us a great deal about the physical properties of the CGM, including the average covering fraction of gas and the average ratios of gas phases. But because these studies require bright background objects from which absorption lines can be measured, we have only seen single, narrow sightlines through the halo gas for the vast majority of galaxies. Qualities derived from these studies are averages, not individual views of particular galaxies. A complete gas census can only be developed by eventually moving to volume-filled mapping of the ultra-diffuse gas residing in the CGM and IGM. Since the smallest spatial scales are most easily observed in nearby galaxies, it is advantageous to initiate CGM mapping campaigns in nearby galaxies that target the aforementioned suite of diagnostic lines at ε &lt; 200 nm."
    },
    {
        "id_": "f8b371fb-286f-4d97-bf48-0cc9218a4b59",
        "text": "# 1.0"
    },
    {
        "id_": "b586aa01-ca75-4b16-aa42-1e48475c5144",
        "text": "# Fig 5:\n\nLeft - Mean IGM transmission for z = (0.1, 0.3, 0.5, 0.7, 1.0, 2.0, 2.9). Vertical bars mark the Lyman edge and indicate the level of expected variation found in a Monte Carlo study of IGM transmission. Right - same for z = (2, 3, 4, 5, 6). The red line on the right marks the mean transmission at Lyω.\n\nObserve LyC escape directly because of the progressive increase in the mean transmission of the intergalactic medium towards the epoch of reionization (Figure 5).\n\nThe low-redshift universe (0.1 < z < 1) is the ideal place to study the physics of LyC escape because corrections for the mean transmission of the IGM are modest. In particular, the very lowest redshifts offer the opportunity to examine direct escape from H II regions within nearby galaxies.\n\nDirect quantification of the escape fraction of LyC photons fLyC at low- and intermediate-z require space-based facilities with extreme sensitivity to the EUV restframe, as estimates for L↑ 150 nm in Figure 6 show. Access to EUV wavelengths down to 100 nm is essential for this science."
    },
    {
        "id_": "a0066391-14dc-4af2-aee9-3a726d26f63c",
        "text": "# 4 Reflective Coatings\n\nAn environmentally robust and reflectively uniform broadband (UV/O/IR) reflective coating has been a goal of coating technology development for many years. The 2020 Astrophysics Decadal Survey states of HWO that “The mission will also need focal plane instrumentation to acquire images and spectra over the range of 100 nm to 2 μm” (Page I-2). The coating used to deliver this broadband performance must be resilient to the space environment, as well as compatible with the high-contrast imaging system and other potential science instruments for HWO. Recent advances in deposition technologies have provided new possibilities for coatings that not only provide high reflectively, but improve ease of handling and decrease environmental constraints.\n\nWhen we discuss broadband mirror coatings that include ultraviolet reflectance, two components must be considered - the reflective coating and the protective overcoat. There is also the possibility of applying a second overcoat or ‘capping’ layer, often a small number of individual layers to improve durability. The primary material provides the underlying reflectance, while the overcoat improves the durability and environmental stability of the coating (but also modifies its reflectance).\n\nPast and current broadband mirror coatings operating in the UV typically utilize reflective aluminum as the base material, as other common coatings like silver and gold become partially transparent in this range. This aluminum layer is capped with a thin dielectric fluoride that is transparent to the UV through NIR but prevents aluminum oxidization, which degrades far-UV reflectance. The choice of the dielectric capping layer sets the bandpass, reflectance, and environmental stability/resilience of the coating. Magnesium fluoride (MgF2; HST, GALEX) and lithium"
    },
    {
        "id_": "f9e8292b-6a54-4191-b1c1-a63ded0cb55d",
        "text": "# Fig 6:\n\nLeft - flux estimates for L 150nm ↑ galaxies with escape fractions of f LyC =(1, 0.57, 0.36, 0.17, 0.04,e 0.003, 0) at redshifts of z = (0.3, 0.5, 0.7, 1.0).34 The recovery of flux towards the shortest wavelengths suggests the possibility of LyC drop-ins.\n\nFluoride (LiF; Far Ultraviolet Spectroscopic Explorer - FUSE) are both flight qualified options in this bandpass. Both of these approaches use physical vapor deposition (PVD) to coat optics. This requires a vacuum chamber to hold the optic while deposition material is heated and then evaporated onto the surface. The optic is usually unheated, but some techniques in development have found improved performance through heating the optic during deposition.\n\nA key technical challenge, historically, for wavelengths above 100 nm, the reflectance of protected Al is limited by the residual absorption and the eventual degradation of the fluoride overcoats. The Al/LiF technology was discovered about 60 years ago, and up until recently, there have been few but significant advances.37 reported the first aluminum mirrors protected with LiF in the 1960s, and a few years later38 were first in optimizing Al/LiF mirrors at the Hydrogen Lyman ϑ line (102.6 nm). Then,39 studied the effect of deposition rate and substrate temperature for Al/LiF mirrors. The fact that high substrate temperatures enhanced the mirror reflectivity was further explored several decades later by,40 who demonstrated the highest R at 122 nm wavelength with Al/LiF mirrors fabricated using the 3-step hot process.41 The results of these hot LiF deposition are shown in Figure 7). Optimizations in pre- and post-annealing conditions have been explored, and these enhanced LiF (eLiF) coatings have been demonstrated on several sounding rocket missions.\n\nThere are multiple viable potential coating choices - as can be seen summarized in Table 1. There are a collection of coatings that have been flight qualified, and two newer approaches that have provided promising coatings with better FUV performance that still require investment to be physically scaled up. For example, the estimated TRL levels for Al+MgF2 and Al+LiF are the highest given their HST and FUSE heritages respectively. Likewise, eLiF coatings have flown on.\n\n14"
    },
    {
        "id_": "176a3318-c311-4df1-8899-f028bcaa9047",
        "text": "# Al+LiF Deposition"
    },
    {
        "id_": "b75f3d5b-b83d-4671-a754-8499d5ca6eea",
        "text": "# Wavelength (nm)\n\nFig 7: The measured reflectance of enhanced lithium fluoride (eLiF) deposited at elevated substrate temperature versus the performance of conventional LiF developed for the FUSE mission.40\n\n|Reflectance|Wavelength (nm)|\n|---|---|\n|1.0|100|\n|0.0|1000|\n\nFig 8: Comparison of experimental UV/Optical/IR reflectance of representative mirror coatings. “RT” indicates a room temperature deposition process.\n\nThe SISTINE sounding rocket and the SPRITE CubeSat and Aspera Astrophysics Pioneer mission will use an eLiF mirror coating that is capped with an ALD MgF2 layer given the maximum sensitivity this coating provides to rest-frame O VI emission lines (103 nm; Section 3.2). The two emerging technologies (XeLiF and e-beam passivated Al+AlF3) have been shown to be at the TRL 3 and 4 respectively.\n\nFigure 8 displays reflectance data for a variety of coatings across the NUV, optical and near-infrared (200 ↭ ε ↭ 2500 nm) bands. The main feature to note from this figure is that the reflectance performance of all these Al-based mirror coatings is very similar in the UV/O/IR spectral regions. The most notable exceptions are from the bare Al sample (which actually exhibits a slightly higher reflectance in the NUV) and the curve labeled as “Al+eLiF (265 °C, no cap layer)” that shows a reduction in reflectance of 70% at 200 nm (when compared to an average value of 80% at this wavelength for all the other samples). The main reason for this reduced reflectance value for this sample is due to the fact that the thickness of the LiF layer was optimized to provide maximum performance at the shortest wavelength of interest for SPRITE of 103 nm.42"
    },
    {
        "id_": "b5ee475f-00d4-4510-b1df-83ecc6df17d8",
        "text": "While the simplest description of a fluoride protected aluminum coating is that the fluoride provides a transmissive overcoat to the reflective aluminum, the nuances of that overcoat, especially the thickness, have a great deal of influence on the final coating performance. In general, a thinner overcoat of fluoride shifts the peak reflectance of the coating in the FUV to shorter wavelengths, while also suppressing the amplitude of that peak FUV reflectance. A thicker coating shifts the peak to longer wavelengths while also enhancing the amplitude of that peak. A mission that prioritizes very short wavelengths, such as Ly ϑ at 1026 ˚A, for instance, would therefore have a reflectance at Ly ω and longer FUV wavelengths lower than an identical coating formula with a thicker fluoride layer. This is most apparent when evaluating the F U SE and SPRITE LiF and protected eLiF coatings (the SPRITE coating curves are included in Figure 11,43). Beyond 2000 ˚A all LiF+Al curves rapidly approach 90% reflectance. For this paper, it is essential that the reader consider that the comparison of coatings is not entirely straightforward, especially as enhanced performance over a narrow bandpass at short wavelengths is not always apparent in a plot.\n\nWe present two NASA funded on-going efforts to advance ultraviolet reflective coating performance, sometimes used in combination. The first is improving physical layer deposition using either room temperature (eLiF) or elevated temperature (XeLiF) deposition, described in Section 4.1. The second is focused on atomic layer deposition (ALD), described in Section 4.2. We then compare some example coatings."
    },
    {
        "id_": "7b92e3f7-ffa4-4d12-8c4d-73e034c964d6",
        "text": "# 4.1 eLiF and XeLiF - Physical Vapor Deposition (PVD) Coatings\n\nEnhanced Lithium Fluoride (eLiF) Conventional deposition techniques for LiF have not achieved predicted theoretical performance, with reflectances that peak between 70-75% across the 100 – 200 nm bandpass before rising to >85% from the NUV through NIR. Over the past decade, the community has developed several enhanced deposition techniques for LiF+Al that have drastically improved the reflectance in the UV and resilience to humidity with no known detrimental impact on the visible and NIR performance.40, 44–46 As mentioned previously, eLiF refers to deposition of LiF protecting layer onto a substrate at elevated temperature."
    },
    {
        "id_": "fef04ae7-af02-43d2-a8ae-1cfc953f634a",
        "text": "# Coating Properties\n\n|Coating Technology|Value|TRL|Largest Optics Coated|Substrate Temperatures Required?|Max Relative Humidity for Coating Stability|Dielectric Layer Process|H-roughness|\n|---|---|---|---|---|---|---|---|\n|Bare Al|>150 nm|> 1 meter|No|~70-100%| | |~0.78 nm|\n|Al+MgFz|>111 nm|> 1 meter|No|~70%|PVD| |~1.84 nm|\n|Al+LiF|>101 nm|~0.5 meter|No|30%|PVD|Fresh 1.5-2.5 nm|Aged >3 nm|\n|AlteLiF+MgFz|>102 nm|~5-6|0.3 meter|Yes|~60 %|eLiF (PVD)|1.5-2.5 nm|\n|Al+XeLiF|>103 nm|~3|Sx5 cm2|No|~60%|Reactive PVD|~1-1.5 nm|\n|Al+AIFz (e-beam)|>105 nm|~4|Sx5 cm?|No|~60%|E-beam Plasma|~0.81 nm|\n\nTable 1: Parameter comparison for various protected-Al FUV coatings."
    },
    {
        "id_": "fe6b769e-24cf-4b2e-a99f-bb32d1ea2c6f",
        "text": "# The most developed of these new deposition techniques is known as protected enhanced lithium fluoride, or “protected eLiF”.\n\nThis coating combines two recent advancements pioneered under NASA’s APRA, SAT, and Roman Technology Fellowship (RTF) programs: post-coating annealing of the LiF+Al to enhance the reflectance, and then capping with an ultra-thin overcoat of MgF2 to reduce hygroscopicity. The overcoat process was developed at JPL using atomic layer deposition, which enables ultra-thin and highly uniform capping layers that have a minimal impact on the reflectance of the underlying LiF-based coating."
    },
    {
        "id_": "364e6eb4-1475-49b1-afb8-fe748b113480",
        "text": "# The eLiF process\n\nwas pioneered at NASA-GSFC in the Thin Films Coating Lab (TFCL), first as a high-temperature deposition process where the mirror was heated to &gt;250°C prior to LiF deposition, but has since evolved to only require heating for post-coating annealing. This change significantly reduces the complexity of the process, while also increasing repeatability. The first usage of eLiF (as well as an early form of protected eLiF) was on the SISTINE sounding rocket, which employed the first-generation version of the coating (deposited onto a heated substrate) on optics as large as 0.5-m in diameter. While several SISTINE optics had excellent reflectance (&gt;80% at 105 nm), the results were mixed, due most likely to non-uniform heating of the larger optics. The SISTINE grating was not coated with eLiF, as it was a replica grating with a photoresist that would not withstand such temperatures. The secondary mirror of SISTINE was capped with a thin layer of AlF3 using the JPL ALD process for added resilience to humidity.\n\nOver the course of three launches, five years of student-led development and testing in the laboratory, as well as over 6 months of over-ocean transit from Australia to the United States in 2022 in a partial pressure of nitrogen, the SISTINE secondary mirror had only minimal degradation from 100 – 120 nm. It has since been determined that an MgF2 capping layer can provide even better protection, although there is a slight loss in reflectance of 2-7% between 100 – 110 nm due to absorption in the MgF2 that should be traded against added risk in AlF3 capping or bare eLiF."
    },
    {
        "id_": "ee8b422f-ebd7-46a0-a3e3-1a522b253f2b",
        "text": "# The second generation of protected eLiF\n\nis to be flight tested on the SPRITE CubeSat, which is expected to launch in mid-2024 to low Earth orbit (LEO). SPRITE is designed as a HWO technology testbed and carries a calibration channel that will aid in dissociating any on-orbit degradation of the coatings from losses due to contamination or detector degradation. Three of the SPRITE optics are coated in MgF2 protected eLiF, while the SPRITE primary mirror (PM) is coated in MgF2 protected conventional LiF+Al. The SPRITE PM was not coated in eLiF as the annealing process has not yet been installed in the large 2-m coating chamber at the GSFC TFCL. Testing carried out during the SPRITE coating development effort shows that MgF2 protected eLiF is resilient to humidity exposure, with only minimal degradation after four weeks of exposure to 60% RH.\n\nSPRITE has already demonstrated this resilience, with the SPRITE telescope assembled over two weeks in a modestly controlled environment in Maryland where the ambient humidity varied from 25% to 50% and nitrogen purging was employed only overnight and when the optics were not being handled. Witness sample testing showed no significant degradation in the coating reflectance over this time. The SPRITE grating has also been coated successfully with protected eLiF, as it is a master grating and therefore has no photoresist."
    },
    {
        "id_": "44e159e5-8783-4384-b17b-ab715f74f958",
        "text": "# Several other programs\n\nare now baselining eLiF and protected eLiF, including the INFUSE (Integral Field Ultraviolet Spectroscope Experiment) sounding rocket (eLiF; launched October 2023) and the Aspera Pioneer (protected eLiF; launch circa 2025)."
    },
    {
        "id_": "3c61e3bc-68bf-43c5-aa56-974f52ea180b",
        "text": "# 1.0 Mirror Reflectance\n\n| |0.8|0.6|0.4|0.2|0.0|\n|---|---|---|---|---|---|\n| |Pristine eLiF (SPRITE Witness)|MgF2 Protected eLiF (SPRITE Witness)|Protected eLiF Aged 4 Weeks at 60% RH|FUSE LiF+Al| |"
    },
    {
        "id_": "a6fc2cf3-04b7-428f-b21b-05ec4456b8d0",
        "text": "# Wavelength (Å)\n\n1000 1200 1400 1600\n\nFig 9: The measured reflectance of a SPRITE test sample with just eLiF (dashed), after the addition of the capping layer (solid) and after four weeks of aging at 60% RH and elevated temperature. It is important to note that SPRITE is specifically optimized for reflectance at 1050 ˚A, which requires a thin LiF layer and therefore lower reflectance at ε > 1150 A than is possible with other formulations. FUSE (dotted) was also optimized for short wavelength reflectance, which is why its peak reflectance does not match other conventional LiF+Al optics."
    },
    {
        "id_": "324902c4-f931-49a3-a0bc-493df450f762",
        "text": "# XeLiF\n\nThis section will describe a new reactive process that offers protection of Al coatings with a more stable and transparent LiF protection layer, along with unprecedented reflectivity. The process for preparing these Al+LiF mirror (or XeLiF) coatings utilizes exposure to XeF2 gas before and after the Physical Vapor Deposition (PVD) of the LiF metal-fluoride dielectric coating is applied. The technical description of the process is as follows.\n\nFirst, bare optically smooth glass is coated with Al in a high vacuum chamber by PVD. This process, along with the chamber in which the process is carried out, has been extensively described elsewhere where the only difference is that in the present process, the chamber was baked out for several days at 100↔105 ↓ C before the deposition. Then, the bare Al mirror is immediately exposed to a reactive XeF2 gas before and after the application of the final flash evaporated LiF layer by conventional PVD. Therefore, the Al is exposed to XeF2 within a few seconds after the aluminum evaporation, and typically the exposure lasts for up to 3 mins. The quick exposure of bare Al to XeF2 grants a thin ( → 2.5 ↔ 3.2 nm, typical values measured through ellipsometry) protective layer of AlF3. Once the mirror is complete, it is exposed again to a high partial pressure of XeF2 for a few seconds. An important detail is that all are carried out at ambient temperature.\n\nAfter the mirror coating fabrication, optical characterizations are performed with a spectrometer and measurement configurations that have been described elsewhere. The estimated absolute reflectance error is ± 1%. FUV reflectance data were measured immediately after deposition."
    },
    {
        "id_": "265119cd-e851-4862-988e-9febbf429967",
        "text": "# 4.2 Atomic Layer Deposition (ALD) Coatings\n\nAdditional improvements in LiF stability with respect to long-duration storage and possible exposure to elevated relative humidity levels have been explored by capping LiF mirror structures with thin layers of more stable fluoride materials like MgF2 or AlF. If the capping layer is thin enough3 the short wavelength performance of LiF can be maintained while sufficiently altering the surface chemistry to avoid deleterious interactions with water vapor. This general approach has been explored in a number of previous studies.\n\n57, 58 reported on samples of eLiF encapsulated with ALD AlF3 that were subjected to long duration elevated humidity exposure where it was observed that the capping layer was able to reduce, but not completely eliminate, reflectance degradation over year-long exposure conditions. The secondary mirror of the SISTINE sounding rocket was coated with this eLiF/AlF3 approach59 and showed ↭ 5% reflectivity degradation over 4.5 years including."
    },
    {
        "id_": "4aa58a21-0fce-4484-a122-184de9c178cd",
        "text": "# Fig 10: Reflectivity of two XeLiF samples (ID 09 and 11) both fresh and aged (18 and 12 weeks, respectively).\n\n| |0.8|0.7|0.6|0.5| | | |\n|---|---|---|---|---|---|---|---|\n|Fresh/Aged| |121.6 nm| |Aged after humidity tests| | | |\n| | |Wavelength (nm)|100|120|140|160|180|\n\nThese samples were also characterized with ellipsometry to derive thickness and optical properties (in the 200↔2500 nm range) of the ALF3 layers as well as Atomic force microscopy (AFM) to study the surface roughness and topography of each sample in two fields of 500 nm ↗ 500 nm and 5 μm ↗ 5 μm size. Figure 10 displays FUV reflectance for two examples of Al/LiF mirrors fabricated with the rPVD described above. The LiF thicknesses of samples 09 and 11 are → 22.9 nm and are optimized to provide the higher reflectivity at the Hydrogen Lyman ω line (121.6 nm), which is one important diagnostic for astronomy and often used as a reference.\n\nAmong the highest reflectance values reported at 122 nm wavelength:41 and52 demonstrated → 0.90 ↔ 0.91 with Al/MgF2,53, 54 and55 demonstrated → 0.90↔0.91 with Al/AlF3, and40 showed → 0.90 with Al/LiF. Most of these works used high-substrate temperatures;50 are the exceptions in which room-temperature e-beam generated plasma in SF6/Ar gas mixtures was used to passivate bare Al and56 in which the high reflectance was obtained through optimization of the PVD parameters such as a high deposition rate for both Al and MgF2. The results shown in Figure 10 with the rPVD process are unprecedented reflectivity of 0.926 at 122 nm, which is the highest value ever reported at this wavelength for the Al/LiF mirror coatings."
    },
    {
        "id_": "4a51f67f-39b3-4572-a5e7-bdc694497ef9",
        "text": "# 3.3 Coating Performance\n\nThree rocket integration and launch campaigns and commercial freight shipping across the ocean. Further stability enhancement demonstrations have been made by using ALD capping layers of MgF2 on eLiF mirrors.42 Such coatings have been deposited on the flight optics of the SPRITE CubeSat which anticipates a 2024 launch. SPRITE includes a calibration channel with MgF2/Al optics that will allow for a direct comparison of the on-orbit degradation of both systems. The same eLiF/MgF2 coating is also planned to be implemented on the Aspera Pioneers Mission, with flight optic coatings expected to be completed by the end of 2023.\n\nALD methods can also be utilized to deposit the entire protective layer on aluminum mirror coatings. In addition to the MgF2 and AlF3 processes noted above, ALD processes have also been established for LiF coatings including protected Al mirrors.60 The possibility of using ALD methods for the deposition of the protective coating is largely related to the general ability of ALD for precise film thickness uniformity. For a protected-Al mirror coating, the uniformity of the protective layer largely determines the ultimate reflectance uniformity of the mirror coating. Achieving film thickness uniformity with physical vapor deposition (PVD) methods often requires motion control of the substrate and/or source, or requires physical masking of the vapor species. ALD is a non-line-of-sight technique and is therefore generally agnostic of both the spatial scale of the substrate but also the substrate’s surface shape. This may be relevant for the coating of a many-segmented system with individual segments of varying figures.\n\nCommercial ALD solutions exist for the coating of meter class substrates, although these have largely been focused on flat-panel substrate processing or batch processing.61 Custom systems designed for the coating of telescope optics at the meter-scale and have been demonstrated for protected silver mirror coatings at longer wavelength applications.62 The key challenge associated with the adoption of ALD approaches for future UV mirrors centers around the combination of PVD Al with the ALD fluoride protective coating. There currently exists no promising method for the ALD of Al films with sufficient optical quality in the UV/vis. This restriction has been overcome by investigating dual-use coating chambers where evaporation and ALD can occur without breaking vacuum. It has also been explored via atomic layer etching methods that would allow coating to be performed in two separate chambers, for example by allowing the aluminum to oxidize and then remove the native oxide with a self-limiting chemical etching process prior to the deposition of the protective coating."
    },
    {
        "id_": "5ba4e765-832d-4b21-b320-25385d20902f",
        "text": "# 4.3 Coating Performance\n\nThe field of UV coatings has produced numerous solutions for materials and techniques capable of producing high-reflectivity and environmentally robust overcoats. The most common dielectric coating material for protected aluminum is MgF2, as was used on HST, GALEX, and many other UV-sensitive missions. MgF2 is a common overcoat available at many commercial coating vendors. It is resilient to most environmental impacts, including humidity, light touch/contact, and the space environment. It is birefringent, however, with angle-of-incidence dependent differences in the optical indices that could provide an extra factor for consideration in high-contrast imaging instrument design for HWO. Al+MgF2 also has very limited reflectance in the bluest portion of the UV (91.2 nm < ε < 120 nm), a bandpass highlighted by the 2020 Decadal Survey as an objective for HWO sensitivity (§3.1.1 and §3.2.2).\n\nHowever, very thin layers of MgF2 (and AlF3; 1 – 2 nm) can now be applied as a second overcoat, or capping layer, to impart the protective and environmentally stable benefits of these."
    },
    {
        "id_": "ac77d97b-3b7b-4785-9759-aec1c68d46f7",
        "text": "# Comparison of Experimental FUV Reflectance of Representative Mirror Coatings"
    },
    {
        "id_": "f722c1f8-3d41-4880-a0dd-518e7e1ae6ab",
        "text": "# Figure 11\n\n|Coating Material|Wavelength (nm)|\n|---|---|\n|Bare Al (RT)| |\n|Al+Cryolite (RT)| |\n|Al+MgF2 (RT)| |\n|Ti+Al+MgF2 (225 C)| |\n|Al+AlF3 (RT)| |\n|AlteLiF (265 C)| |\n|AlteLiF+MgF2 (265 C)| |\n|Ti+Al+XeLiF (RT)| |\n\n0.0\n\n100 110 120 130 140 150 160 170 180 190 200\n\nThis figure compares a broad range of coating materials and approaches. It is important to keep in mind that these coatings were not made to be compared - they are samples from different projects which each had their own sets of requirements and optimized bandpasses.\n\nFluorides on top of the primary reflectance and protective layers without imposing spectral restrictions on the final throughput. These thin depositions typically applied through an Atomic Layer Deposition (ALD) process, have been demonstrated to add strong environmental resiliency to the final optical surface at a modest cost in UV reflectance. These \"capped overcoats\" have been deployed in the lab and on suborbital missions and will be flown on small orbital astrophysics missions in 2024 and 2025, as described below.\n\nLithium fluoride protected aluminum (LiF+Al) has the highest energy bandgap of any fluoride overcoat, with high reflectance to →102 nm and flight heritage on OAO-3 Copernicus, FUSE, and many sounding rockets.\n\nAs can be seen in Figure 11, when one zooms in on the UV portion of the reflectance curves originally shown in Figure 8, there is a wide variation in reflectivity with material and application technique.\n\nThe curve that exhibits the highest reflectance (> 96% at the Lyman-alpha (Lyω) wavelength of 121.6 nm is the one labeled as \"Al+Cryolite (RT)\". The cryolite overcoat is a salt that has a conventional PVD process done at ambient or room temperature (RT) that was deposited by a chemical composition of sodium, aluminum, and hexafluoride (Na3AlF6).\n\nThis coat would seem as an attractive choice, given that it provides the highest reflectance at Lyω and longer wavelengths. However, it has the lowest band-gap energy (when compared to the other metal-fluoride materials) and this limits its use to wavelengths longer than about 118-120 nm. The cryolite salt is also a hygroscopic material that would have to be protected from degradation even in moderate levels of relative humidity (> 30 ↔ 40%).\n\nThe curve with the second highest reflectance at Lyω (↓ 91%) in Figure 11 is the one labeled as \"Ti+Al+MgF2\". This sample was made on a glass substrate that had a seed layer of titanium (Ti) under the Al coating and the MgF2 deposition was done at an elevated temperature of 225 C. It should be noted that this sample provides better performance when compared to the curve with legend \"Al+MgF2 (RT)\" where the MgF2 was deposited at ambient temperature."
    },
    {
        "id_": "ec960e9f-587e-4060-bc13-3ace0306f39f",
        "text": "# FUV reflectance performance\n\nThis sample consists of Al protected with AlF3, and was done at room temperature by using the e-beam plasma process. This sample exhibits a more balanced reflectance of around 90% (at 121.6 nm), while it is over 80% at wavelengths as short as 110 nm (on account of the larger band-gap energy of AlF3 when compared to cryolite or MgF2).\n\nWhen performance is required at wavelengths as short as 100 nm, the metal-fluoride material of choice is LiF. The two sets of samples with the LiF protection shown in Figure 11 are labeled as “Al+eLiF (265 C)” and “Al+eLiF+MgF2 (265 C)”. In reality, these two curves correspond to the same sample where the dashed blue line is the original sample (after the hot or enhanced LiF deposition done at 265 C), whereas the solid blue curve is the reflectance after the application of a thin MgF2 layer done via the ALD process. This thin ALD layer only reduces the reflectance by 1-2% from the peak value of 80% at 103 nm. A most important consideration is the fact that the ALD overcoat of MgF2 renders the sample much more environmentally stable when compared to the unprotected eLiF one.\n\nAn exciting recent coating possibility is shown in the “Ti+Al+XeLiF (RT)” curve. It was produced with the process described in Subsection 4.1. This XeLiF sample is made with the Al and LiF depositions followed by the fluorination of a XeF2 precursor gas. This sample shows a modest reflectance of 70% at 103 nm. However, the reflectance is over 80% for wavelengths longer than 110 nm. Another remarkable feature of this sample is the fact that reflectance has been shown to be tolerant to relative humidity of around 60% for over a 7-days period."
    },
    {
        "id_": "8e9f5951-4f55-4926-9fc5-7419931edaf9",
        "text": "# 4.4 Polarization Sensitivity\n\nThe results of the calculations based on ellipsometric measurements of optical constants are shown in Figure 12. The left panel of this figure shows the calculated average phase retardance for bare Al coatings as well as protected with various metal fluoride overcoats (such as AlF3, LiF, or MgF2). These results show an average retardance at the angle of incidence, AOI=12 that increases with decreasing wavelength in the spectral range shown in the figure. It is worth pointing out that there were no requirements for this specified in the LUVOIR/HabEx reports. Moreover, the average calculated coating-induced polarization is 0.11% at AOI=12 in the 200-3000 nm spectral range. This number compares very favorably with the requirement specified in LUVOIR/HabEx reports of < 1%. The coating-induced polarization measured at AOI=12 agrees with calculations, and this will represent a beam speed limit (and related packaging challenge) for the overall design. Overall, the choice of the protective metal-fluoride layer does not add much to the polarization aberration as long as this fluoride layer is not very thick."
    },
    {
        "id_": "0b5bcbc2-3e00-4047-bd1e-624ce3ab0aed",
        "text": "# 4.5 Coating Development towards HWO\n\nAs has been demonstrated, several coatings have reasonable broadband performance in reflectance in the UV through NIR. To reach TRL 6 for HWO, these coatings will need to be successfully deposited onto a meter-class optic and then measured on the optic itself to demonstrate the required uniformity. This will require scaling the process through a focused development effort, as there are no other missions likely that will have meter-class UV optics on the horizon.\n\n65 https://asd.gsfc.nasa.gov/luvoir/reports/\n\n66 https://www.jpl.nasa.gov/habex/pdf/HabEx-Final-Report-Public-Release-LINKED-0924.pdf"
    },
    {
        "id_": "73598987-f673-4724-b2fb-7f94a31c5443",
        "text": "# Polarization Sensitivity"
    },
    {
        "id_": "0d500832-d457-439b-96e9-21ca05e9874c",
        "text": "# Fig 12: Polarization Sensitivity\n\nRetardance (left) and normalized diattenuation (right) at AOI=12↓, which is the maximum acceptance angle stated in LUVOIR final report, of bare Al and Al protected with different fluorides (LiF, AlF3, and MgF2), calculated with experimentally derived optical constants.\n\n|%|Al+22.7 nm AlF3 (Red)|Al+18 nm LiE (green)|L|Al+22.7 nm AlF3 (Red)|\n|---|---|---|---|---|\n|415|Al+24 nm MgF2 (blue)|1|0.15|Bare Al (black)|\n| |Bare Al (black)| |0.05| |\n\ndeal value (no polarization aberration) - Ideal value (no polarization aberration)\n\n|Wavelength (nm)|200|700|1200|1700|2200|2700|\n|---|---|---|---|---|---|---|\n|Wavelength (nm)|200|1200|2200| | | |"
    },
    {
        "id_": "5fdd9323-433f-4701-8d5d-4e1a5b11b76d",
        "text": "# Development of a Test Facility\n\nDevelopment of a test facility for mapping the reflectivity of a meter-class optic. These coatings should also then be deployed on feed optics for ground-based high-contrast imaging testbeds to demonstrate compatibility with the coronograph. We propose these paths while we await the work of GOMAP to define the exact requirements needed for the observatory.\n\nAny new deposition method should also require on-orbit testing for resilience in the relevant environment. CubeSats and SmallSats are ideal platforms for such testing; sounding rockets provide the most rapid path to space, but not long-term exposure. The following list presents current and recommended advancement steps for UV coatings in the next 3 – 5 years to advance the technology in support of a late-2020s Phase A start for HWO:\n\n- Scaling, SPRITE = 16 x 18 cm; the next steps for capped Al+eLiF coatings should be half-meter then meter-scale optics\n- Scaling of XeLiF process to 1 meter diameter (via a current SAT grant)\n- Extend current ALD work especially for larger optics (ongoing collaboration between JPL and UCSC for larger chamber (Private Communication; J. Hennessy)\n- Demonstration of the most promising UV/O/IR coating candidate (to be evaluated in 2025-2026) in the space environment\n- Demonstration of repeatable uniformity segment-to-segment\n- Demonstration of appropriate coating uniformity and polarization properties to meet the coronograph driven requirements\n- Demonstration of steps between state of the art and 1m, likely requiring new test facilities to demonstrate these from UV to NIR.\n- Development of the characterization chain for HWO optical segments, including handling/shipping protocols and test facilities.\n\n23"
    },
    {
        "id_": "6b842772-1d76-4c8e-988b-c7bbe1957d81",
        "text": "# 5 Detectors\n\nDetectors are the heart of any telescope. In addition to being the end of the optical path, the sensor type, size of pixel, sensitivity, count rate limits, and other detector characteristics set many of the parameters for the instrument or telescope: e.g., a fast optical system typically requires small pixels, and vice versa. The limits and capabilities of detectors place strict limits on the science that can be achieved by any mission. UV detector development has lagged behind IR, due in part to a lack of commercial and military funding sources. In the last 15 years, NASA has invested in UV detector technology development via the APRA and SAT programs. As a result of these and other investments, there are several compelling UV detector technologies. Since at least the 2010 Decadal survey, UV astrophysics has worked towards a detector that can achieve the “triple crown” of sensors: Large format, high quantum efficiency, and low noise/high SNR properties. We also consider power requirements, out of band sensitivity and rejection. For spectroscopy, this often translates to a photon counting device. For imaging, photon counting is typically not needed. Below, we detail the current state of the art for microchannel plates and solid state detectors."
    },
    {
        "id_": "7447a8b3-217b-40e4-8782-b91b9f41f752",
        "text": "# 5.1 Microchannel Plates\n\nMicrochannel Plates (MCP) are widely used as an amplification stage in particle and photon detectors. They are comprised of parallel micron-diameter glass capillaries bundled into a two-dimensional array. Amplification occurs when a “primary” electron or other ionized particle, after being accelerated in an electric field, strikes the wall of a pore and excites multiple “secondary” electrons within the material. “Secondary electrons” escaping the pore surface are again accelerated in the electric field, eventually striking the wall, and generating a cascade effect as the process continues down the pore. Typical MCP based photodetectors incorporate a photocathode to convert photons to photoelectrons, a stack of 2 or 3 MCPs to achieve gains > 106, and a position sensitive anode.\n\nDetectors based on MCPs have flown on dozens of missions including sub-orbital, shuttle, space station, low Earth orbit satellite, geosynchronous satellite, and planetary missions, with hundreds of successful operational years accumulated. MCP detectors have been implemented for many successful UV astronomy missions and instruments, such as Extreme Ultraviolet Explorer (EUVE), Far Ultraviolet Spectroscopic Explorer (FUSE), Galaxy Evolution Explorer (GALEX), Hubble Space Telescope (HST) Space Telescope Imaging Spectrograph (STIS), and HST’s Cosmic Origins Spectrograph (COS). They are also on the recently launched NASA Ionospheric Connection Explorer (ICON) SMEX mission, Global-scale Observations of the Limb and Disk (GOLD) Mission of Opportunity, and are widely used on NASA UV suborbital sounding rocket and CubeSat investigations. SwRI’s Alice/UVS line of FUV spectrographs have a cumulative 50+ years of failure-free operation, with five instruments in flight and a sixth due to launch in 2024. Much of this success is partially attributable to the robustness and durability of MCP detector construction, their adaptability to a wide range of formats (including curved focal planes), choice of the sensitivity bandpass (utilizing different photocathodes as seen in Figure 16), lack of red end sensitivity, very low background noise and no requirements for cooling. MCP detector technology using imaging readouts, electronics, MCPs, and photocathodes, in open-faced and sealed-tube packages has continued to make significant advancements in the last few years.\n\n7 https://nap.nationalacademies.org/catalog/12951/new-worlds-new-horizons-in-astronomy-and-astrophysics"
    },
    {
        "id_": "178fb283-efbd-45a3-afc9-72572f6795a7",
        "text": "# Improvements in MCP Technology\n\nImprovements in background rate, quantum efficiency, spatial resolution, event handling rates, maximum size formats, thermal and mechanical robustness, lifetime stability, and low power/mass electronic readouts are all in various stages of implementation and infusion."
    },
    {
        "id_": "9509a6a0-2d29-437a-b5f4-8b8a2247843f",
        "text": "# Traditional MCPs\n\nA traditional MCP is implemented as a wafer of lead glass tubes forming a microcapillary array of semi-conductive tubes with a secondary emissive layer on the glass surface. Conventional manufacturing techniques are limited to formats less than 150 mm. The gain of traditional Pb-glass MCPs degrades with usage, requiring extended “burn-in” periods to stabilize the gain. Pb-glass MCPs also have background rates set by radioactive materials present in the glass (e.g., 40 K) and have approximately 2% detection efficiency for gamma-rays because of the Pb in the glass."
    },
    {
        "id_": "cd67f136-3668-4b35-844b-f8947ea3132e",
        "text": "# Advancements with ALD\n\nThe advent of atomic layer deposition (ALD) has opened the door to new MCP manufacturing techniques which have shown improvements to MCP performance. ALD is ideal for coating high aspect ratio parts, such as MCPs, and is compatible with materials demonstrating high secondary electron yield. These coatings have been applied to Pb-glass MCPs, for example, the MCPs used in the JUICE-UVS, to achieve better gain and detector lifetime, but the MCPs still retain the mechanical properties and background characteristics of conventional MCPs."
    },
    {
        "id_": "dae53d70-9e3f-498f-89e9-cfff688b3760",
        "text": "# Borosilicate Glass MCPs\n\nNew technology Borosilicate glass MCPs utilize ALD to provide both resistive and emissive surfaces. They have many advantages over traditional Pb glass MCPs, including more mechanical robustness (larger formats of 200mm have been successfully flown), very low intrinsic background (minimal radioactive content), a factor of 3 reduction in gamma-ray detection efficiency (no lead), and significantly improved gain stability. ALD MCPs with large-area formats (12 × 12 cm2 rates (<0.05 events/cm2/s), extended lifetimes (>4 × 1020 μm pores), and very low background with 10 μm pores, up to 20 × 20 cm2 with 13 events/cm2) without degradation have been made. Historical mission data shows that the in orbit background (for LEO) is strongly affected by the mass of the satellite converting galactic cosmic rays to local radiation background via Bremsstrahlung."
    },
    {
        "id_": "a4b5b626-f985-4d8f-aa33-94c9902b6f12",
        "text": "# Background Rates\n\nALD borosilicate MCP technology should also help reduce these contributions for both the pre-launch and in orbit backgrounds by a factor of 2.\n\n|Filled|Open|Total on-orbit background|Pre-launch background|\n|---|---|---|---|\n|HST-COS|8|EUVE|GALEX-FUV|\n|ALEXIS|l 0.6 8|Average pre-launch background for conventional MCP stacks|32 cntsecicm'|\n\nFig 13: Background for conventional MCP detectors in low Earth orbit. The trend suggests an on-orbit background rate increase consistent with the log of the satellite mass. ALD technology should significantly reduce this effect."
    },
    {
        "id_": "39a7d213-0ae4-4da8-84ad-32b3706f7724",
        "text": "# Photocathodes\n\nThe conversion of photons to electrons by the photocathode and photoelectron detection by the MCP determine the MCPs’ quantum efficiency (QE).86 The photocathode can be deposited on a window directly in front of the MCP (a proximity-focused semitransparent cathode) or directly onto the MCP (opaque mode).87–91 Opaque alkali-halide photocathodes are widely used for EUV/UV sensors, as are semitransparent multi alkali photocathodes for NUV detectors. EUV/UV photocathodes have broadband response with efficiency peaks at wavelengths where photoelectron emission maximizes. These reach to more than 50 percent detective quantum efficiency (DQE) around 100 nm, more than 60 percent at about 500 nm, and over 70 percent around 12 nm depending on the material chosen. NUV DQE is somewhat lower at about 30 percent at 180 nm for bialkali photocathodes. Alkali-halide (CsI, KBr) opaque photocathodes on MCPs obtain high QE (50% at ↓110 nm) and have broadband sensitivity from 10 nm to 160 nm. We compare photocathode material performance in Figure 16."
    },
    {
        "id_": "d834f66f-b9eb-4104-a274-30e2ed068ce4",
        "text": "# Readout Techniques\n\nCross delay line, and more recently cross strip conductive patterned anodes are often the choice for UV MCP imaging detectors. These anode schemes derive photon event centroid positions from the charge distribution that an event produces across a set of strips in an MCP amplified detector. The incoming photon produces a primary electron(s) from the photo-"
    },
    {
        "id_": "2208ef50-2f9d-4710-903d-1eae4cea78e5",
        "text": "# Figures\n\nFig 14: 20 x 20 cm Microchannel Plate with XDL readout for the DEUCE rocket program.\n\nFig 15: INFUSE (2023) 100 mm XS Detector with 25 μm resels."
    },
    {
        "id_": "99880f74-6992-4733-a957-509a17224602",
        "text": "# Fig 16: Detective quantum efficiency (DQE) as a function of wavelength for different photocathode materials as shown in the key.\n\n|KBr|Bialkali|CsBr|Csl|GaN|\n|---|---|---|---|---|\n|500|500|500|500|500|\n|1000|1000|1000|1000|1000|\n|1500|1500|1500|1500|1500|\n|2000|2000|2000|2000|2000|\n|2500|2500|2500|2500|2500|\n\nCathode. Each photoelectron is then multiplied within the pores of a microchannel plate pair and the resulting electron cloud is collected on two orthogonal sets of metal strips that form the anode. To obtain an accurate event position the size of the electron cloud is optimized so that the charge impinges on several neighboring strips. The cross delay line derives positions from the difference in pulse arrival times at opposing ends of serpentine delay lines in each axis formed from connecting the strips. The cross strip anode provides signal amplitudes on each strip allowing sub-strip accuracy centroiding to be accomplished. The cross strip scheme achieves high spatial resolutions (sub 20 μm) at relatively low overall MCP gain (less than 1,000,000). Recently, cross strip anode formats of 100 mm have been implemented in both open face and sealed vacuum tube compatible (UHV/500 deg C) configurations as a significant step towards large area devices suitable for HWO spectroscopy detectors."
    },
    {
        "id_": "0064290d-ff03-4158-b200-9d21948603c5",
        "text": "# Imaging electronics\n\nCandidate MCP detector photon event readout systems include both cross delay line (XDL) and cross strip (XS) anodes. Low power, high performance electronics for cross delay lines have been implemented in a number of forms for existing missions and can be finessed for future application using current state of the art components. However, XS readouts are more appropriate for large area, high performance detectors for HWO. XS electronics implemented with discrete components are working well for recent instruments, but recognizing the need for low mass/power electronics for future applications an effort is underway to produce compact ASIC electronics. Prototypes (GRAPH - Gigasample Recorder of Analog waveforms from a Photodetector) have already demonstrated low power consumption and promise the ability to process events at high rates (more than 10 MHz) with power consumption of less than 7 W for a 50mm detector. GRAPH ASICs are also configured to be used in parallel so that larger format XS detectors are addressable with adapted firmware.\n\n27"
    },
    {
        "id_": "a64e71d3-8e20-4f78-8259-b5e0ee1662dd",
        "text": "# 5.2 Solid State Detectors\n\nSolid-state detectors offer significant advantages in size, mass, and manufacturability compared to the vacuum tube based technology of MCPs. Using solid-state detector arrays improves instrument compactness and reduces instrument complexity.\n\nThere are intrinsic advantages to the fabrication of solid-state UV detectors in wide bandgap material such as gallium nitride and its alloys. Their bandgaps, ranging from 4.6 eV (GaN) to 6.2 eV (AlN), offer a broad range of out of band rejection thresholds, while their direct bandgap for the entire range of alloys enables strong absorption of UV photons, and their wide bandgap could enable higher operating temperatures. There are, however, practical material challenges to fabricating high quality detectors in III-N materials. The lack of native substrate in the III-N family creates challenges for producing high quality crystalline material and doping of these semiconductors—the first step of creating a semiconductor junction and detectors—remains challenging.\n\nSilicon carbide is another wide bandgap (3.26 eV) material with direct bandgap and intrinsic properties for visible rejection and higher operating temperatures. While SiC is not as tailorable as III-N material for the cutoff wavelength, it can be grown on silicon wafers, a clear advantage for manufacturability.\n\nThere is enormous past and continuing investment in silicon imaging devices which can be leveraged for scientific UV imaging. Silicon imaging and detector arrays, especially charge coupled devices (CCDs) and complementary metal oxide semiconductor (CMOS) arrays, are ubiquitous in different fields of imaging applications. This is due in part to the steady advancement of silicon VLSI (very large-scale integration) technology and the consumer market for imaging. Shortly after the invention of CCDs in 1969 at Bell Labs, extensive programs were established at JPL to advance early CCDs for imaging systems aboard NASA’s Flagship mission Galileo and its first Great Observatory, HST. For a more in-depth discussion of the history of CCDs and their use in space-based applications, we refer the reader to and.\n\nCMOS-based imaging started around the same time in the 1960s, but it was not until the 1990s that their development began in earnest, due in part to fabrication advancement and to focused effort of CMOS-Active Pixel Sensor development at JPL and other CMOS images elsewhere. CMOS imaging has had an enormous impact on the consumer field and in recent years has become viable for scientific applications.\n\nIn the UV, the short photon absorption distance coupled with the formation of carrier traps (electrons in n-channel and holes in p-channel devices) in the Si-SiO2 result in negligible QE below 400 nm in the front illuminated silicon devices or even unpassivated back illuminated silicon devices.\n\nThe naturally-occurring traps due to positive charge trapping in the Si-SiO2 interface, can be countered by the addition of charges of opposite polarity, e.g., a thin crystalline layer of silicon with embedded high boron density in a single atomic sheet. This delta-doping process results in silicon detectors that have reflection-limited response, i.e., near 100 % internal QE from very soft x rays through near infrared, ↓ 1 μm, at which point silicon becomes transparent to photons. Because delta doping is a back surface process, it is agnostic to the readout structure and silicon detector architecture and essentially any silicon detector can become UV sensitive, allowing the mission to benefit from the very large commercial pool and latest designs in silicon detectors.\n\nWith photo-electrons efficiently collected in silicon detectors through delta doping, the QE can be further tailored by the addition of anti-reflection coatings or filters for out of band rejection."
    },
    {
        "id_": "a4a01fdf-4ae4-4906-8abf-f7904e099c68",
        "text": "# Delta-doped CCD"
    },
    {
        "id_": "5bffda20-6237-48ca-bdcc-0770f2ebddb0",
        "text": "# (AR-coated)\n\n|Wavelength (nm)|QE (%)|\n|---|---|\n|200|70|\n|300|60|\n|400|50|\n|500|40|\n|600|30|\n|700|20|\n|0|10|"
    },
    {
        "id_": "4c8ebfec-f174-4108-86a0-8cc74b598e29",
        "text": "# (uncoated)"
    },
    {
        "id_": "8abbf7c5-30ce-4364-8d4b-8353b01196c1",
        "text": "# Front-illuminated\n\n|Wavelength (nm)|QE (%)|\n|---|---|\n|200|70|\n|300|60|\n|400|50|\n|500|40|\n|600|30|\n|700|20|\n|0|10|\n\nFig 17: Delta-doping involves a doping layer to a back-illuminated silicon detector, which eliminates an electron well in the detector surface. The result is silicon detectors sensitive in the UV. The QE can be further increased by the addition of anti-reflection coatings. Left: solid lines are models, markers are measurements, showing early results of delta-doped and AR Coated devices. Right: single layer AR Coatings using atomic layer deposition (ALD) and thermal deposition (MgF2 only) are applied for higher throughput in the NUV and FUV."
    },
    {
        "id_": "409d968a-1dd3-42ed-8633-07cd53a833b2",
        "text": "# Layer MDF\n\n|Material|Type|\n|---|---|\n|AlO3|aluminum|\n|Al2O3|aluminum|\n|AlO3| |"
    },
    {
        "id_": "0abbbe17-7bcf-46a7-b643-d6b4dad78c48",
        "text": "# silicon APD\n\nFig 18: Left: Schematic of the implementation of a metal dielectric filter (MDF). Left center: Linear scale QE of two example MDFs optimized for 225nm. Right Center: Alternative MDF example, with peak performance at 190 nm. Right: MDF optimized for FUV Bandpass, showing both reflectance from detector with integrated filter and transmission into detector.\n\nAs large as 50% to 60% are possible, with nearly 3-4 orders of magnitude out of band rejection with bandpasses whose location can be arbitrarily chosen. Further tailorability can be achieved by detector-integrated filters. Three to four orders of magnitude rejection has been obtained by incorporating metal dielectric filters directly on delta doped detectors. The thick aluminum layer provides blocking of the visible light while allowing UV photons to reach the detector surface. Depending on the spectral range of interest, the dielectric material of choice would be an oxide or fluorides. Adding each metal-dielectric bilayer will provide additional out of band rejection but because the metal layer is not entirely transparent, there will be tradeoff between the out of band rejection and in band peak quantum efficiency."
    },
    {
        "id_": "afcc0463-cb08-41de-850a-5b02dead7dfd",
        "text": "# Fig 19: A range of Delta doped and AR coated devices spanning various formats (1kx1k, 2kx1k, 2kx2k, 2kx4k, etc) and architecture (EMMCD, CCD, Full depletion CCD, etc) and polarity (n-channel and p-channel CCDs) from JPL which have been used for suborbital and ground-based missions.\n\nBecause the processes developed are independent of the frontside architecture and format, the end-to-end post fabrication processing including delta doping and special coatings."
    },
    {
        "id_": "0e87021f-955e-47ff-a991-f2a4d0322f60",
        "text": "# Architecture variants\n\nSolid-state Silicon devices all rely on similar architectures- a pixel for photo-electron collections, either directly connected to a readout amplifier in the case of CMOS devices or coupled to neighboring pixels in the case of CCDs. For a CCD, at least one and up to tens of readout amplifiers are used for reading out the charge in all pixels in a single device. The CCD architecture has been the dominant detector of choice for visible wavelength and ground based astronomy. Due to their serial readout scheme, CCDs have longer readout times than CMOS devices but have historically had lower noise in the amplifier, and fewer amplifiers per device make image processing more straightforward. In recent years, CMOS devices have advanced such that the read noise in each amplifier is low enough for scientific use and variations between pixels are no longer a significant disadvantage. Depending on how they are designed and operated, CMOS devices can have low fill factors (area of a pixel that is photo-sensitive) and are sometimes matched with microlenslet arrays to improve throughput. In recent years, low noise and back illuminated scientific CMOS imaging arrays have been developed. The recently selected Explorer UVEX is planning the use of 4kx4k delta doped and low noise CMOS arrays. The FUV version of the UVEX detectors plan to use detector-integrated filters."
    },
    {
        "id_": "a2c4b633-cc74-425c-8295-33b95bdea3a9",
        "text": "# Solid state photon counting detectors\n\nWhen using a normal silicon CCD, it is impossible to tell the exact number of photo-generated electrons in a pixel because the added detector noise is usually too large; with conventional CCD read noise of a few electrons, a single sample will be unable to distinguish between individual electrons in a well. Several different technologies enable photon counting in a solid state detector, which we describe briefly below.\n\nA variant of CCD is the Electron Multiplying CCD (EMCCD), which implements an additional set of pixels between the normal CCD serial register and the readout amplifier. They consist of a normal CCD image area with an additional serial register added after the normal serial register. This addition to the serial register of an EMCCD contains serial pixels that replace one clock of the pixel with a DC level pixel and a high voltage (HV) clock. These multiplication pixels have a high voltage applied to them, creating deep wells for electrons to impact and ionize as they enter the pixel. This impact ionization generates more electrons, yielding a significant gain over the course of several hundred multiplication pixels. This allows for photon counting with a CCD since the multiplication gain will increase the number of electrons in a pixel to well above the read noise. EMCCDs need to be operated carefully, however, to limit only a single photon event per pixel."
    },
    {
        "id_": "11510158-749d-4b7d-a7f2-236dcb13f6ef",
        "text": "# 3-Layer"
    },
    {
        "id_": "bc5f0f30-1f4b-4543-89b6-9633c713cf2f",
        "text": "# 5 Layer\n\n| |175|195|215|235|\n|---|---|---|---|---|\n|Wavelength (nm)| | | | |\n\nFig 20: Delta doped and AR coated 1kx2K EMCCD prepared for FIREBall-2. LEFT: quantum efficiency of a three-layer AR coated device (red) and five layer AR coated device (blue). RIGHT: photographs of delta-doped 2KX1K EMCCDS. Different colored detectors have different AR coatings applied.\n\nhave other noise sources that are added by the multiplication process. The advantage of the EM gain process is that it increases the signal from a single photo-electron to a value much larger than the on-chip amplifier read-noise. This process means single events can be detected by a threshold process. When operated in photon counting mode, pixels with counts greater than 5 times the read-noise are considered to have had 1 event. Pixels with counts less than this threshold are considered to have zero events. Some complications come along with this process. Not all electrons in the device will be amplified above the 5 sigma threshold. The multiplication process is stochastic and depends on the gain applied. Additionally, noise comes from clock induced charge (CIC) and dark current. For an EMCCD, both of these noise sources will be amplified in the same manner as photo-electrons and need to be addressed in analysis.\n\nEMCCDs are currently used on several missions at a range of mission sizes: FIREBall-2 (a balloon borne UV multi-object spectrograph), the Roman Space Telescope, SHIMCO (an astrophysics UV Rocket). EMCCDs are also baselined for several missions in planning stages: a New Frontier’s SILENUS, PRISM (a lunar mission), a lunar DALI (Development and Advancement of Lunar Instrumentation) instrument, and was the baseline detector for HabEx.\n\nOne of the emerging technologies that may provide promise for astrophysical photon counting is the skipper CCD architecture. A skipper CCD uses a non-destructive read-out amplifier and is able to sample a single pixel multiple times. This effectively reduces the read noise by several orders of magnitude depending on the number of samples. The reduction in noise is equal to the square root of the number of samples. This type of device had been described previously but has finally been made workable. As an example, using a 3.5e- read noise amplifier and 4000 samples per pixel, the effective read noise is reduced to 0.068, well below the typical value of 0.16 usually required to clearly distinguish between numbers of electrons. Thus a skipper CCD can distinguish between 0 and 1 electrons in a pixel, which is the typical expectation for photon counting, and matches what an EMCCD or MCP can do. But it can also distinguish between 1 and 2, 2 and 3, 3 and 4, and so on up to the saturation limit of the well (see Figure 21)."
    },
    {
        "id_": "3ba5d938-b13e-4572-a9b7-25bf119c67bb",
        "text": "# 6 Gratings\n\nUV spectroscopy has historically suffered from low-performance hardware compared to other wavebands, in part due to the inherent challenges in material properties at UV wavelengths (absorption in common VIS/IR substrates, degradation over time, etc). In particular, UV high-resolution spectroscopy is limited by low efficiency gratings (typical efficiencies of <40%; e.g.,105, 106) and scattered diffracted light that severely increases background levels (e.g.,106–108). The biggest limitation to building high-sensitivity, high-resolution UV spectrographs is the low performance of UV blazed gratings. Advances must be made to achieve the high-efficiency blazed gratings that will be necessary to enable a high-resolution (R>30,000) UV spectrograph on HWO.\n\nHistorically, UV gratings used in astronomical instruments have been ruled either mechanically or holographically. Mechanically ruled gratings are produced using a diamond stylus to cut and shape grooves, while holographic gratings are produced using interference lithography, resulting in a sinusoidal groove profile at the specified density. Mechanically ruled gratings are capable of good diffraction efficiency as a result of their sharp, blazed facets, but typically suffer from groove period errors that induce scatter and ghosting. Conversely, holographic gratings are capable of precise groove placement, which minimizes stray light, but generally lack the diffraction efficiency achievable with a mechanical ruling process. While it is possible to improve upon holographic grating efficiency by directly recording a blazed facet in the photoresist using sophisticated holographic recording techniques, these techniques are resource intensive. In addition, for both ruling techniques, fabrication processes limit the achievable groove spacing; mechanical ruling is not"
    },
    {
        "id_": "9616bd14-93a3-40c0-a9ef-159c6608236f",
        "text": "# Fig 21\n\nHistogram obtained in the visible showing the photon counting and photon number resolving capability of Skipper CCD. Each peak represents an integer number of electrons in a bin. The main figure shows the clear delineation between pixels with zero electrons and pixels with one electron. The inset figure shows that this clear separation is present at higher electron counts, 775 to 779 electrons per pixel. Figure from104\n\nmeans a skipper can perform photon counting and is not limited by the typical rate requirements of an EMCCD (which can only distinguish between 0 and 1 electrons in a pixel, if the frame rate is correct for the observation) or an MCP. An example of the ability to detect faint sources is shown in Figure 22, where various detector types are contrasted for an observation of faint emission from the CGM of a nearby galaxy."
    },
    {
        "id_": "039a61f6-8b91-47f9-887d-d2bb7a2a1069",
        "text": "# Fig 22\n\nSimulated CGM around a Milky Way type galaxy shows faint, extended, filamentary structure. The panels show mock observations and the resulting SNR distribution (random-noise effect included) from an IFU with the simulated performance of a:\n\n- (Top) Skipper CCD\n- (Middle) EMCCD\n- (Bottom) MCP\n\nThe white rectangle shows that the Skipper CCD can detect a very faint diffuse gas signal with greater fidelity compared to an EMCCD or MCP for otherwise the same conditions.\n\n33"
    },
    {
        "id_": "77421095-59f8-40af-930c-174712f059c0",
        "text": "# 6.1 UV gratings with electron-beam lithography\n\nIn response to NASA’s Astrophysical Strategic Technology Priorities and Gaps program, which recognized the need to improve all aspects of UV hardware, enormous progress has been made on the crucial task of improving UV gratings. Electron-beam lithography (EBL), enabled by semiconductor nanotechnology, offers a flexible method for patterning customized, minute features over large areas and, is therefore well-suited to patterning UV gratings. EBL achieves isolated feature sizes of →10 nm, an order of magnitude smaller than required for most UV gratings.\n\nRecent development in EBL gratings for UV applications has leveraged years of progress in X-ray grating fabrication, where EBL and complementary nanofabrication techniques are used to manufacture small-period gratings capable of high spectral resolution and high diffraction efficiency. These nanofabrication processes allow for customizable groove layouts, densities, and facet angles, all of which are defined prior to fabrication. The desired groove pattern is then exposed with an EBL tool in an electron-beam-sensitive resist, which coats the grating substrate. The pattern is then further developed and etched to embed the desired groove pattern into the substrate itself. The etches that transfer the pattern into the substrate retain the groove layout exposed with the EBL tool such that the overall groove placement is largely determined by the quality of the EBL exposure."
    },
    {
        "id_": "cb5f0856-cec3-4558-a446-e63899f5a287",
        "text": "# Current state of the art in EBL gratings\n\nThe state of the art in UV gratings fabricated via EBL relies on precise groove placement on the nm scale from advanced EBL tooling, pattern transfers into the grating substrate via a series of dry etches, and blazing the grooves to a custom facet angle with potassium hydroxide (KOH) etching. An EBL grating blazed with KOH etching was fabricated for the ESCAPE small-explorer mission concept. The ESCAPE prototype was coated with Au and achieved >75% peak absolute diffraction efficiency. Further compared the performance of a prototype, blazed EBL grating to a previously flown mechanically ruled grating, finding that the EBL grating achieved a 50% increase in absolute diffraction efficiency and a factor of →5 improvement in scatter. Showed that a 50 mm ↗ 50 mm grating with a 1-μm period written with EBL is expected to reach a spectral resolution R → 35,000, matching grating performance onboard HST/COS when taking into account the difference in groove density.\n\nUV gratings have also been fabricated at a range of groove densities and patterns, ranging from →10-μm down to →110-nm groove spacing and from parallel to aberration-correcting groove profiles.\n\nThere have also been substantial advances in patterning large areas with University-grade EBL tools. For example, the fabrication of a 100-mm ↗ 107-mm (>100 cm2) X-ray grating patterned using EBL in just a few days has been reported, and UV gratings as large as 36 cm2 have been manufactured and tested. EBL tools are automated, requiring no human input to complete a patterning run once initiated. EBL tools maintain focus over long duration runs by checking alignment patterns outside of the pattern boundaries, so are robust against changes in environmental."
    },
    {
        "id_": "8069465e-ca20-4767-b677-79ce85dfe73e",
        "text": "# Ongoing EBL Development\n\nWith promising early results on UV echelles, flat substrates, and a range of groove densities and facet angles, ongoing development is focused on maximizing customizability, one of the primary advantages of EBL processing. Active focus areas for curved gratings include scaling current EBL techniques to larger areas and the placement of curved grooves on non-planar substrates, both of which are critical for a broad range of aberration correction capabilities. Additional development efforts currently funded under NASA APRA and SAT programs include strategies for consistent, repeatable groove placement over large write areas, characterizing achievable resolving power and diffraction efficiency over a broad range of groove profiles, and maturing additional techniques to produce blazed facets as alternatives to KOH etching.\n\n110 showed that, while KOH etching yields atomically smooth groove facets capable of high diffraction efficiency, etch fidelity begins to deteriorate for groove directions that deviate ↫2↓ from a nominal layout direction. This degradation is due to the etch’s reliance on the crystal structure of the silicon substrate; the KOH etches to a specific family of crystal planes, the {111} planes, and sets of {111} planes are parallel to each other. As the relative groove curvature exceeds →2 ↓, the etch conditions evolve such that the quality of the groove size and surface degrades. For applications that require aberration-correcting profiles with a large amount of curvature and where diffraction efficiency is paramount, alternative blaze techniques may be capable of improved performance over the existing state of the art with KOH etching."
    },
    {
        "id_": "00ea577e-c7ef-4c46-a676-0009ce3e16de",
        "text": "# Alternative Techniques for Blazed UV Gratings\n\nTwo alternative techniques are being developed to produce blazed UV gratings capable of high diffraction efficiency and low scatter. In each case, the techniques rely on EBL to expose the overall groove layout and therefore retain the resolving power capabilities possible with EBL gratings. Thermally activated selective topography equilibration (TASTE) has been in development for EUV and X-ray grating applications and uses “greyscale” EBL and thermally activated EBL resist to sculpt blazed facets.120 Greyscale EBL uses a modulated electron dose across individual grating groves to generate a variable-height groove profile, which is then thermally reflown to create a continuous, blazed facet. TASTE has been demonstrated on gratings with densities as high as 2500 grooves/mm, with early results showing EUV diffraction efficiency of →60%.120 At higher groove densities, however, greyscale EBL becomes more challenging; further development and process optimization is needed for such applications.\n\nGratings blazed using ion-beam etching (IBE) were recently developed for X-ray applications and the processes are transferable to UV gratings.121 IBE, which has also been used to blaze holographically ruled gratings (e.g.122), uses EBL to expose the desired groove layout, a series of."
    },
    {
        "id_": "f870bfc5-ffc4-4f71-a6b5-f2ea17008f6d",
        "text": "# 7 Spectral Multiplexing Technologies\n\nSpectral multiplexing offers the simultaneous acquisition of spectroscopic information from multiple objects or regions within a telescope’s field of view (FOV) within a single pointing. Ground-based spectral multiplexing techniques rely on fiber optics, multilenslet arrays (MLAs), or reflective image slicers (KCWI, MUSE). These devices are used to dissect a target region into non-overlapping spatial regions to obtain large numbers of spectra ideally at the resolution limit of the telescope and spectrograph. MOS technologies used in ground-based instruments deploy individual fiber optics to target locations, historically by hand plugging plates, and most recently by implementing robotic positioners (i.e. MOONS, SDSS-V, DESI). IFUs will often use close packed fiber optic bundles along with a lenslet array to dissect a contiguous target field. Fibers have not historically had high transmission in the ultraviolet, although sub-orbital testing was done during the first Faint Intergalactic Redshifted Emission Balloon flights and development is ongoing. MLAs for astronomical applications are made of fused silica, but are limited in transmission by anti-reflective coatings of limited bandpass. An FUV reflective image slicer has flown on the Integral Field Ultraviolet Spectrograph (INFUSE), a sounding rocket-borne instrument and the first FUV IFU to fly with access to wavelengths below 1150 ˚A.\n\nHere we review micro-electro mechanical (MEMs) technologies that employ either arrays of clear aperture micro-slits, reflective micro-mirror arrays, or reflective “slit-farms” to partition the field prior to spectral acquisition as well as reflective image slicers, as potential effective flight qualified multiplexing approaches that have some space-based heritage and potential in the ultraviolet."
    },
    {
        "id_": "23131dd4-3df8-4194-a0c6-755fa3a7d13f",
        "text": "# 7.1 Microshutter Arrays\n\nMicroshutter arrays (MSA) are programmable multi-aperture micro-slit devices that were developed by GSFC for use on the JWST Near Infrared Spectrograph (NIRSpec). MSAs allow for the simultaneous acquisition of spectra from multiple objects in the FOV, enabling spectroscopic analysis on an industrial scale equivalent to that long enjoyed by multi-object fiber optic fed spectrographs in ground-based applications. Their use on JWST is ushering a revolution in space-based spectroscopic analysis. These arrays can be programmed to provide any pattern of slits."
    },
    {
        "id_": "9e17b35e-e724-402f-afd9-968f717603cd",
        "text": "# MSA Slitlet Configuration\n\ncorresponding to sparsely distributed sources on the sky. It can also be programmed to provide shaped slits on extended sources. A NIRSpec MOS example is shown in Figure 23.\n\n|MSA Slitlet|MSA Quadrant 3|MSA Quadrant|\n|---|---|---|\n|Configuration Spectra|Failed Open Single Shutters|(Fixed Slits Always Open)|\n|Zero Order Images of Right quadrant slitlets|Associated Spectra|Detector NRST|\n| |MSA Quadrant|MSA Quadrant|\n| |Detector NRS2| |\n\nFig 23: Example of NIRSpec MOS spectra acquired under illumination of a test slit pattern with a calibration lamp.\n\nThe 1st generation MSAs flying on NIRSpec were optimized to provide high contrast in the cryogenic environment required for IR observation. The operation involved a combination of electrostatic and scanning magnet actuation that requires a heavy complex mechanical assembly. GSFC has recently developed Next Generation MSAs (NGMSAs) that retain much of the original."
    },
    {
        "id_": "c46bd2fe-d754-494e-b728-77a08bd9d798",
        "text": "# MSA Egg-Crate Detail\n\n|FEn|FEn+1|FEn|\n|---|---|---|\n|SiO2|SiO2|SiN43|\n|GE|GE|GE|\n|GE|AlO32|AlO3|\n|GE| |2|\n|HumlinHar|BEn+2| |\n| |BEn+1| |\n| |BEn|BEn+1|\n\nFig 24: Left – MSA egg-crate detail. Middle – Shutter blades viewed from light-shield side. Right – Shutter unit cell with material layers (light-shield not shown). The egg-crate frame of Si is held at ground (GE) and coated with an insulating layer of ALD grown Al2O3. It is isolated from the Si3N4 shutter that is coated with Front Electrode (FE). A Back Electrode is deposited at an angle over the wall of the Al2O3. A potential difference between FE and BE attracts the shutter to the wall to latch it in the open position. Removal of the potential difference causes the shutter to relax to the closed position.\n\n37"
    },
    {
        "id_": "4d49e086-da93-4c00-93d2-1724f303dff0",
        "text": "# MSA Format Development Trend for Cosmic Origins\n\nachievable with micromirrors (Kutyrev et al., 2008; Travinsky et al., 2017). The ease in which NGMSAs can be integrated into a wide range of instrument optics designs ensures broad science community return on investment in this technology. The wide range of Decadal Survey mission concept studies that incorporated the MSA (The Large UV/Optical/IR Surveyor (LUVOIR), The FORTIS, JWST)."
    },
    {
        "id_": "ec6f2fc5-43f3-48c4-983a-4aa9cba9220e",
        "text": "# Figure 1.2\n\nMSA format development trend for Cosmic Origins is shown. Our pilot (FORTIS) and JWST formats are shown on the left. A concept and manufacturing development array produced by GSFC fiscal year FY18 Strategic Astrophysics Technology (SAT) project is shown in the center. Our FY18 SAT project also produced a ruggedized design of an array mounted on a ceramic carrier with supporting grid that is suitable for spaceflight is shown on the right.\n\n|Format|Dimensions|Development|\n|---|---|---|\n|FORTIS|128 x 64|Manufacturing|\n|JWST|365 x 171|Development (840 x 420)|\n|Qualified|736 x 384|FY18 SAT|\n\nThe design shown on the right has been demonstrated through tests to general environmental verification standard (GEVS) vibration levels for evolved expendable launch vehicle (EELV) launch. We propose this format for the Decadal Survey IROUV strategic mission application going forward."
    },
    {
        "id_": "5c44a9cf-4ec0-4f1e-aec5-d10d15168916",
        "text": "# Figure 26\n\nLeft - FORTIS 128x64 NGMSA on PCB carrier. Right - NGMAS assembly installed at the FORTIS prime focus.\n\nArchitecture but have eliminated the need for a scanning magnet. This advance was enabled by the combination of thinner shutters and improvements in electrical isolation between shutters and ground. Together these improvements permit purely electrostatic actuation, greatly decreasing the time to open/close or address selected shutters from several seconds to a fraction of a second.\n\nShutters are etched into a silicon nitride (Si3 N4) layer, forming an array with a pitch of 200 μm. Each shutter is connected to the array by a torsion hinge that is suspended above a 100 μm thick support grid called the “egg-crate” (Figure 24 – Left). Complete 90 deflection and latching open of the shutter is provided by a potential difference between electrodes deposited on.\n\n38"
    },
    {
        "id_": "c9f8d70f-de3e-4aa0-841f-3ce4764af411",
        "text": "# 7.2 Digital Micromirror Devices\n\nMultiobject and integral field spectroscopy can also be achieved using a digital micromirror device (DMD) - an array of many small mirrors (→ 10μm on a side) (Figure 27), developed by Texas Instruments and currently widely used in video projection and 3D printing applications. Each mirror of the DMD can be tilted into one of two orientations, usually ±12 ↓ with respect to the device plane’s normal orientation. In this way, light incident on the DMD can be directed into one of two directions, or “channels”. In the most straightforward implementation, a DMD can be used to create hundreds of “slitlets” in the field of view and direct light from those locations to a spectrograph, while blocking the rest of the FoV. DMDs serve a similar function to MSAs in a spectrograph, but with a key fundamental difference: DMDs are reflective devices, whereas MSAs are transmissive. This allows DMD and MSA-based spectrographs unique auxiliary capabilities. For example, in a typical MOS observation, the slitlets only cover → 1% of the field of view (by area). A DMD MOS can be designed with a parallel channel, to utilize the light not sent to the primary spectrograph (to do deep imaging, slitless spectroscopy, etc). However, a DMD-based spectrograph must contend with the reflectivity and scatter of the DMD mirrors, while MSA shutters are completely transmissive at all wavelengths."
    },
    {
        "id_": "0503aa5b-d97b-442a-9baf-013bb8d320ce",
        "text": "# Mirror"
    },
    {
        "id_": "6ee16086-d49c-4647-8976-b3d32be265fa",
        "text": "# B"
    },
    {
        "id_": "427e7f6a-d516-4a06-8dc5-4c395f084f15",
        "text": "# 8"
    },
    {
        "id_": "fe946fd8-acd2-4f82-9f1d-aa979ed69c30",
        "text": "# Hinge Yoke"
    },
    {
        "id_": "fb4150b6-a936-4fec-b4c8-59d944934e76",
        "text": "# Spring Tip\n\nFig 27: Left: a 1024↗768 mirror DMD with a custom NUV-transmissive window. Middle: a close-up of several micromirrors, each 13μm on a side, with a 92% fill-factor. Right: A schematic of the micromirror hinge and tilt mechanism; note DMDs tilt about their diagonal.\n\nSeveral spectrographs based on DMDs have been built for ground-based telescopes, including: RITMOS, 141 IRMOS, 142 BATMAN, 143 and SAMOS. 144 To demonstrate the suitability of DMDs for deployment in space, a NASA SAT program was developed to perform flight qualification activities and to investigate the prospects for window replacement. Overall, it was determined that DMDs are not particularly sensitive to shock and vibration loads145, 146 or the radiation environment, except in the most extreme conditions.147–151\n\nAlthough commercially available DMDs are designed for use in the visible regime, their throughput can be extended into the NUV regime, to 170 nm by replacing the stock BK7 window with a suitable material (such as fused silica, sapphire, or MgF2). For use in the shorter wavelengths, it may be possible to re-coat DMDs with the kinds of coatings that have been developed for monolithic optics in the FUV (see Section 4). However, because only commercially available DMDs are sufficiently mature for use in space-based instruments, there are size limitations. In general, larger missions allow for telescopes with more fine spatial resolution and effective area; however, the fixed size of the DMD results in a decreasing field of view, with increased focal length. To enable a larger field of view, multiple groups are exploring the possibility of mosaicing DMDs."
    },
    {
        "id_": "cd183c3f-e12c-4548-bd28-1dad0da7acaf",
        "text": "# 7.3 Integral Field Units\n\nIFUs powered by image slicers provide a way to obtain imaging spectroscopy in the FUV while avoiding the low transmission of fiber bundles. These systems consist of a slicer cube and a pupil array. The slicer cube is a stack of thin mirrors rotated at slightly different angles to reflect light onto a pupil array. Traditional image slicers use a pupil array of mirrors to realign the beams from each slicer element so that the image, when refocused, maintains a specific shape, generally an array of “long-slit” fields of view (defined by the image slicer) arranged end-to-end to avoid spectral confusion. The system is then diffracted by a grating and re-imaged by a set of camera optics. An image slicer first flew on the JWST Mid-Infrared Instrument (MIRI).152 The first FUV IFU, an image slicer, flew on NASA sounding rocket flight 36.375 UG Fleming aboard INFUSE. The INFUSE slicer cube, provided by Canon, Inc., consisted of 26 slices micromachined out of invar and copper to 7.1 ˚A RMS surface roughness and a ε/20 flat figure.153 It was coated in conventional Al+LiF through a partnership with GSFC.130 There are currently plans to coat the flight spare in Al+eLiF."
    },
    {
        "id_": "d701ab2b-0d1c-4471-8e32-ec638fbcfa6b",
        "text": "# INFUSE Image Slicing"
    },
    {
        "id_": "614b9da3-1e94-41c1-bf99-2ca9e82f88e6",
        "text": "# Pupil Grabna"
    },
    {
        "id_": "fc59fd0e-0410-48dc-9618-06b3117cd559",
        "text": "# Slicor Cubo"
    },
    {
        "id_": "4640e199-feb1-4019-999b-22d58abb7e91",
        "text": "# IuSIe"
    },
    {
        "id_": "c2d6ee82-840a-4491-89c7-d9bc112283a2",
        "text": "# olwnich pioducesa\n\nFig 28: Left: INFUSE image slicer concept. Cygnus Loop image credit:.154 raytrace with pictures of the slicer cube, grating array, and MCP detector inset."
    },
    {
        "id_": "083341da-4117-47b8-bc56-5d5a272d11fc",
        "text": "# #CPDuteclor"
    },
    {
        "id_": "949d784e-85a1-4a43-a053-a00a4e5e2626",
        "text": "# Dispersion Directions (opposi0 for toplbottom pupE gralings"
    },
    {
        "id_": "ba83960f-0d41-4c95-9d43-0f2ff09c31d0",
        "text": "# Grating ATay"
    },
    {
        "id_": "0aa03892-c0f4-4843-be85-8f82b2c8bb84",
        "text": "# Right: INFUSE\n\nA traditional image slicer system is too inefficient for the FUV. In order to improve throughput, INFUSE replaced the pupil mirrors with aberration correcting, Type IV holographic gratings from Horiba JY (Figure 28). These gratings are identical replicas, blazed to 1300 ˚A. Twenty-five are coated in conventional Al+LiF as the photoresist used to create replica gratings cannot tolerate the heat of a hot coating deposition. All of the gratings are arranged in two sets. Thirteen of the gratings are arranged so that the slicers are imaged end-to-end, with the dispersion going from the top of the large format MCP detector toward the bottom while the other thirteen are arranged with the dispersion going from the bottom to the top. These spectra were then reassembled into a 3D data cube after flight. This permitted moderate resolution integral field spectroscopy over a 2.48’ ↗ 2.57’ FOV."
    },
    {
        "id_": "0adb0981-43e4-4f6a-80b4-f4effa1f3130",
        "text": "# 8 Contamination Reduction\n\nThe UV is particularly sensitive to the presence of contaminants because of amplified scatter and the preferential absorption of this bandpass by molecular hydrocarbons. As such, strict practices of contamination control will need to be implemented to maintain an acceptable level of throughput through all critical surfaces of the observatory to ensure performance metrics are met at launch. Once attained, this performance can be maintained through the lifetime of the mission by measures such as baking, choice of low-outgassing materials, and vent path designs. This section will address the approaches that need to be taken to provide access to the far ultraviolet for HWO."
    },
    {
        "id_": "27841978-b9e3-4d60-92ee-7deac3ae9d03",
        "text": "# 8.1 Contamination Budgets\n\nThe objectives of contamination control for space-borne optical instruments are a) to determine the maximum allowable contaminant quantities, or budgets, for the spacecraft or science instrument, and b) to select and implement the appropriate controls to prevent unacceptable contaminant-induced degradation.\n\nA crucial early step in contamination control for highly contamination-sensitive systems is to establish the degradation allowables. In this step, some percentage of the performance margin of the system is reserved for contaminant-induced degradation. By analysis of degradation vs. contaminant quantity, ie., obscuration, absorption, and scatter, these degradation allowables form the basis to determine the maximum allowable lifetime contaminant quantities, called the contaminant budgets, for both particulates and molecular contaminants. Having accurate absorption coefficient.\n\n41"
    },
    {
        "id_": "a84c3584-4101-4149-a039-c9e50415f41b",
        "text": "# 8.2 Contaminants and their Effects\n\nThe contaminants that plague spacecraft and space science instruments are categorized as either particulate contaminants or molecular contaminants. Particulate contaminants are almost always microscopic and are relatively easy to describe. They may range from sub-micron size dust and smoke particles to visible garment fibers. Molecular contaminants cover the range from single atoms to complex molecules of several hundred atomic mass units (amu). Those particles which settle onto surfaces, and those molecular species which are adsorbed onto surfaces, and which change the properties of those surfaces, are the contaminants that degrade optical systems as well as other spacecraft surfaces and that require controls.\n\nSettled particles obscure portions of optical beams and scatter light out of these beams as stray light (Figure 29, left panel), while molecular deposits absorb as well as scatter light (Figure 29, right panel). Depending on the optical wavelengths and the contaminant quantities, a combination of particles and molecular species can reduce the optical efficiency of each optical surface by a few hundredths of a percent to several percent, the latter being unacceptable for optical systems such as the HWO ultraviolet instruments."
    },
    {
        "id_": "7ae8dff4-7ed2-499a-9157-130f103b492d",
        "text": "# 8.3 Contamination Controls\n\nThe primary factors of contamination control include initial and precision cleaning of physical components, cleanroom quality, personnel garmenting and operations, tool and work surface cleanliness, selection of low outgassing materials, cleanliness monitoring, maintenance cleaning, and specific controls during environmental testing. The contamination budgets derived for the HWO and the science instruments will lead to the specific contamination controls necessary for the observatory. Modern cleanrooms are quite capable of maintaining classes ISO 5 and ISO 68 airborne particle Cleanliness Levels, and even ISO 4 for periods when optical components are exposed even for lengthy time periods. The use of airborne particle counters and the collection of settled particles.\n\n8 ISO 14644-1:2015 Cleanrooms and associated controlled environments, Part 1: Classification of air cleanliness by particle concentration."
    },
    {
        "id_": "4ce49c63-8d8e-4556-93c4-7dcf5f449133",
        "text": "# Obscuration by settled particles"
    },
    {
        "id_": "26925198-4eb3-46d8-8e1f-32920a489e73",
        "text": "# ABSORPTION LOSSES"
    },
    {
        "id_": "9cacdea8-ba95-439b-a23d-94adf18507f2",
        "text": "# for single pass of beam through contaminant deposit\n\n|Particle Cleanliness Level to IEST-STD-1246|wavelength, nm|\n|---|---|\n|10%|200|\n|8%|400|\n|5%|600|\n|3%|100|\n|0%|150|\n| |200|\n| |250|\n| |300|\n\nFig 29: Left - Change in surface obscuration as the particle Cleanliness Level increases (as set by IEST-STD-1246, referencing non-volatile molecular cleanliness levels). Right - Absorption loss of a UV light beam versus wavelength and contaminant deposit equivalent thickness. Combined, these plots motivate contamination control when working in the ultraviolet regime.\n\nTo determine particle settling rates during critical operations will be necessary for HWO optics. It is anticipated that, for most Assembly, Integration, and Test (AIT) operations with HWO optics, personnel garmenting will require full coverall suits with attached hood, booties, and face covers.\n\nAll flight and flight-spare optical elements, including detectors, must always be accompanied by optical witness samples (OWS) having surface coatings applied simultaneously with those of the optical elements. The only times the OWSs leave the optical elements would be during UV reflectance or other measurements to verify the optical element performance.\n\nThroughout AIT operations the cleanliness of all hardware, tools, and work surfaces must be monitored either directly using high-precision Non-Volatile Residue (NVR) sampling and particle collection, including by tape-lift, either directly from hardware when possible, or from companion witness plates. Monitoring for molecular contaminant accretion must include real-time Quartz Crystal Microbalances (QCM) during all AIT operations. QCMs with 10 megahertz crystal frequency have sensitivity to detect equivalent contaminant equivalent thickness changes of 0.04 nm. Finally, the contamination controls must include maintenance cleaning procedures to be applied as necessary to maintain the hardware cleanliness within the derived budgets.\n\nAll work surfaces and tools should be maintained to the same cleanliness requirements as the hardware that will be in contact with the tools and surfaces. Unique controls must be developed for transfer of contamination-sensitive hardware between the cleanrooms and the vibration and thermal vacuum test facilities. And sufficient cleanliness of those facilities must be verified prior to their use.\n\nFor example, prior to a vacuum test of the hardware, a chamber bakeout must be performed and an abbreviated “dry run” of the chamber, with contamination monitoring, must be made covering the temperature range of the pending test. The monitoring should include Residual Gas Analysis (RGA), QCM, and high precision NVR sampling to verify that the chamber and all internal test apparatus are not a contamination threat to the hardware. It can be shown by modeling that partial pressures of volatile-condensables at < 10-14 Torr at critical hardware temperatures do not present a significant contamination threat. The RGAs to be used should have at least this sensitivity."
    },
    {
        "id_": "70474fa0-0197-4fab-ad5a-be916e6d29ec",
        "text": "# 8.4 Maintenance Cleaning\n\nAn extremely crucial control will be the selection of non-metallic materials; the paints, adhesives, pottings, wire insulation materials, and other plastics that must be used. Only materials that meet the low outgassing and molecular contamination requirements to be derived for the contamination budget can be used in HWO hardware. Traditionally the testing of materials for outgassing of molecular contaminants has included the basic test by ASTM-E595 which requires that Total Mass Loss (TML) during 24 hours in vacuum at 125°C not exceed 1%, nor shall Collected Volatile-Condensable Material (CVCM) exceed 0.1% on a collector at 25°C. However, this test alone certainly is insufficient for acceptance of materials for use on HWO hardware. A more appropriate test is MSFC-SPEC-1443. This test has the same requirements for TML and CVCM as ASTM-E595, plus it includes a MgF2/Al optical witness sample for ultraviolet reflectance measurements before and after the vacuum exposure. The basic UV requirement of MSFC-SPEC-1443 is that the reflectance of the mirror shall not change more than 3% at 121.6 nm, 125 nm, 130 nm, and at 10 nm increments to 200 nm wavelengths. If this test proves sufficient for HWO, these reflectance criteria will require revision consistent with the wavelength and degradation requirements of the observatory.\n\nContaminant transport modeling will be a useful tool for predicting the molecular contamination accretion on critical surfaces during vacuum testing, helping to determine the necessary cleanliness of the vacuum test facilities, and on orbit to help with the allocation of the lifetime molecular contamination budget and specific materials choices.\n\nFinally, on-board means of heating all optical elements should be provided to deplete molecular contaminants that may adsorb onto surfaces during space operations."
    },
    {
        "id_": "a2f1c014-82f4-4225-9ad9-107bd8907e27",
        "text": "# 9 References\n\nASTM-E595, Standard Test Method for Total Mass loss and Collected Volatile Condensable Materials from Outgassing in a Vacuum Environment\n\nMSFC-SPEC-1443, Outgassing Test for Nonmetallic Materials Associated with Sensitive Optical Surfaces in a Space Environment"
    },
    {
        "id_": "b4cafc6b-81ba-4a16-85c2-9b7eea605998",
        "text": "# 8.5 Venting\n\nAdequate venting of all enclosures, particularly of enclosed optics, must be sufficient to allow rapid depletion of outgassing species during vacuum bakes and tests. The venting rates are functions of the heats of adsorption of the molecular contaminants, the temperatures, and the vent dimensions. The difference between large vents and launch-only sized vents can mean weeks rather than a few days to deplete molecular contaminants from an enclosed assembly. This is discussed in detail in Appendix B."
    },
    {
        "id_": "3c95dc2b-88b5-4674-8b3f-4bf64931f7ed",
        "text": "# 8.6 Future Testing\n\nA significant number of the non-metallic materials tests reported in the ASTM-E595 database are 30 to over 40 years old and many of the materials are no longer available. As noted above, acceptance of the ASTM-E595 criteria is certainly insufficient to select a material for HWO. Very few of the currently available materials used on spacecraft have been tested to MSFC-SPEC-1443. This is a very difficult test to pass, and at the same time, it remains to be seen if MSFC-SPEC-1443, even with extended wavelength range measurements, is the correct test method to be used for HWO materials, or if some modification of MSFC-SPEC-1443 or some other test method is more appropriate. In any case all non-metallic materials, and in some cases multiple lots of these materials, will have to be tested.\n\nAdditionally, the UV absorption coefficients as well as the heats of adsorption, of the volatile-condensables of the materials expected to be used in the HWO must be determined. This should include determinations of multiple specimens of each material for statistical significance."
    },
    {
        "id_": "c5ec07a2-c011-4cc5-9827-edfa640b7852",
        "text": "# 9 Development Priorities\n\nPrevious UV technology development priorities can be found in Astrophysics Biennial Technology Report 2022 (https://apd440.gsfc.nasa.gov/technology.html). Here we offer the following updated listing of UV technology development priorities as a path towards raising the TRL of components and systems to enable FUV science objectives.\n\n- Reflective coating development and characterization towards high reflectivity Broadband FUV to NIR Mirror Coatings.\n- Characterization of coating polarization and uniformity\n- Large format, low dark count, high efficiency, high dynamic range, photon counting, Solar blind FUV and NUV Detectors.\n- High throughput, large format technology for integral field and multi-object spectroscopy\n- High efficiency diffraction gratings for high and low spectral resolution from FUV to NIR wavelengths\n- FUV Imaging bandpass filters\n- Testbed development to raise systems level TRL for UV coronagraph, spectrograph and imaging systems."
    },
    {
        "id_": "aeaff943-3e6b-4a92-b31e-8bc39aabd072",
        "text": "# 10 Path to HWO\n\nNew UV science and technology developments have been progressing at the speed that the Astrophysics Research and Analysis (APRA) & Strategic Astrophysics Technology (SAT) programs allow. To accelerate the pace to match the timeline proposed by the GOMAP for HWO, we need tools that go beyond the individual/component-level technology developments offered by APRA and SAT.\n\nWe require a combination of:\n\n1. Process level (“materials physics”) development.\n2. Scaling existing technologies to the sizes needed for HWO.\n3. Shifting from individual component level proof-of-concept development to the production line development of optical elements required for HWO electro/optical systems.\n\nWe also need to invest in system-level prototype/test instruments for both the laboratory and space. These instruments provide powerful inputs to Phase A-level trades and decisions (2029), so we need to do this soon. We require a combination of:\n\n1. Investment beyond APRA-levels in suborbital missions (balloons and rockets).\n2. Development of laboratory prototype testbed instruments.\n3. In-space technology demonstration missions, analogous to the Earth Science InVEST program, that can combine process development/scaling with systems-level testing and early-career training (Section 10.1)."
    },
    {
        "id_": "d072f410-43fe-44ce-9f18-c6dcab72ed71",
        "text": "# 10.1 Training\n\nInstrumental astrophysics is an unusual field, in the sense that it is populated by people with a broad range of backgrounds, and it is supported by a broad range of roles. We might train as engineers and then move to astrophysics, or train as astrophysicists and then move into labs. We might be faculty members or professional engineers. The breadth makes this subfield unique. The project scale is also very large, compared to many subfields in astrophysics (and on par with subfields in physics like particle physics) although this has shifted as mission and telescope size has grown. This makes training a particularly crucial aspect of our human infrastructure.\n\nA great deal of knowledge is passed person to person during hands-on lab experiences. A peer reviewed journal specifically for instrumentation (SPIE JATIS) has existed for less than a decade, with a great deal captured in local observatory or project documentation or in conference proceedings. It is crucial as we shape the future of UV hardware and space missions we recognize that we not only need the right hardware - we need pathways to train and support early career researchers so they can take leadership roles in the mission in Phase A ↔↘ E. As we move to increasingly large space-based missions and surveys on the ground and in space, many astronomy programs focus on the data handling skills necessary to navigate the enormous results. We must also keep pathways open for training builders to sustain projects for the upcoming decades. We present below one potential pathway to increasing the ranks of builders for the ultraviolet."
    },
    {
        "id_": "75077d61-4ddb-43c1-9d97-d359d76789d9",
        "text": "# 10.2 Smallsats for Accelerated Technology and Workforce Maturation\n\nMany of the key technologies in the development queue for HWO require the combined activities of 1) facility and process development for validation of technologies at the scale required for HWO and 2) deployment in the ‘real world’ environment of mission Integration & Test followed by on-orbit operations. Many of these goals could be accomplished simultaneously through the development of a dedicated program combining laboratory advancement and process scaling conducted in parallel with the deployment of these technologies to space. Parallel and closely-linked facility, laboratory, and instrument prototype development program that can be applied to any of NASA’s Future Great Observatories (FGOs), and an initial framework for this program has been outlined as the Smallsat Technology Accelerated Maturation Platform (STAMP).157 Advanced broadband optical coatings, high-sensitivity ultraviolet detector systems, and multi-object selection technology could all be brought to TRL 6 and flight demonstrated through such a program. STAMP advances HWO technology on an accelerated timescale, building on current ROSES SAT+APRA programs, reducing cost and schedule risk for HWO, while conducting a compelling program of preparatory science and workforce development with direct cost and schedule risk reduction for HWO mission implementation in the 2030s.\n\nThe STAMP science and instrument teams would be made up of &gt; 50% early-career researchers; this builds the critical relationships between observers, theorists, and instrumentalists that enable open communication and a cohesive development environment for HWO. The organizational layout of the mission would feature ‘deputies’ in all key mission science roles, including deputy-PI (dPI), deputy-Project Scientist (dPS), deputy-Instrument Scientist (dIS), and in all the major engineering and program management positions (Program Manager, Project Systems Engineer, Instrument Systems Engineer, etc). These positions would be fully funded and provide a direct route for the training of the scientists and engineers with the expertise to serve in science, instrument, and mission leadership roles for HWO."
    },
    {
        "id_": "805db82c-7332-4524-ad7f-32868212dd6e",
        "text": "# 11 Summary\n\nWe have presented here a summary of the current status of UV technology, establishing a baseline for the development of the upcoming Habitable World Observatories instrumentation. This representative sample of the last several decades of development demonstrates not only the thriving UV technology but also illustrates the areas for advancement in preparation for HWO. Multiple pathways exist for successful instrumentation across the ultraviolet bandpass, and rapid investment will support the scaling up of technology that has been flight qualified on smaller scales. Coordination across the community will provide a path for rapid subsystems level flight qualification along with full integrated systems level tests. This is an exciting time to work in UV hardware, and we hope the knowledge gathered here provides a strong foundation for the exciting challenges posed by HWO."
    },
    {
        "id_": "e35897af-f732-4f30-8477-35af2ba9b2a7",
        "text": "# ACKNOWLEDGMENTS\n\nThis work has been supported by the following NASA grants: NNX11AG54G, NNX14AI78G, NNG15PF22P, NNG16LI16P, NNX17AC26G, 80NSSC19K1040, 80NSSC22K0940, 80NSSC22K1698, NNH08ZDA001N, NNH12ZDA001N-RTF, NNX16AG28G, NNX12AG06G, 80NSSC20K0412, 80NSSC21K2016, 80NSSC21K1667, 80NSSC19K0661, NNX17AI84G, 80NSSC23K0754, 80NSSC22M0081. A portion of this research was done at Jet Propulsion Laboratory, California Institute of Technology, under a contract with the National Aeronautics and Space Administration (80NM0018D0004)."
    },
    {
        "id_": "381d75d3-85d0-40f7-9af9-274091ee9b15",
        "text": "This work was supported in part by the NASA Cosmic Origins Program Office under the auspices of the Cosmic Origins UV Working Group."
    },
    {
        "id_": "c9551c86-f830-46aa-89c7-385bb39b529e",
        "text": "# Appendix A: UV Technology Frequently Asked Questions\n\n- What are some of the challenges associated with combining ultra-high-contrast exo-planet observations and a UV-sensitive telescope?\n- Wavefront Control: Going to shorter wavelengths means that the same wavefront error in physical dimension becomes a larger fraction of wavelength. This places more stringent requirements on the deformable-mirror system.\n- Polarization aberration: Although effects of polarization aberration are more pronounced in the UV, this degradation is concentrated at small angles in terms of ε/D. Habitable zones of the best UV target stars tend to be at larger angular separations and angular separation per ε/D is also larger in the UV compared to longer wavelengths can mitigate the science impact of this change.\n- Coating uniformity: A recent study (Krist, priv. comm.) using the USORT pupil (which has 19 hexagonal segments in the primary-mirror assembly) found that reflectance differences at the segment-to-segment level of up to 3% is tolerable in terms of contrast performance.\n- Scattered light: Scattering, due to surface roughness and particle contaminants, is stronger in the UV. Accurate estimates of near-angle scattering (NAS) is currently lacking, mainly due to lack of measurement data. NASA Engineering and Safety Center is funding a study (PI: Gaskin) to better quantify the impact of NAS on ultra-high-contrast imaging, which can lead to improved mirror-PSD and contamination-control requirements.\n- Will UV coating surface roughness be capable of working with coronagraphy at the level needed for HWO?\nThe current roughness requirements driven by the nominal coronagraphy design are applied to the full wavelength range. Work is in process to test and quantify roughness, but the requirement as currently understood is not met by any coating at any wavelength range.\n- What contamination control requirements does UV sensitivity impose on the observatory?\nContamination control is necessary for the reflective coatings in the ultraviolet. However, the contamination control is well understood and defined as shown in Section 8 and Appendix B.\n- What are some of the key science cases that need wavelength coverage down to 100 nm?\nWe highlight key science cases in Section 3, and summarize them below.\n\n- 102 — 115 nm: FUV inputs into exoplanetary atmospheres, including emission lines like SIV, OVI, NeV, and FeXIX"
    },
    {
        "id_": "82d0d389-8b6d-4b2e-b2db-2614ee7cc84f",
        "text": "# Current Page Content\n\n- 100 — 115 nm: Direct measurement of absolute abundance and temperature of inner disk gas of protoplanetary disks.\n- 103 nm: Provides access to CGM OVI at z = 0\n- 100 — 110 nm: CGM high ionization lines like Ne VIII (0.29 < z < 0.41) and Si XII (1 < z < 1.2)\n- 100 — 120 nm: Lyman continuum escape fraction at very low redshift (0.1 < z < 1)"
    },
    {
        "id_": "e6d21a2b-f373-45b6-a874-367c6ea0922e",
        "text": "# Technological Considerations\n\n- MKIDS and nanowire detectors have made a lot of progress - can we use those technologies?\n- Not for this. Currently, these detectors are both at a relatively low TRL and not yet achieving desired QE in the FUV for potential UV spectrographs. Detectors beyond those discussed here are being considered for other instrumentation on HWO.\n- Does pushing the observatory’s wavelength coverage below the short wavelength cutoff of Hubble (115 nm) increase the technical challenges?\n- No. In the decades since Hubble was built, technology development has pushed forward performance below 115 nm, including in optical coatings and detectors. Sections 4 and 5 demonstrate the significant progress that decreases the technical risk of extending UV coverage beyond the Hubble cutoff.\n- Are MCP detectors limited in their ultimate count rate and susceptible to gain sag that limits their lifetime?\n- High rate real time gain sag is due to the local recharge time of a pore. During instrument design, strategies can be used to improve the detector dynamic range, such as using lower resistance MCPs and low gain compatible readouts such as the cross strip to achieve 1000 events/sec for a resolution element. The MCP lifetime is related to total charge extraction. Traditional MCPs drop in gain substantially with extracted charge. The lifetime of new technology borosilicate MCPs with ALD functionalization have been shown to maintain stable high gain during extended life testing (>7 C cm−2) to more than 5 x 1013 events per cm2 which is substantially more than most missions accumulate.\n- Are MCP detectors at risk when exposed to high count rates?\n- In practice, no. The rate would have to be extremely high (focused beam of sunlight) to physically heat the MCP. This is usually avoided (and proven at TRL 9) by multiple layers of hardware, software, and observation planning restrictions. Newer MCPs also tolerate much higher count rates (Siegmund 2023 NIM) as demonstrated by full recovery after exposure to laser illumination."
    },
    {
        "id_": "43c26a7c-1f57-4049-8ed0-c6ee0a222e31",
        "text": "# Appendix B: Contamination Control\n\nParticles typical particles, including fibers, that contaminate space hardware range from approximately 1 μm to 1 mm in maximum dimension. Their sources include air-borne dust in the local environment and fibers and particles released from tools, work surfaces, garments, human hair and skin, etc.\n\n49"
    },
    {
        "id_": "01c19da8-30b8-4055-9bae-6be0a0f373d7",
        "text": "# Settled particle distributions\n\n|1E+8|Level 100|Level 400|\n|---|---|---|\n|1E+7|Level 200|Level 500|\n|1E+6|Level 300|Level 600|\n|1E+5| | |\n|1E+4| | |\n|1E+3| | |\n|1E+2| | |\n\n10 particle size, microns 100\n\nFig 30: Cumulative particle size distributions for selected Cleanliness Levels\n\nThe dominant effects of settled particles for optical systems are light scatter and obscuration (sometimes parametrized as percent area covered). IEST-STD-124611 establishes particle Cleanliness Levels listing the maximum number of particles per 0.1 m2 surface area for ranges of particle maximum linear dimensions.\n\nTypical criteria for contamination-sensitive optical instruments are often in the range of particle Cleanliness Levels of 200 to 300 (Figure 30) which are not unusually difficult to achieve, even for large optical systems. Even with 3 or 4 optical surfaces in series, this represents less than 0.1% optical obscuration for the optical system (Figure 29). However, for scatter-sensitive optical instruments such as coronagraphs, complex scatter analyses, involving measurements of the actual size distribution, may be necessary to determine acceptable particle deposition."
    },
    {
        "id_": "3b823bc5-24fa-4592-a491-3aea4dd77cd4",
        "text": "# Molecular Contaminants\n\nIt is difficult to bound the sources and variety of molecular contaminants to which space hardware can be exposed. Even after thorough initial and precision cleaning, the molecular contaminants found on space hardware in cleanrooms include volatile-condensable molecular species of masses up to approximately 300 amu. These molecular contaminants may exist on surfaces as randomly spaced single molecules, coalesced nanometer sized “deposits,” monolayer to multilayer films less than 0.5 nm to a few nm in thickness, or even micro droplets, all possibly consisting of a mix of molecular species.\n\nThe dominant effect of these molecular contaminants for optical systems is light absorption, which can be quantified using Lambert’s Law when the absorption coefficients of the contaminants are known. In a worst-case of molecular contaminant deposits as micro-droplets, light scatter will also occur.\n\n11 IEST-STD-CC1246, Product Cleanliness Levels and Contamination Control Program, Institute of Environmental Sciences and Technology\n\n12 The strange notation of # / 0.1 m2 is a result of the historical attempt to equate Imperial unit values which were given in # / ft2 to metric nomenclature. Of course, this leads to an error of about 9.3% in comparing Imperial data to metric data."
    },
    {
        "id_": "64d5b879-8719-4564-b9be-d46e5b27c23e",
        "text": "# IEST-STD-1246\n\nIEST-STD-1246 defines non-volatile molecular cleanliness levels over a very broad range from 10 ng/0.1m2 to 25 mg/0.1m2 (alternatively, 10 pg/cm2 to 25 μg/cm2). Molecular contaminant lifetime allowables for spacecraft and space science instruments have typically been in the range of 50 to 500 μg/0.1m2 (50 to 500 ng/cm2; equivalent to thicknesses of 0.5 to 5 nm for contaminants with specific gravity = 1.0). However, dependent on the results of contamination degradation analyses of the HWO telescope and instruments, the molecular contaminant allowables for HWO may be significantly lower13."
    },
    {
        "id_": "c8714eb8-d70a-461d-bfd0-5d8ed7bd8e8c",
        "text": "# Molecular Contaminant Transfer\n\nIn controlled environments such as cleanrooms and vacuum chambers troublesome molecular contaminants are transferred to and accrete onto surfaces primarily by desorption from a source surface and subsequent adsorption onto another surface. These are called volatile-condensable species. The standard term for this desorption is outgassing and is quantified as mass loss per unit area, typically in micrograms per cm2 (μg/cm2) or nanograms per cm2 (ng/cm2). These outgassing species can be both molecules of, or molecular fragments of the base material, foreign contaminants from the surface of the base material, or contaminants diffused from the interior of the base material.\n\nAnother source of contaminant transfer between surfaces is contact transfer. As the name implies, contact transfer is contacting one surface with another and the transfer of contaminants from one to the other. An example is to touch a clean surface with a contaminated glove and leave some of the contaminants on the clean surface.\n\nMolecular contaminant transfer, or transport, is discussed further in Appendix B."
    },
    {
        "id_": "da0f0904-a7db-4ad3-b5b7-276a6168a0b5",
        "text": "# Molecular Contaminant Effect\n\nThe magnitude of the optical absorption losses are predictable using Lambert’s Law: the intensity of a light beam inside an absorbing medium decreases exponentially as a function of the distance the beam has traveled into the medium and as a function of the absorption coefficient, ω, of the absorbing material.\n\nThe absorption coefficients, ω, given in units of inverse thickness (1/t), or inverse mass per areal density (i.e., cm2/ng), have widely ranging values over several orders of magnitude for wavelengths from the far UV through the IR for the various molecular contaminants typically found.\n\nThe available data on absorption coefficients for molecular contaminant deposits is very limited, as these values are exceptionally difficult and expensive to measure, particularly for UV wavelengths. In support of the Wide Field Planetary Camera (UV wavelength range: 200-1000 nm) and beneficial to the Faint Object Spectrograph (UV wavelength range: 115-850 nm) which were flown on Hubble, ω values of contaminant deposits were measured at several UV wavelengths and for multiple thicknesses by Dr. Joseph Muscari, Martin Marietta Corp., for several adsorbed contaminants.14 Other limited compilations of ω values have been produced showing a broad range of values vs. wavelength for the few contaminant source materials which have been tested. Detailed information about the test methods and test sample variations are unknown and may contribute to the data variations.\n\n13 For example, with a design consisting of 5 surfaces (primary, secondary, pick-off mirror, instrument reflecting surface, detector surface) there will be 9 passes through contaminant deposits. For deposits 0.5 nm thick, the total degradation between 100 nm and 150 nm will be 30% to 50%.\n\n14 Nonmetallic Materials Contamination Studies, Final Technical Report, J A Muscari, Martin Marietta Corp., JPL contract 955426, December 16, 1980"
    },
    {
        "id_": "a9dd9c4e-f0c4-41c5-a4f4-a70521711db4",
        "text": "# Wide range of absorption coefficients vs wavelength with estimated TYPICAL curve\n\n| |1E-3| |1E-4| |1E-5| |1E-6| |1E-7| |1E-8|\n|---|---|---|---|---|---|---|---|---|---|---|---|\n|100|200|300|400|500|600|700|800|900|1000| | |\n\nFig 31: Range of Absorption Coefficients vs. Wavelength with estimated TYPICAL Curve.\n\nData currently available can be used to bracket the probable range of UV ω values. Figure 31 shows a summary of the available absorption coefficient data compiled mostly by Joseph Hueser, Ball Aerospace (unpublished), over the wavelength range of 150 to 1000 nm. A “typical value” curve has been included in the Hueser plot. Many of the data points shown in the Hueser plot were derived from Muscari measurements. Great caution should be used in applying this data as in most cases the precision of unknown, was typically measured on relatively thick contaminant deposits, and may not be representative of currently available materials.\n\nCautiously using the estimated “typical value” curve given in Figure 31 for molecular contaminant absorption values, and for want of more and better data, the predicted absorption over the range of 122 nm to 300 nm for contaminant equivalent thicknesses of 0.25, 0.5 and 1 nm was shown in Figure 29. This illustrates how very important it is to minimize molecular contamination in the vacuum UV and the need for precise adsorption coefficient data on materials to be used on the HWO. For a telescope and UV science instrument in series, there will be a minimum of 4 optical surfaces and 7 passes of the optical beam through contaminant deposits, which can severely degrade instrument performance. ω values are orders of magnitude higher for most molecular contaminants in the UV vs. the near IR and Mid-IR, making HWO far more contaminant-sensitive than JWST."
    },
    {
        "id_": "5c47ff2b-a637-4efd-b042-92c38075ddc7",
        "text": "# Molecular Contaminant Cleanliness Levels\n\nTable 2 is a listing of selected molecular Cleanliness Levels from IEST-STD-CC1246E with level names shown in column 1. Column 2 is the defined maximum allowable Non-Volatile Residue (NVR) per 0.1 m2 for each level. When collecting contaminant samples from surfaces for quantifying, the measurement results are often given in nanograms per cm2 (ng/cm2). Column 3 shows this equivalent areal density, while the Column 4 shows the approximate equivalent thickness were the molecular contaminant to be uniform in thickness and to have a density of 1 g/cm3.\n\n15 The density of most contaminants is expected to be in the range of 0.8 to 1.2 g/cm3 based on the densities of the typical source plastics."
    },
    {
        "id_": "0ca5e8b9-c834-4504-a639-84932fadaaab",
        "text": "# Table 2: Non-volatile molecular cleanliness levels from IEST-STD-1246\n\n|Molecular Contaminant Level|Maximum Allowable NVR Mass / 0.1 m2 Surface Area|Equivalent Areal Density (ng/cm2)|Approx. Equivalent Thickness (nm)|\n|---|---|---|---|\n|R5E-3|5 μg|5|0.05|\n|R1E-2|10 μg|10|0.1|\n|R2E-2|20 μg|20|0.2|\n|R5E-2|50 μg|50|0.5|\n|R1E-1|100 μg|100|1|\n|R2E-1|200 μg|200|2|\n|R5E-1|500 μg|500|5|"
    },
    {
        "id_": "bb59b183-f936-4275-b326-24e58c8b5e86",
        "text": "# Molecular Mass Transport\n\nOutgassing is not just a vacuum phenomenon, it occurs in all environments. As molecular contaminants transfer between surfaces at room temperature, such as during exposed periods in cleanrooms, they desorb from source surfaces, adsorb onto exposed surfaces, and come to rest for predictable time periods, with the mean molecular rest times dependent on their heats-of-adsorption16 and the local temperature. Often the total adsorbed mass can be reduced or essentially depleted by elevating the temperature. However, this must be done in high vacuum. The species with lower heats of adsorption, less than about 23 kc/mol deplete readily in vacuum even at near room temperature. The molecular species which are the most difficult to deplete are those with heats of adsorption greater than about 24 kc/mol. And the species with heats of absorption greater than about 27 kc/mol are so stable that they are affected very little at spacecraft bakeout temperatures, and may more likely be chemisorbed rather than physisorbed as is the norm for volatile-condensable molecular contaminants.\n\nCleanrooms are far cleaner than laboratories and workshops, but still, they are not perfect. They will have measurable quantities of airborne particles and volatile-condensable molecular species leading to settling of particles and adsorption of molecular contaminants. Historical evidence from measurements on witness plates of volatile-condensables has shown that molecular contaminants do adsorb onto these surfaces with adsorption rates and maximum quantities being dependent on the cleanroom quality and assembly and integration operations that are occurring. Such evidence has shown that the time for the adsorbed species to reach some apparent equilibrium with the gaseous phase species to be on the order of a few weeks to a couple of months for the few cleanrooms that were monitored.\n\nFigures 32 and 33 show the contaminant accretion rates onto clean surfaces for an important range of volatile-condensables. For the analysis, it was assumed that the areal density of each adsorbed contaminant at equilibrium was 50 ng/cm2 (roughly equivalent to a single monomolecular layer of water) and does not represent a particular cleanroom. Figure 34 shows that the predicted time for a clean, exposed surface to equilibrate to the cleanroom quantity of species with heats of adsorption of 23 kc/mol is on the order of about 15-20 hours, whereas Figure 35 shows it could take up to 120 hours for a 26 kc/mol contaminant to reach cleanroom equilibrium. Additional analyses show that the volatile-condensibles having heats of adsorption less than about 23 kc/mol move very quickly through the cleanroom, while volatile-condensables having heats of adsorption greater than about 27 kc/mol are more stable.\n\nHeats of adsorption can differ for a specific molecular species on different surfaces, dependent on other contaminants present and the unique Van der Waals forces for the contaminant-surface pair."
    },
    {
        "id_": "dc8a0f37-5b38-435c-851a-1328010b9ac0",
        "text": "# Mass transfer from cleanroom to article for\n\nH = 23 kclmole; Qo = 50 nglcm2 = 0.5 nm 1E-10\n\n|1|5040| |9|\n|---|---|---|---|\n|30|1|20|incident Iux|\n|article quantity|1|outgassing rate|1|\n|10| | |1E-13|\n\nsource temp 22 C; article temp 22 C\n\ncleanroom environment\n\ntime, hours\n\nFig 32: Mass transfer contaminant accretion onto clean surfaces at an H of 23 kc/mol over 15-20 hrs."
    },
    {
        "id_": "4192f31b-01d9-4d66-ab2c-690775a3da76",
        "text": "# Mass transfer from cleanroom to article for\n\nH = 26 kclmole; Qo = 50 nglcm2 = 0.5 nm 1E-13\n\n|1|5040| |9|\n|---|---|---|---|\n|30|1|20|quantity|\n|incident Iux|article quantity|1|outgassing rate|\n|1E-15| | | |\n\nsource temp 22 C; article temp 22 C\n\ncleanroom environment\n\ntime, days\n\n90 120 150\n\nFig 33: Mass transfer contaminant accretion onto clean surfaces at an H of 26 kc/mol over 120 hrs.\n\ngreater than 26 kc/mole travel so slowly from source surfaces at room temperature that they are not a significant problem in the cleanroom. This is shown in Figure 34.\n\nThe message is that molecular contaminants do transfer throughout cleanrooms with those with low heats-of-adsorption reaching some equilibrium on exposed surfaces in hours to days, while those with higher heats-of-adsorption may take so long to transfer that they do not present a significant contaminant risk to hardware that is sealed or bagged and purged for the majority of the time in AIT.\n\nFigure 35 shows that when a plane, fully exposed contaminated surface is placed in vacuum"
    },
    {
        "id_": "5bc50cc6-0ac0-42b0-ac8c-b59409a32966",
        "text": "# Mass transfer from cleanroom to article\n\nH = 27 kclmole; Qo = 50 nglcm2 = 0.5 nm 1E-13 L\n\nTime, days\n120\n240\n360\n480\n600\nFig 34: Mass transfer contaminant accretion onto clean surfaces at an H of 27 kc/mol indicating low levels of contamination.\n\nThe molecular contaminants desorb relatively quickly in a predictable manner as a function of temperature, heats of adsorption, and elimination of the original contaminant sources. However, consider as an example, a short telescope tube with dimensions of length/diameter = 4 and open on the aperture end. The probability of a molecule desorbing from a random spot inside this open-ended tube venting out the aperture in each desorb-adsorb cycle is only 0.06, based on view factors. In this case, the time to depletion of the contaminant is increased from about 12 hours to roughly 200 hours. This has important implications for vacuum baking cleanup of complex assemblies.\n\nVenting is an extremely important factor for efficient vacuum bake maintenance cleaning of assemblies. Vents of enclosures such as electronics boxes are normally designed to prevent pressure differentials during vacuum pumpdown and during launch from mechanically damaging the enclosure. A normal launch vent design criterion is given by:\n\nA &gt; 2000mm2 (1)\n\nwhere A = cross sectional area of the vents, and V = volume of the vented enclosure. This is sufficient for launch venting, but not for vacuum bake cleaning. The internal surface area of even an empty enclosure with vents to this criterion is approximately 1000 greater than the area of the vents only, leading to a “vent factor” (defined as the ratio of the area of the vent aperture to the total surface area inside vented cavity) of 0.001. Vacuum baking of such articles for even weeks would be very ineffective, leaving these articles as potential contaminant sources when in assemblies adjacent to optical elements, particularly during vacuum tests.\n\nThe maximum temperature for vacuum bakes of spacecraft assemblies is often limited by the batteries to about 60 ↓ C. Figure 36 shows that the predicted time to essentially deplete a heat of adsorption 26 kc/mol contaminant is on the order of 10 to 12 days at 60 ↓ C for surfaces with a vent factor of 0.06. Increasing the vacuum bake temperature to 82 ↓ C will reduce the time to deplete the 26 kc/mol species to about 1 day. This can result in significant savings when vacuum."
    },
    {
        "id_": "4e0ca747-9b65-435d-9195-46186efe0f58",
        "text": "# Vacuum desorption of admolecules from article\n\nH= 23 kclmole; Q'0 = 50 nglcm2 = 0.5 nm 1E-11\n\n| |50|40|30|20|10|\n|---|---|---|---|---|---|\n|aruclequanlity.0\"|1E-12|9|L 2030|1E-13|1|\n|source temp|vacuum environment 22 C; article temp 22 C|1E-14|1E-15|11| |\n| |12|16|20| | |\n\nFig 35: Analysis showing that when a plane contaminated surface is placed in vacuum the molecular contaminants desorb relatively quickly as a function of temperature and heats of adsorption.\n\nbaking subassemblies. And the contaminants with lower heats of adsorption will be depleted much quicker. However, regardless of the heat of adsorption, the times to deplete will be far longer for surfaces inside boxes with only small launch vents.\n\nIt is shown by analysis that the most troublesome volatile-condensable contaminants to deplete with vacuum baking are those with heats of absorption in the range of 23 to 26 kcal/mol. Molecular contaminants with lower heats of absorption are readily depleted in vacuum at room temperature and above. However, the contaminants with high heats of absorption require higher temperatures and perhaps long times in vacuum bake to deplete.\n\nThe above data show that volatile-condensable molecular contaminants can be depleted by vacuum baking, however adequate venting of enclosed volumes is necessary. Enclosures of articles other than optical components should be opened for vacuum bake cleanup and should be vacuum baked separate from the optics. The troublesome contaminants must be depleted to acceptable levels prior to top assemblies of optics. Mechanical and electronic assemblies must be exposed in vacuum together, apart from optical elements, to avoid the optics being contaminated.\n\nTo take scheduling advantage of this knowledge requires monitoring all vacuum bakes with high-sensitivity, broad-range residual gas analyzers (RGA), and determining the heats of adsorption of the specific higher mass (100 – 300 amu) species. In some cases, a temperature-controlled quartz crystal microbalance (TQCM) can be used to determine approximate heats of adsorption simultaneously while monitoring the RGA-identified mass peaks."
    },
    {
        "id_": "8c2a9c4d-a111-4051-aa1a-42f0538db8ca",
        "text": "# Vacuum bake of article at 60 °C\n\n|H|Q'0|anicle quantily|anicle outqassino|\n|---|---|---|---|\n|26 kclmole|50 nglcm² = 0.5 nm 1E-12|50|1E-13|\n| | |40|1E-14|\n| | |30| |\n| | |20|chamber temp 60 °C; article temp|\n| | |10|vaCuiom (bake environment 1E-15|\n| | | |1E-16|\n\ntime, days at 60 °C\n\nFig 36: Vacuum bake efficacy: the predicted time to essentially deplete a heat of adsorption 26 kc/mol contaminant is on the order of 10 to 12 days at 60 °C for surfaces with a vent factor of 0.06."
    }
]