{
    "ReLU Surrogates in Mixed-Integer MPC for Irrigation Scheduling": {
        "Which specific model was used within the mixed-integer MPC framework to improve computational efficiency according to the initial work [7]?": [
            "LSTM network"
        ],
        "What type of neural network is used to replace the model representing soil moisture dynamics within the MPC framework to enhance computational efficiency?": [
            "ReLU network"
        ],
        "How many distinct MZs are delineated in the field described in Figure 1?": [
            "4"
        ],
        "What mathematical model is used to describe soil moisture dynamics in agricultural fields according to the study?": [
            "Richards equation"
        ],
        "What do the variables ω_i in the given section of the paper represent?": [
            "hydraulic parameters"
        ],
        "What is required to be uniform across all Management Zones (MZs) when determining irrigation timing?": [
            "timing"
        ],
        "What does the term MAD represent in the context of irrigation management for MZ j?": [
            "management allowable depletion"
        ],
        "What is the time lag represented by 'l' in the ReLU neural network input for soil moisture content predictions?": [
            "days"
        ],
        "What crop was cultivated in the study area at the Research Farm in Lethbridge, Alberta, Canada?": [
            "spring soft wheat"
        ],
        "What type of equation was calibrated with centroidal soil hydraulic parameters for each MZ in the study area?": [
            "1D Richards equation"
        ],
        "What was the rooting depth considered from May 5th to July 15th in the simulation settings of Case Study 1?": [
            "0.5 m"
        ],
        "What sensor type was simulated for daily soil moisture observations in each MZ?": [
            "microwave remote sensors"
        ],
        "Which solver was used for the mixed-integer MPC with ReLU neural networks?": [
            "Gurobi"
        ],
        "What is the standard deviation of the noise added to the soil water content measurements?": [
            "0.0008"
        ],
        "What figure depicts the predictive performance of the ReLU networks in the study?": [
            "Figure 3"
        ],
        "What type of predictions were the ReLU networks originally trained to perform?": [
            "one-step-ahead predictions"
        ],
        "What is the RMSE value for model MZ 3 as reported in Table 1?": [
            "0.0022"
        ],
        "What is the average solution time for the ReLU approach during the 2022 season?": [
            "0.52 minutes"
        ],
        "What is the average solution time of P N,M (d) with ReLU for the 2022 season?": [
            "0.52"
        ],
        "What type of surrogate models are used to improve the computational efficiency of MPC-based irrigation schedulers in the study?": [
            "ReLU"
        ],
        "Which irrigation method showed higher IWUE according to Table 5 in the 2022 season comparison?": [
            "P N,M (d) with ReLU"
        ],
        "Which type of MPC approach is suggested to address real-time variations in the field parameters?": [
            "offset-free MPC"
        ]
    },
    "Vista3D_ Unravel the 3D Darkside of a Single Image": {
        "What technique does Vista3D use to refine geometry in the fine phase?": [
            "FlexiCubes"
        ],
        "What is the name of the method mentioned that generates novel views conditioned on a single image and camera position?": [
            "Zero-1-to-3"
        ],
        "Which method does the framework employ to initially create coarse geometry in Section 3.1?": [
            "Gaussian Splatting"
        ],
        "What method is used for densification in Stage I of the discussed paper?": [
            "Top-K Densification"
        ],
        "What is the primary purpose of using Gaussian Splatting in the coarse stage of the Vista3D framework?": [
            "create a coarse geometry"
        ],
        "What strategy is used in place of naive gradient threshold for periodical densification in the optimization process described by Shen et al.?": [
            "Top-K Gradient-based Densification"
        ],
        "What is the initial value of the hyperparameter that is gradually annealed in the transmittance regularization?": [
            "0.4"
        ],
        "What does the scale factor linearly increase to during the optimization process in the FlexiCubes geometry representation?": [
            "3"
        ],
        "What model from Objaverse-XL is used as a prior for 3D-aware generation in the pipeline?": [
            "Zero-1-to-3 XL"
        ],
        "What is the initial opacity value for all 3D Gaussians in the coarse geometry learning phase?": [
            "0.1"
        ],
        "What is the initial upper bound Bupper used when editing with both diffusion priors in the model?": [
            "100"
        ],
        "What feature of Vista3D-L distinguishes it from other image-to-3D methods as mentioned in the qualitative comparison?": [
            "angular gradient constraint"
        ],
        "What is the average generation time for Vista3D-L as reported in Table 1?": [
            "15 min"
        ],
        "How many participants were recruited for the user study evaluating Vista3D?": [
            "10"
        ],
        "What type of geometry does the coarse stage of Vista3D's framework tend to generate?": [
            "rough non-watertight geometry"
        ],
        "What is set as 0 when visualizing Href according to the ablation study in Figure 5 (b)?": [
            "Hback"
        ]
    },
    "Optimizing Job Shop Scheduling in the Furniture Industry_ A Reinforcement Learning Approach Considering Machine Setup, Batch Variability, and Intralogistics": {
        "What year did Liu et al. introduce their actor-critic DRL-architecture to approach the JSSP?": [
            "2020"
        ],
        "What mechanism did Vivekanandan et al. introduce to improve the generalization capabilities of a DRL agent for solving JSSPs?": [
            "Order Swapping Mechanism"
        ],
        "What type of production setup is proposed for the implementation of RL in the furniture factory?": [
            "Job Shop"
        ],
        "What are quantified and mapped to extend the generic JSSP-models?": [
            "Job Volumes"
        ],
        "What symbol represents the quantity factor used to determine the duration of machine processing in the paper?": [
            "ω"
        ],
        "Which toolkit is mentioned for implementing the job shop environment in section 3.3.1 of the paper?": [
            "OpenAI Gym"
        ],
        "What is the capacity of Buffer B2 in cubic meters?": [
            "43"
        ],
        "What type of action space is used to control the environment in the paper's section 3.3.2?": [
            "discrete"
        ],
        "How many lines contain information about the current machine setup in the machine info matrix?": [
            "one"
        ],
        "How many buffers are represented in the given vector of the environment?": [
            "3"
        ],
        "What document is commonly used in the furniture industry to determine the machining sequences of components?": [
            "Bill of Materials"
        ],
        "How many times greater may the volume of the raw material be compared to the end product in solid wood furniture production?": [
            "five times"
        ],
        "What is the specified capacity of buffers on the shop floor in terms of?": [
            "number of storage spaces"
        ],
        "What does the agent in the production environment aim to prevent from overflowing?": [
            "buffers"
        ],
        "What are the two principal concepts distinguished for the integration of an RL agent in production planning?": [
            "episodic and continuous"
        ],
        "What approach is described as appropriate for companies with low levels of automation and networking?": [
            "episodic planning"
        ],
        "At what time step is Machine 1 first assigned to process Job 1?": [
            "t29"
        ],
        "What necessitates the re-training of a trained agent in episodic planning?": [
            "new product"
        ],
        "What system provides machine data such as processing times and machine breakdowns in the continuous planning approach?": [
            "MES"
        ],
        "What type of planning is the DRL-supported concept in the paper adapted for?": [
            "job shop scheduling"
        ],
        "What factor determines the processing times of each operation in the extended JSSP model?": [
            "quantity factor ω"
        ]
    },
    "Bridging Domain Gap for Flight-Ready Spaceborne Vision": {
        "What facility at Stanford's Space Rendezvous Laboratory was used to create the HIL images for datasets such as SPEED+ and SHIRT?": [
            "TRON"
        ],
        "What is the full name of the SPEED dataset used for spacecraft pose estimation?": [
            "Spacecraft PosE Estimation Dataset"
        ],
        "What rendering engine was used to create the URSO dataset?": [
            "Unreal Engine 4"
        ],
        "What does TENT update during entropy minimization in source-free domain adaptation?": [
            "affine parameters"
        ],
        "Which model achieved third and sixth places in the lightbox and sunlamp categories, respectively, without accessing HIL domain images?": [
            "SPNv2"
        ],
        "Which company's System-on-Module is utilized in Aitech Systems, Inc.'s S-A1760 system for spacecraft?": [
            "NVIDIA Jetson TX2i"
        ],
        "What is the memory size limit for radiation-hardened SRAM as mentioned in the document?": [
            "20MB"
        ],
        "Which type of camera is used for Angles-Only Navigation in vision-based RPOD scenarios?": [
            "NFOV camera"
        ],
        "What type of network is the Bidirectional Feature Pyramid Network (BiFPN) compared to in the EfficientDet section?": [
            "FPN"
        ],
        "What resolution do ViTPose's heatmap outputs have relative to the original image?": [
            "1/4 resolution"
        ],
        "What command in Albumentations v1.3.1 is used for Bit Reduction?": [
            "Posterize"
        ],
        "Which CNN architecture was used by Jackson et al. to embed different style images into the vector space for style augmentation?": [
            "Inception CNN"
        ],
        "What kernel sizes are randomly sampled from in the RandConv data augmentation technique?": [
            "1, 3, 5, 7"
        ],
        "How many synthetic images are included in the SPEED+ dataset?": [
            "59,960"
        ],
        "How many convolution layers are fixed in the BiFPN layers for the EfficientDet implementation discussed in the paper?": [
            "4"
        ],
        "What optimizer is used for training the models in the default configuration section of the paper?": [
            "AdamW"
        ],
        "Which backbone has the lowest mean orientation error (𝐸q / 𝐸q∗ [°]) according to the ablation study?": [
            "ViT-S/16"
        ],
        "What precision is used for training and inference on the NVIDIA Jetson Nano according to the section \"2. Latency on NVIDIA Jetson Nano\"?": [
            "FP32"
        ],
        "What is the latency measured in milliseconds for the EfficientDet architecture with BN layers during both pre-training and current training on an NVIDIA Jetson Nano 4G?": [
            "446"
        ],
        "What is the IN-1K top-1 accuracy percentage for the ViT-S/16 model pre-trained using DeiT III?": [
            "81.36"
        ],
        "What is the peak training memory of ViTPose when doubling the input resolution from 224x224 to 448x448 compared to EfficientDet (EfficientNet-B6)?": [
            "nearly half"
        ],
        "What improves the performance on sunlamp when added to the training in the data augmentation experiments?": [
            "style augmentation"
        ],
        "How many parameters does the SPNv3-M model have?": [
            "39.6M"
        ],
        "What dataset is the ViT backbone pre-trained on that affects the OOD robustness of SPNv3?": [
            "ImageNet"
        ],
        "What is the size of the input images that SPNv3-S can perform inference on?": [
            "448 × 448"
        ]
    },
    "Self-Contrastive Forward-Forward Algorithm": {
        "What is the recent accuracy percentage achieved by the Forward-Forward algorithm in supervised training on image classification tasks?": [
            "88.2%"
        ],
        "Which color indicates the results of SCFF in Figure 1 of the paper?": [
            "red"
        ],
        "What test accuracy was achieved on the MNIST dataset using a multilayer perceptron (MLP) with the SCFF method?": [
            "98.7%"
        ],
        "In the original Forward-Forward algorithm, what function evaluates the effectiveness of the separation?": [
            "sigmoid function"
        ],
        "What technique is used to create negative data for the MNIST dataset in FF learning?": [
            "masking"
        ],
        "What type of neural network architecture is used in the SCFF method for processing images?": [
            "Convolutional Neural Network"
        ],
        "What activation function is used in the fully connected network described in section 3.1?": [
            "ReLU"
        ],
        "What method was used to train each layer of the network before the next one in the SCFF training procedure?": [
            "fully trained and frozen"
        ],
        "What was the test accuracy of SCFF on CIFAR-10 using a three-layer convolutional architecture?": [
            "80.75%"
        ],
        "What dataset is used for evaluating RNN training performance in the study?": [
            "FSDD"
        ],
        "What is the test accuracy of SCFF when trained with a one-layer Bi-RNN containing 500 hidden neurons?": [
            "90.3%"
        ],
        "What test accuracy percentage did the SCFF method achieve on the STL-10 dataset?": [
            "77.3"
        ],
        "Which dataset did Laydevant et al. demonstrate layer-wise SSL objectives on, as mentioned in section 4.2 of the paper?": [
            "MNIST and CIFAR-10"
        ],
        "What type of algorithms do EP, DP, and LE represent in the context of the paper?": [
            "energy-based learning methods"
        ],
        "Which algorithm from Appendix C is used to train the third layer for the CIFAR-10 dataset?": [
            "Algorithm 2"
        ],
        "What type of norm is used as a penalty term in the training loss function?": [
            "Frobenius Norm"
        ],
        "What type of additional operation is applied to the output of intermediate layers in image classification tasks according to the paper?": [
            "average or max pooling"
        ],
        "What method inspired the pooling layer's approach in the discussed architecture?": [
            "\"four quadrant\" method"
        ]
    },
    "Quantum Magic and Multi-Partite Entanglement in the Structure of Nuclei": {
        "What algorithm was developed to accelerate sampling Pauli string expectation values in sd-shell nuclei?": [
            "PSIZe-MCMC"
        ],
        "How many qubits are required to define the occupancy of the 1p3/2 proton orbitals in the shell-model mapping to qubits?": [
            "four"
        ],
        "What type of entanglement measure is used to quantify how n Q -qubits are entangled within a larger n Q -qubit system?": [
            "n-tangles"
        ],
        "What is the bin width used for the distributions of Pauli-string expectation values in Figure 4 of the paper?": [
            "0.05"
        ],
        "What software was used to generate the network plots in Figure 5 of the paper?": [
            "NetworkX"
        ],
        "What type of entropies are used to quantify the amount of magic in quantum states in this work?": [
            "SREs"
        ],
        "What is the value of M_1 for 6 Be as computed in the study?": [
            "1.0422"
        ],
        "What parameter is used to normalize the quantities in Fig. 11 of the paper?": [
            "maximum value"
        ],
        "What parameter has been normalized in the neon and magnesium isotope chains according to FIG. 11?": [
            "deformation parameter ϱ"
        ]
    },
    "ReactCA_ A Cellular Automaton for Predicting Phase Evolution in Solid-State Reactions": {
        "What simulation framework is presented in this work to predict the evolution of phases in solid-state reactions?": [
            "ReactCA"
        ],
        "What drives the diffusion in the solid-state reaction process described in ReactCA?": [
            "chemical potential differences"
        ],
        "What is used to represent the Gibbs free energy as a function of the mixing ratio in the pairwise interface reaction model?": [
            "convex hull construction"
        ],
        "What Python package is used in ReactCA for identifying stoichiometrically possible reactions?": [
            "reaction-network28"
        ],
        "What is the value of parameter b used to shift/scale the softplus function in the scoring equation?": [
            "0.8"
        ],
        "At what relative temperature value does the swap likelihood begin ramping up in the simulation described in the paper?": [
            "0.8Tm"
        ],
        "What is used as weights in the probability distribution for selecting reactants in the simulation?": [
            "stoichiometric coefficients"
        ],
        "What is scaled to maintain conservation of mass within the automaton described in section 6 of the paper?": [
            "volume"
        ],
        "What is the standard deviation of the maximum and final mass fractions across parallel trajectories when using a sufficiently large simulation box in ReactCA?": [
            "less than 1%"
        ],
        "What temperature was used for the BaCO3 TiO2 recipe at a BaCO3 ratio of 0.4 in the experiment?": [
            "800"
        ],
        "What impurity phase formed at around 1100 K in conjunction with BaTiO3 in the experimental outcome for Recipe I?": [
            "BaTi2O5"
        ],
        "What is the Ti source used in the metathesis reaction for Recipe III?": [
            "NaTiO3"
        ],
        "What is the side length of the simulation box used in the CaZrN2 synthesis simulation?": [
            "15 cells"
        ],
        "What is the peak temperature used in the ReactCA simulation for YMnO3 synthesis?": [
            "1300K"
        ],
        "In the Simulation section, what compound is listed in the first row under the \"Licl\" column?": [
            "YMnO3"
        ],
        "What color represents Class I reactions in Figure 8's histogram?": [
            "red"
        ],
        "What type of data does ReactCA utilize from the Materials Project for its simulation?": [
            "thermodynamic data"
        ],
        "Which level of theory was used for the density functional theory structure relaxation calculation of Y3O4Cl?": [
            "GGA"
        ]
    },
    "Recent Advances in OOD Detection_ Problems and Approaches": {
        "What type of data is the OOD detection aiming to identify and reject?": [
            "OOD samples"
        ],
        "Which approach is identified as a \"special case\" in training-driven OOD detection according to section 3 of the paper?": [
            "OLTR 39"
        ],
        "What does ND stand for in the context of the provided section?": [
            "Novelty detection"
        ],
        "What paradigm in machine learning aims to recognize objects without prior exposure during the training phase?": [
            "Zero-shot learning"
        ],
        "What methodology examines the difference in sample representations before and after a specific process in OOD detection?": [
            "reconstruction-based"
        ],
        "What method does DiGuard employ for semantic mismatch guidance?": [
            "pre-trained diffusion model"
        ],
        "What does LID [21] estimate to classify data as in-distribution in the context of OOD detection?": [
            "local intrinsic dimension"
        ],
        "Which method uses a joint training scheme to select suitable boundary samples for OOD detection?": [
            "Lee et al. 25"
        ],
        "Which figure in the paper roughly illustrates the general procedure of prototype-based OOD detection methods?": [
            "Fig. 5"
        ],
        "What model does SIREN use to represent each class as a compact cluster?": [
            "vMF model"
        ],
        "What strategy does PALM [36] introduce to optimize the modeling process for class diversity?": [
            "mixed-prototype strategy"
        ],
        "What is optimized in OOD detection approaches when real-world OOD data is available during training?": [
            "decision boundary"
        ],
        "What type of data do proponents of Boundary Regularization utilize to enhance the OOD detector?": [
            "auxiliary anomaly datasets"
        ],
        "Which method introduced by Li and Vasconcelos assigns higher priority score reweighting to hard negative instances?": [
            "data resampling"
        ],
        "What is emphasized in training-agnostic OOD detection instead of classifier performance?": [
            "adaptation strategies"
        ],
        "Which method introduced the concept of generalized entropy for OOD detection?": [
            "GEN"
        ],
        "What metric does SSD utilize for classification after self-supervised learning?": [
            "Mahalanobis distance"
        ],
        "What does the symbol 𝑛 represent in the computation formula for OOD detection in the given section of the paper?": [
            "0"
        ],
        "What method introduces a more challenging configuration for test-time OOD detection scenarios?": [
            "MOL"
        ],
        "What approach is employed in the Continuous Adaptive Out-of-Distribution (CAOOD) detection scenario to adapt models quickly?": [
            "meta-learning approach"
        ],
        "What figure in the paper shows the utilization of large pre-trained models for OOD detection tasks?": [
            "Fig. 9"
        ],
        "What type of labels do zero-shot approaches require in the training phase for OOD detection?": [
            "category labels"
        ],
        "What model is used in RONIN [97] to generate ID inpainting for OOD object detection?": [
            "di\"usion model"
        ],
        "What type of OOD detection is suitable for scenarios with high-security requirements?": [
            "Zero-shot OOD detection"
        ],
        "What method do Chen et al. [163] propose for training-free few-shot OOD detection?": [
            "Dual-Adapter"
        ],
        "What technique does NPOS propose to distinguish ID and OOD data?": [
            "non-parametric outlier synthesis"
        ],
        "What is the desirable direction for the AUROC value in OOD detection tasks?": [
            "higher"
        ],
        "What is the abbreviation used for \"covariate shift ID\" data in the experimental protocols for OOD detection?": [
            "cs-ID"
        ],
        "How many classes are there in the CIFAR-100 dataset according to Table 3?": [
            "100"
        ],
        "What dataset is commonly used for Intent Detection in NLP OOD applications?": [
            "CLINC150"
        ],
        "What is MCM an extension of in the context of theoretically-driven score designs for OOD detection?": [
            "Softmax"
        ],
        "Whose proposal suggests integrating human insight into the OOD detection process?": [
            "Vishwakarma et al"
        ],
        "What is the focus of the comprehensive review presented in the paper regarding OOD detection?": [
            "problem scenario perspective"
        ]
    },
    "Motivations, Challenges, Best Practices, and Benefits for Bots and Conversational Agents in Software Engineering_ A Multivocal Literature Review": {
        "What type of agents are known as chatbots according to the introduction?": [
            "conversational agents"
        ],
        "How many grey literature items were collected in the multivocal literature review conducted by Lambiase et al.?": [
            "28"
        ],
        "How many scientific records did Lewandowski et al. find in their systematic literature review from 2015 to 2020?": [
            "21"
        ],
        "What type of literature review was performed to achieve the goal of the study on bots and conversational agents in software engineering?": [
            "Multivocal Literature Review"
        ],
        "How many \"Yes\" responses were recorded in the checklist for deciding to conduct an MLR?": [
            "Six"
        ],
        "What did the authors aim to create to categorize bots based on their use in software engineering?": [
            "taxonomy"
        ],
        "What is the focus of RQ 4 in the paper?": [
            "Benefits"
        ],
        "How many pages of Google search results were analyzed to determine the relevance of the hits in the grey literature search?": [
            "ten pages"
        ],
        "How many sets of eligibility criteria are defined for the formal literature in the Eligibility Criteria Phase?": [
            "three"
        ],
        "What numerical value corresponds to a \"Partially\" answer for the quality criteria in the paper?": [
            "0.5"
        ],
        "How many studies were included from the white literature after applying the quality criteria?": [
            "79 studies"
        ],
        "How many qualitative analysis methods were relied upon for conducting data synthesis in the study?": [
            "two"
        ],
        "How many fundamental motivations for adopting bots in software engineering were identified in the research?": [
            "13"
        ],
        "How many studies from the white literature were identified in the Development sub-category of Software Product Bots?": [
            "9"
        ],
        "How many studies in the dataset are related to Refactoring Bots?": [
            "11"
        ],
        "What type of bot is used to identify bugs and perform automatic fixes according to the studies [A4, A5, A17, A19, A22, A23]?": [
            "Repair Bot"
        ],
        "How many studies from the white literature are focused on bots for monitoring software systems in the CI/CD sub-category?": [
            "4"
        ],
        "How many studies from the white literature were identified in the \"Team\" sub-category?": [
            "3"
        ],
        "How many studies from the white literature are included in the dataset on code review bots?": [
            "5"
        ],
        "How many studies in the dataset focus on bots used for documentation writing?": [
            "10 studies"
        ],
        "How many studies about technology transfer bots were identified in the white literature?": [
            "2"
        ],
        "What color is used in Figure 1 to indicate new challenges originated from the authors' work?": [
            "red"
        ],
        "How many studies from the white literature report on interaction challenges between practitioners and bots?": [
            "17"
        ],
        "What is the most mentioned challenge in training NLP and NLU machine learning models for conversational agents according to the section?": [
            "data availability"
        ],
        "How many studies from the white literature reported challenges in adopting bots for development reasons?": [
            "12"
        ],
        "What is often limited by the specific terms of service of platforms, affecting the adoption of bots according to the \"Terms of Services\" section?": [
            "functionalities"
        ],
        "What section details the challenges in developing and designing bots?": [
            "4.2.3"
        ],
        "What type of models do RAG models combine for effective use of context-specific information?": [
            "retrieval and generation"
        ],
        "What type of bots are designed to manage and guide the actions of other bots without interrupting the practitioner's workflow?": [
            "orchestrator bots"
        ],
        "What effect is associated with users feeling unease when interacting with machines that seem too human?": [
            "uncanny valley effect"
        ],
        "What is highly recommended for practitioners to implement in order to evaluate bots' actions?": [
            "feedback system"
        ],
        "What term is used by Storey et al. to define the benefit of bots helping developers complete tasks related to meaningful goals?": [
            "effectiveness"
        ],
        "What is considered crucial to the success of Conversational Agents' projects according to section 5.1?": [
            "user involvement"
        ],
        "What are conversational agents used for to assist new developers according to section 5.2 of the paper?": [
            "facilitate training"
        ],
        "According to the CHAOS Report by the Standish Group, what percentage of software projects fail?": [
            "70%"
        ],
        "What technology does the bot use to save and utilize contextual information?": [
            "RAG and Vector DBs"
        ],
        "What must be enforced to address the lack of trust in recommendation according to the section?": [
            "transparency"
        ],
        "What is integrated with interaction flow in the Natural Language section?": [
            "behavioral science concepts"
        ],
        "What type of studies are conducted to create datasets for NL modules according to the Integration section?": [
            "Wizard of the Oz studies"
        ],
        "What must bots be adapted to according to the \"Framework\" section?": [
            "privacy policies"
        ],
        "What type of research is lacking regarding the usability of conversational agents for software development?": [
            "Usability Research"
        ],
        "Whose guidelines did the authors follow related to the formal literature selection?": [
            "Kitchenham et al"
        ],
        "What language were the primary sources written in for the MLR conducted in the study?": [
            "English"
        ],
        "What type of literature review was conducted to explore the adoption of bots in software engineering?": [
            "multivocal"
        ]
    },
    "multiPI-TransBTS_ A Multi-Path Learning Framework for Brain Tumor Image Segmentation Based on Multi-Physical Information": {
        "What type of module is designed in multiPI-TransBTS to fuse information from different MRI modalities?": [
            "Adaptive Feature Fusion (AFF) module"
        ],
        "How many categories are deep learning techniques for the BraTS task roughly classified into?": [
            "four"
        ],
        "What type of kernels did Pereira et al. use in their CNNs to enable deeper architectures?": [
            "3 × 3"
        ],
        "Which model developed by Isensee et al. is designed to automatically adjust to various medical imaging tasks?": [
            "nnU-Net"
        ],
        "Which algorithm did Hu et al. propose to address sample imbalance in MRI segmentation?": [
            "UNET-LSTM"
        ],
        "What color represents the necrotic core (NCR) in MRI images of brain tumors as illustrated in Fig. 1?": [
            "green"
        ],
        "Which sub-region has been excluded from the BraTS dataset since 2017?": [
            "non-enhancing solid core"
        ],
        "What model was used to evaluate the impact of different MRI modalities on segmentation performance in the BRATS datasets?": [
            "U-Net"
        ],
        "What architecture does multiPI-TransBTS predominantly utilize to capture spatial information and local patterns?": [
            "CNNs"
        ],
        "In the multiPI-TransBTS framework, what does \"SRSA\" stand for?": [
            "Spatial-Reduction Self-Attention"
        ],
        "What type of mechanisms does the adaptive feature fusion module in multiPI-TransBTS use to recalibrate channel-wise importance?": [
            "Squeeze-and-Excitation mechanisms"
        ],
        "What operation is used to add positional information to the input features in the embedding layer?": [
            "element-wise addition"
        ],
        "What type of attention is combined with channel-wise attention in the Adaptive Feature Fusion (AFF) module to enhance feature representation?": [
            "element-wise attention"
        ],
        "What operation is applied after global average pooling in the channel-wise feature enhancement submodule to reduce the channel dimensionality?": [
            "Conv1"
        ],
        "What operation is used to generate weights for the element-wise feature enhancement in the paper's described process?": [
            "Pooling"
        ],
        "What principle is the feature enhancement (FE) module in the ET encoder of multiPI-TransBTS based on?": [
            "information theory"
        ],
        "How many annotated subject samples are included in the BraTS2020 dataset?": [
            "369"
        ],
        "How many NVIDIA Quadro RTX8000 graphics cards were used in the server for the experiments?": [
            "two"
        ],
        "Which model achieved the best mean Dice score on the BraTS2019 dataset?": [
            "Ours"
        ],
        "What color represents enhancing tumors in the segmentation results of multiPI-TransBTS on the BraTS datasets?": [
            "brown"
        ],
        "What does 'GT' stand for in the visualizations of segmentation results in Figures 8 and 9?": [
            "ground truth"
        ],
        "Which model achieved the highest mean Dice score on the BraTS2020 dataset?": [
            "multiPI-TransBTS"
        ],
        "What does multiPI-TransBTS outperform in BraTS segmentation tasks?": [
            "existing models"
        ]
    },
    "Hypergraph-based Motion Generation with Multi-modal Interaction Relational Reasoning": {
        "What figure describes the interaction among multi-vehicles and the corresponding multi-modal driving behaviors in the Introduction?": [
            "Figure 1"
        ],
        "What is the behavior called when a vehicle maintains its position within the same lane according to Figure 1 section (b) of the paper?": [
            "Lane keeping"
        ],
        "Which type of deep learning techniques do models without explicit semantics employ for trajectory predictions?": [
            "VAEs and GANs"
        ],
        "What type of graph generalization allows for representing higher-order relationships in group-wise interactions?": [
            "hypergraph"
        ],
        "What is the backbone of the RHINO framework in the proposed method?": [
            "GroupNet"
        ],
        "How many features are represented in the historical states <math>X_{1:T}</math> for the input data in the vehicle trajectory prediction framework?": [
            "4"
        ],
        "In the Agent-Behavior Graph Gb, what matrix represents the correlation between behavior modes of different agents?": [
            "⇤"
        ],
        "What type of embeddings does the DGCNH function generate in the GIRAFFE Framework?": [
            "graph embeddings"
        ],
        "What activation function is used in the LatMLP layers of the Intention Predictor?": [
            "softmax"
        ],
        "What replaces the pairwise edges in the original Agent Graph during the transformation to create the hypergraph Ha?": [
            "hyperedges"
        ],
        "What matrix in the Agent-Behavior Hypergraph indicates whether a node is part of a hyperedge?": [
            "Hb"
        ],
        "What type of framework is the multi-agent trajectory generation system in RHINO based on?": [
            "CVAE framework"
        ],
        "How many lateral behavior nodes does each agent node expand into in the Future Hypergraph Relational Encoder?": [
            "three"
        ],
        "What type of function is used to transform the motion states into a trajectory embedding vector in the hypergraph encoder?": [
            "MLP"
        ],
        "What function is applied to the collective embedding zi to obtain the neural interaction strength ri in the hypergraph neural message passing technique?": [
            "sigmoid function"
        ],
        "What function represents the Kullback-Leibler divergence in the Posterior Distribution Learner framework?": [
            "KL"
        ],
        "What is the sampling rate of the NGSIM dataset used in the research?": [
            "10Hz"
        ],
        "What does Lvar in the training loss function for RHINO encourage?": [
            "diversity"
        ],
        "What metric is used to measure the predictive accuracy of the model?": [
            "RMSE"
        ],
        "What dataset is used for trajectory generation in the experimental results presented in Figure 12?": [
            "HighD dataset"
        ],
        "Which prediction horizon was used to compare RMSE performance in the proposed framework?": [
            "50 frames"
        ],
        "What is the RMSE of RHINO w/o MM at a 50-frame horizon?": [
            "1.34"
        ],
        "What does the RHINO w/o HG variant omit from the full RHINO model?": [
            "multi-scale hypergraphs"
        ],
        "What are the two main components of the proposed framework in the study?": [
            "GIRAFFE and RHINO"
        ]
    },
    "Implementing New Technology in Educational Systems": {
        "What was the budget allocated by the Los Angeles Unified School district for iPads in 2013?": [
            "over $1 billion"
        ],
        "Which field of study focuses on the incorporation of new technology into organizations, as mentioned in the \"Strategies for Problem Solving\" section?": [
            "Implementation Science"
        ],
        "What district succeeded by consulting teachers and local principals before designing the school of the future?": [
            "Milpitas School District"
        ],
        "What type of halls are mentioned as a stability mechanism for old lecture practices in STEM courses?": [
            "lecture halls"
        ],
        "What framework from Implementation Science offers a process for each milestone in developing educator-technology partnerships?": [
            "EPIS Framework"
        ],
        "What framework's protocols are provided in the final section of the described implementation project?": [
            "EPIS"
        ],
        "What is the pitfall associated with not exploring a wide variety of local needs and potential interventions during the exploration phase?": [
            "Premature Commitment to Initial Ideas"
        ],
        "What mantra is recommended to be followed during the intervention fit assessment brainstorming process?": [
            "quantity over quality"
        ],
        "What is developed in collaboration with local stakeholders during the preparation phase of implementing a new technology intervention in schools?": [
            "implementation plans"
        ],
        "What is outlined to manage the implementation project in the preparation phase of developing an educator-technology partnership?": [
            "Formal Team Building"
        ],
        "What is revised in light of organizational capacity and barriers according to the Iterative Revision section?": [
            "intervention and implementation plan"
        ],
        "What are Departmental Action Teams referred to in higher education according to Corbo et al., 2015?": [
            "formal teams"
        ],
        "According to Perry et al. (2019), what type of analysis is used to craft a detailed Theory of Change in the implementation planning?": [
            "SWOT analysis"
        ],
        "What should be communicated to various stakeholders following early attempts in well-planned implementations?": [
            "preliminary successes"
        ],
        "What should the end-of-semester feedback forms allow students to comment on in a university classroom implementing interactive engagement pedagogy?": [
            "interactive engagement"
        ],
        "What was developed during the Preparation Phase in the EPIS phases?": [
            "revisable strategic plan"
        ],
        "What does ToC stand for in the context of this paper?": [
            "Theory of Change"
        ],
        "What disadvantage of the One Laptop Per Child project is related to the cost per unit in low-income nations?": [
            "extremely high"
        ],
        "What phenomenon do experts experience that can lead to fixation on initial ideas according to Binz & Schulz, 2023 and Jansson & Smith, 1991?": [
            "fixation"
        ],
        "According to Leifer (1998) and Whitcomb & Whitcomb (2013), what major contributor to failure is highlighted in nearly any field?": [
            "Poor team dynamics"
        ],
        "Which two tools are offered as complementary to find long-term success in technology adoption for education?": [
            "EPIS Framework and SWOT Analysis"
        ]
    },
    "Applications of Knowledge Distillation in Remote Sensing_ A Survey": {
        "What type of neural networks are highly adept at handling high-dimensional data from RS imagery according to the document?": [
            "Convolutional Neural Networks"
        ],
        "Which survey introduces a \"distillation metric\" to compare different Knowledge Distillation methods?": [
            "39"
        ],
        "What domain does Li et al. [42] particularly explore the applications of knowledge distillation in?": [
            "object detection"
        ],
        "What language must the studies be published in to be included according to the criteria in section 1.3.1?": [
            "English"
        ],
        "Which Boolean operator is used to refine the search strategy in the 1.3.2. Search Strategy section?": [
            "AND, OR, NOT"
        ],
        "What type of distillation is suggested for future advancements in Section 7 of the paper?": [
            "dynamic distillation"
        ],
        "Who popularized the term \"knowledge distillation\" in their 2015 paper?": [
            "Hinton et al"
        ],
        "What divergence measure is used to compute the distillation loss in the training of the student network?": [
            "Kullback-Leibler"
        ],
        "What hyperparameter balances the importance of distillation and hard target losses in the student model's total loss function?": [
            "𝛼"
        ],
        "What process enhances the performance of smaller models according to section 2.3.3 of the paper?": [
            "KD"
        ],
        "What variable is used to balance the contributions of LCE and LKD in the overall loss computation?": [
            "α"
        ],
        "What is the feature size of the P3 level before the KT operation in the Teacher Model?": [
            "80*80*512"
        ],
        "What imagery does SpaceNet 7 use for building footprint analysis?": [
            "Planet"
        ],
        "What are the three types of knowledge approaches mentioned in the taxonomy of KD models for RS?": [
            "Response-based, Feature-based, Relation-based"
        ],
        "What does feature-based KD focus on transferring between network layers?": [
            "intermediate feature representations"
        ],
        "What type of graphs do relation-based KD methods construct to model dependencies?": [
            "relational graphs"
        ],
        "What network framework did Zhou et al. propose for semantic segmentation of high-resolution RS images?": [
            "Graph attention guidance network"
        ],
        "What method is used to align each layer of the teacher model with the corresponding layer in the student model for layer-to-layer distillation?": [
            "Direct Mapping"
        ],
        "What method proposed by Chen et al. uses an attention mechanism to assign target layers from a teacher model to each student layer for cross-layer knowledge distillation?": [
            "Sem-CKD"
        ],
        "What technique does Xu et al. use in their hyperspectral image classification method to handle new land-cover types?": [
            "class-incremental learning"
        ],
        "What type of supervision does the ARSD framework proposed by Yang et al. use to enhance lightweight object detectors?": [
            "reinforcement supervision"
        ],
        "What does AFD stand for in the context of the provided section on object detection?": [
            "Attention-based Feature Distillation"
        ],
        "What mechanism is proposed for local distillation in the KD architecture described in Figure 8?": [
            "multi-instance attention mechanism"
        ],
        "Who introduced the Generalized KD (GKD) framework?": [
            "Ienco et al"
        ],
        "What mathematical operation is performed on the feature maps F^T and F^S to obtain the global channel mask Gch?": [
            "addition"
        ],
        "What is the overall accuracy achieved by the C3Net model with Multi-Level KD on the ISPRS Vaihingen dataset?": [
            "91.3%"
        ],
        "What is KD essential for in the context of smart agriculture according to section 5.2.2?": [
            "lightweight models"
        ],
        "What type of optimization is used in the update process of the RSI model in the Vision-Language Foundation Model (VLFM) section?": [
            "Self-supervised Optimization"
        ],
        "What strategy is used to merge the results of the foundation model and the GFSS learner in the proposed method?": [
            "voting fusion strategy"
        ],
        "What activation function is used in the \"Conv\" block as proposed in [117]?": [
            "ReLU"
        ],
        "What percentage improvement in mean average precision (mAP) did Lee et al. [235] achieve using knowledge distillation for multi-class defect detection on residential building façades?": [
            "20%"
        ],
        "In RS applications, what is the main goal of employing KD techniques?": [
            "retain high accuracy"
        ],
        "What is the best value achieved by the model CNN with HRNet-W48 backbone on the large sea-ice segmentation dataset?": [
            "FWIoU score of 97.8439"
        ],
        "What is impacted by data quality according to the section on Knowledge Distillation Challenges in Remote Sensing?": [
            "Model Performance"
        ],
        "What mathematical operation symbolizes the complexity of the distillation loss gradient according to equation (6)?": [
            "∝"
        ],
        "What must the inference time, tinference, be kept within to ensure effectiveness in real-time remote sensing applications?": [
            "treal-time"
        ],
        "What is expressed as a combination of multiple loss components when integrating KD with other techniques?": [
            "overall loss function"
        ],
        "What function quantifies the difference between the teacher's and student's outputs in dynamic distillation?": [
            "\\ue238KD"
        ],
        "What approach allows training to occur across multiple devices or servers in low-cost training algorithms?": [
            "Federated learning"
        ],
        "What parameter in the hardware-aware distillation framework controls the trade-off between model accuracy and hardware efficiency?": [
            "𝜆"
        ],
        "What symbol represents the weighting factor used in the robust distillation loss function to regulate the influence of noise?": [
            "𝜂"
        ],
        "What type of imagery is used as an example for applying semi-supervised distillation in remote sensing?": [
            "satellite imagery"
        ],
        "What symbol represents the total number of nodes in the distributed learning process for distributed distillation?": [
            "𝐾"
        ],
        "What variable in the loss function for real-time distillation represents the penalty for exceeding the inference time threshold?": [
            "𝛾"
        ],
        "What parameter is used in edge-AI distillation to balance energy efficiency and model performance?": [
            "𝛿"
        ],
        "What symbol represents the total number of tasks in the multi-task distillation loss function?": [
            "𝑇"
        ],
        "What type of objects does the model identify in urban monitoring from satellite images?": [
            "vehicles or trees"
        ],
        "What parameter in explainable distillation controls the trade-off between accuracy and interpretability?": [
            "𝜉"
        ],
        "What symbol represents the weight factor for the transfer learning loss component in the hybrid loss function?": [
            "𝛽"
        ],
        "What type of weights are 𝛼t and 𝜇t in the adaptive distillation process?": [
            "time-varying"
        ]
    },
    "Constraint Guided AutoEncoders for Joint Optimization of Condition Indicator Estimation and Anomaly Detection in Machine Condition Monitoring": {
        "What type of neural network is combined with a Variational AutoEncoder (VAE) to estimate the Remaining Useful Life (RUL) of aircraft engines according to Su et al, 2020?": [
            "Recurrent Neural Networks"
        ],
        "What year was the Constraint-Guided AutoEncoders (CGAE) method proposed according to the document?": [
            "2023a"
        ],
        "What constraint is included in MCGAE to enforce the monotonic behavior of the CI estimations?": [
            "monotonicity constraint"
        ],
        "What section of the paper details the comparison methods for the proposed MCGAE method?": [
            "2"
        ],
        "What is the dimensionality of the center point c in AutoEncoder Deep Support Vector Data Description?": [
            "Dl"
        ],
        "What is the center point used for the CI calculation in the CGAE model described by Meire et al, 2023a?": [
            "0"
        ],
        "What framework is used for optimizing the Monotonically Constraint Guided AutoEncoder (MCGAE)?": [
            "CGGD"
        ],
        "How many points are guaranteed to be present in a batch if a run is included according to the stratified creation method described?": [
            "10"
        ],
        "How many runs from the Smart Maintenance dataset were selected for the ablation studies described in the paper?": [
            "6"
        ],
        "What is the sampling frequency used for each sensor in the Acoustic Bearing Monitoring dataset?": [
            "50 kHz"
        ],
        "What is the maximum number of epochs for which the models for the ABM dataset were trained?": [
            "500 epochs"
        ],
        "Which model shows consistent (near) perfect performance on the ABM dataset according to section 5.2.1 of the paper?": [
            "MCGAE"
        ],
        "Which MCGAE variant shows a higher Spearman's ⇢ according to the evaluation in the Acoustic Bearing Monitoring section?": [
            "MCGAE-n"
        ],
        "Which MCGAE variant shows the overall highest Spearman's ⇢ for the Smart Maintenance dataset on the training set?": [
            "MCGAE-nu"
        ],
        "What constraint does the MCGAE algorithm enforce on the estimated CI?": [
            "monotonic behavior"
        ],
        "Which dataset demonstrated a noticeable decrease in performance when reconstructing additional data in the ablation study?": [
            "ABM dataset"
        ]
    },
    "Towards practical secure delegated quantum computing with semi-classical light": {
        "Who is the corresponding author for the paper discussing classical and quantum channels?": [
            "Luka Music"
        ],
        "What type of channels do clients have in the hybrid proposal discussed in the server section of the paper?": [
            "semi-classical"
        ],
        "What type of source does the client need in the proposed SDQC protocol?": [
            "attenuated laser source"
        ],
        "What type of state is first created in the MBQC paradigm mentioned in the section \"3. Measurement-Based Quantum Computing\"?": [
            "graph state"
        ],
        "What state does the server initialize its quantum emitter in for GHZ privacy amplification?": [
            "|+→"
        ],
        "What operation is selectively applied to switch between generating chains of qubits and GHZ states?": [
            "Hadamard"
        ],
        "What type of pulses does the client send in the SDQC protocol described in Theorem 3?": [
            "weak coherent pulses"
        ],
        "What type of gates are required for universality when multiple spins generate linear cluster states in parallel?": [
            "spin-spin CZ gates"
        ],
        "Which section of the paper discusses the analysis of the success probability of the protocol on realistic hardware?": [
            "Section 4"
        ],
        "What operation corresponds to an edge in the graph state definition from Section 2.1 of the paper?": [
            "CZ operation"
        ],
        "What symbol represents the left polarised photon state in the BDQC protocol described in the paper?": [
            "|L→"
        ],
        "How many quantum emitters are used in the first step of the cluster state emission for n = 3 rows?": [
            "3"
        ],
        "In the UBQC protocol, what is the symbol used to represent the measurement angle requested by Alice?": [
            "φ"
        ],
        "What property does the Secure Delegated Quantum Computations protocol guarantee besides privacy?": [
            "verifiability"
        ],
        "What type of states does Alice transmit to hide the phases ς in the protocol described in Section 3.1?": [
            "coherent states"
        ],
        "What type of gates does Bob use to perform entanglement operations between vertex v and vertices w in the Blind Graph State Preparation protocol?": [
            "CZ gates or fusion operations"
        ],
        "What is the security error of the blind graph state generation protocol (Protocol 2) as stated in Theorem 4?": [
            "0"
        ],
        "What type of state is generated using the rotated emission operator Eqe(εi) and phase-randomised rotated weak coherent pulses in the security amplification protocol described?": [
            "rotated GHZ state"
        ],
        "What variable represents the number of pulses sent per GHZ gadget in the given document section?": [
            "n"
        ],
        "What is the security error of the privacy amplification protocol related to in the number of pulses n?": [
            "exponentially"
        ],
        "What is the label of the protocol that tolerates some losses due to a photon not being emitted?": [
            "Protocol 3"
        ],
        "In Theorem 6, which protocols replace the blind graph state generation in UBQC Protocol 4?": [
            "Protocols 2 and 3"
        ],
        "What type of emitter is discussed in section 4.1 for producing single photons?": [
            "two-level emitter"
        ],
        "What is the shape of the input pulse defined by $(t) for ideal light-matter coupling in Figure 9(a)?": [
            "perfect square"
        ],
        "What type of excitation is proposed in Section 4.1 to allow for security amplification?": [
            "resonant excitation"
        ],
        "What type of entanglement is required by the server in the presented protocol?": [
            "spin-photon entanglement"
        ]
    },
    "Smart Data-Driven GRU Predictor for SnO$_2$ Thin films Characteristics": {
        "What technique is used to elaborate thin film samples as mentioned in the introduction?": [
            "Sol-Gel Dip-Coating"
        ],
        "What AI model is proposed for estimating crystal properties in the data-driven material characterization framework?": [
            "AI GRU model"
        ],
        "What model is used for generating output in the \"Model Generation\" section?": [
            "GRU-Estimator"
        ],
        "What software was used to treat the X-ray diffraction patterns in the research on SnO2 thin films?": [
            "HighScore"
        ],
        "What type of gates does a GRU model contain?": [
            "reset gate and update gate"
        ],
        "What activation function is used in the fully connected layers of the GRU gates described in section 6 of the paper?": [
            "sigmoid"
        ],
        "What factor is used to amplify the sensitivity score in the formula for SnO2 thin films characteristics?": [
            "ς"
        ],
        "What is performed on dataset D for a specific goal g according to Step 4 of the paper?": [
            "Feature Selection"
        ],
        "Which properties of the X-Ray diffraction spectra are summarized in the GRU-Based Model Implementation section?": [
            "a, b, D"
        ],
        "What parameters must be determined to classify materials among the crystal systems and Bravais lattices according to the section on Data Sample Collection?": [
            "a, b and c"
        ],
        "What type of experts assist in feature selection according to section 4 of the paper?": [
            "domain experts"
        ],
        "What type of AI model is generated after the learning process in section 5 of the paper?": [
            "GRU model"
        ],
        "What statistical characteristic indicates that Tsec(%) and Time(%) are constants in Table 1?": [
            "standard deviations"
        ],
        "What is the type of the 'Time' variable in Table 1 of the parameters specification?": [
            "Date"
        ],
        "How many features are used as input parameters in the GRU Predictor Models?": [
            "8"
        ],
        "What is the activation function used in the GRUb64 model according to Table 3?": [
            "Relu"
        ],
        "What model is depicted in Figure 6 regarding learning loss?": [
            "GRU(8,64,1) Model"
        ],
        "What is the largest absolute difference in the estimated lattice parameter D as shown in the transaction t5?": [
            "2.00e-2"
        ],
        "What metric is displayed in Figure 9 for the GRU(8a,64,1) model's performance on SnO2 thin films characteristics?": [
            "Square R2 Metric"
        ],
        "What is the R-squared value for the GRU(8,64,1) model as shown in Figure 11?": [
            "1.00"
        ],
        "What type of predictor is discussed in Fig. 12 of the paper?": [
            "GRU Predictor"
        ]
    },
    "Ramp reversal memory in bulk crystals of 1T-TaS2": {
        "At what temperature does the MIT occur in 1T-TaS2?": [
            "190 K"
        ],
        "What is the abbreviation for the transition metal dichalcogenide demonstrated to exhibit the RRM effect in the paper?": [
            "1T-TaS2"
        ],
        "What do the scars in the heuristic model of RRM indicate?": [
            "increased MIT transition temperature"
        ],
        "At what temperature does 1T-TaS2 transition from an incommensurate CDW to a nearly commensurate CDW?": [
            "350K"
        ],
        "At what temperature is the N-phase of 1T-TaS2 recovered upon heating?": [
            "280K"
        ],
        "At what temperature does the full T-phase occur during the 'heating' measurement in the RRM writing protocol for 1T-TaS2?": [
            "240K"
        ],
        "What is the reversal temperature (TR) marked in Figure 2f of the paper?": [
            "190.3K"
        ],
        "What is the highest previously measured value of the temperature shift, ΔT, in thin film TMOs?": [
            "0.6 K"
        ],
        "What follows the reversal temperature in Figure 3a of the paper?": [
            "ΔT peak"
        ],
        "How many reversal loops were performed to the higher temperature TR before the memory effect was measured in the second case in Figure 3c?": [
            "3"
        ],
        "What is the TR marked in Figure 4 following the different dwell times?": [
            "189.7K"
        ],
        "What is the ΔT Peak value at a Tmax of 290K according to Figure 5?": [
            "1.0"
        ],
        "What is the effective TR shift measured in the ΔT curves after a three-hour dwell at TR?": [
            "3.2K"
        ],
        "What is the thickness of the flake of exfoliated 1T-TaS2 used in the study as shown in Figure 7e?": [
            "47nm"
        ],
        "At what temperature is the memory in 1T-TaS2 erased when the system is heated above the T-phase?": [
            "~280K"
        ],
        "What is the maximum ΔT peak magnitude observed for VO2 atop SiO2?": [
            "0.6K"
        ],
        "What is the average distance between uncorrelated sites defined as in the numerical simulation of the RRM effect in 1T-TaS?": [
            "correlation length"
        ],
        "What is the hypothesized correlation length in TaS2 compared to TMOs?": [
            "shorter"
        ],
        "What type of cryostat was used to cool the 1T-TaS₂ bulk sample?": [
            "home-made"
        ],
        "What substrate was used for the 1T-TaS₂ flakes in the fabrication process?": [
            "SiO₂ 300nm/Si"
        ],
        "What software was used for the numerical simulations described in the paper?": [
            "Matlab"
        ]
    },
    "Unveiling the Secrets of New Physics Through Top Quark Tagging": {
        "What collider is described as a \"top factory\" due to its substantial tt¯ production cross-section?": [
            "LHC"
        ],
        "What is the minimum transverse momentum (pT) requirement for fat jets in the Johns Hopkins Top Tagger study as mentioned in the paper?": [
            "500 GeV"
        ],
        "What is the R-parameter value for fat jets in the pT range of 600-750 GeV according to the table in the section \"Top jets vs. QCD jets, 450 GeV < p < 600 GeV\"?": [
            "0.6"
        ],
        "What is the minimum transverse momentum required for the reconstructed top jets in the discussed algorithm?": [
            "200 GeV"
        ],
        "What is the fixed exponent value used in the angular distance formula for EFPs?": [
            "0.5"
        ],
        "What type of momentum is usually preferred in the translation preprocessing step for jet images?": [
            "transverse momentum"
        ],
        "What type of matrices are used for weight initialization to stabilize the training process in neural networks?": [
            "Unitary matrices"
        ],
        "What is the radius of the top jets reconstructed for the analysis in figure 8?": [
            "1.0"
        ],
        "What figure depicts the ROC curves for CapsNet and Rutgers DeepTop CNN in the section \"4.1 Graph representation of jets\"?": [
            "Figure 8"
        ],
        "What is used to estimate the approximate shape of the posterior from the training data in the Bayesian version of the DeepTop tagger?": [
            "Kullback-Leibler divergence"
        ],
        "What dataset was used to evaluate the performance of the Particle Flow Network (PFN)?": [
            "80"
        ],
        "How many EdgeConv blocks does ParticleNet implement?": [
            "three"
        ],
        "What type of layers are used in LGN [86] to perform CG decompositions?": [
            "Clebsch-Gordon layers"
        ],
        "What symbol represents the Minkowski inner product in the neighbourhood aggregation formula of LorentzNet?": [
            "⇐a⇒"
        ],
        "How many aggregation functions are employed in the PELICAN architecture's aggregation block?": [
            "15"
        ],
        "What is the universe's asymmetry mentioned in relation to experimental inconsistencies?": [
            "baryon"
        ],
        "What type of theories propose models that go beyond the Standard Model?": [
            "Grand Unification Theories (GUTs), supersymmetry"
        ],
        "Which generation of fermions does the paper mention have preferential couplings?": [
            "third-generation"
        ],
        "What are the decay products of TeV scale states mentioned in the paper?": [
            "SM leptons, quarks and bosons"
        ],
        "In the context of the paper, which type of decaying candidates are more likely to manifest as a single fat jet?": [
            "top quarks"
        ],
        "What type of bosons require the superseding of the Standard Model (SM)?": [
            "Z ↑"
        ],
        "What minimum extra symmetry is required for W↑ bosons according to the section of the paper?": [
            "SU (2) gauge group"
        ],
        "What type of bosons are predicted to mediate interactions between DM and normal matter according to models for dark matter?": [
            "Z↑ bosons"
        ],
        "At what confidence level did CMS consider the mass of right-handed W ↑ bosons to be below 3.9 and 4.3 TeV?": [
            "95%"
        ],
        "What is the assumed decay width of the new particle for the quoted limits in the paper?": [
            "narrow"
        ],
        "What is the lower mass limit below which CMS has excluded gKK excitations?": [
            "4.55 TeV"
        ],
        "What type of fermions are vector-like quarks (VLQs) described as in the Composite Higgs models?": [
            "colour-triplet spin-1/2 fermions"
        ],
        "What is the most stringent limit put by the ATLAS search on T decaying into tZ?": [
            "1.6 TeV"
        ],
        "What is the upper limit on the stop mass established by the ATLAS analysis at a 95% confidence level?": [
            "950 GeV"
        ],
        "What types of neural networks are focused on in the discussion of top taggers in the paper?": [
            "CNNs, GNNs"
        ],
        "What can efficient identification of the final state top quark help reduce in the study of BSM physics at the LHC?": [
            "SM background"
        ]
    },
    "BRDF-NeRF_ Neural Radiance Fields with Optical Satellite Images and BRDF Modelling": {
        "What is the submission date of the preprint to the ISPRS Journal of Photogrammetry and Remote Sensing?": [
            "September 19, 2024"
        ],
        "What type of camera is used to capture images for the vanilla NeRF as mentioned in the paper?": [
            "pinhole camera"
        ],
        "Which BRDF model is widely used in remote sensing and will be utilized in this work according to Figure 2?": [
            "RPV"
        ],
        "What type of camera model does Sat-NeRF replace the pinhole camera model with?": [
            "Rational Polynomial Coefficients"
        ],
        "Which model did Labarre et al. (2019) invert on a set of 21 multiangular Pleiades images?": [
            "Hapke model"
        ],
        "What is predicted to extend the applicability of BRDF-NeRF to sparse view acquisitions as mentioned in Section 3.1?": [
            "geometric information"
        ],
        "What term is used in the paper to represent the uncertainty of the predicted depth in the depth supervision section?": [
            "S(r)2"
        ],
        "What model is used to estimate the reflectance of natural surfaces in the provided section of the paper?": [
            "RPV model"
        ],
        "In the RPV model, what parameter represents the sharp increase in reflectance in the hotspot direction?": [
            "ρc"
        ],
        "What function is used for the activations of ρ0, k, Θ, and ρc in the network architecture?": [
            "sigmoid function"
        ],
        "What function follows the 8-layer MLPs in the BRDF-NeRF architecture to predict density?": [
            "softplus"
        ],
        "What optimizer is used to train the network described in the \"Training\" section?": [
            "Adam Optimizer"
        ],
        "What is the Ground Sampling Distance (GSD) of the input images used in the evaluations of the Djibouti and Lanzhou sites?": [
            "2m"
        ],
        "How many multiangular Pleiades 1B images does the Djibouti Dataset consist of?": [
            "21"
        ],
        "How many training images from Lanzhou are used in the test scenarios?": [
            "four"
        ],
        "Which method has the smallest MAE when atmospheric correction is applied according to Table 3?": [
            "BRDF-NeRF"
        ],
        "Which method has the lowest MAE on the Dji-A dataset?": [
            "SGMZ1"
        ],
        "Which rendering method, Rensur or Renvol, achieved the highest PSNR value on the Hard test set according to Table 6?": [
            "Rensur"
        ],
        "Which pre-training strategy on Dji-A resulted in the blurriest zoom-in details according to Figure 14?": [
            "Preno"
        ],
        "Which rendering has blurrier details when zoomed in according to Figure 16?": [
            "Renvol"
        ],
        "What model is integrated into BRDF-NeRF to enhance the rendering of anisotropic surface reflectance?": [
            "Rahman-Pinty-Verstraete (RPV) model"
        ]
    },
    "SPRMamba_ Surgical Phase Recognition for Endoscopic Submucosal Dissection with Mamba": {
        "What backbone does the SPRMamba framework use for spatial feature extraction from ESD videos?": [
            "ResNet-50"
        ],
        "What datasets were used for experiments in the SPRMamba framework?": [
            "ESD385 and Cholec80"
        ],
        "What type of networks do PhaseNet, EndoLSTM, and SVRCNet incorporate to capture temporal dependencies?": [
            "LSTM networks"
        ],
        "What is the window size used to illustrate the Temporal Sample Strategy in Figure 1?": [
            "4"
        ],
        "What function is used to activate the expanded dimension in the first branch of the TranMamba module?": [
            "SiLU"
        ],
        "What function is used to activate the Attention layer in the third branch of the SPRMamba architecture?": [
            "GELU"
        ],
        "What is the practical value of W used for temporal window sampling as mentioned in the section?": [
            "W=64"
        ],
        "What is the spatial dimension D of the features extracted from a fixed ResNet-50 in the SPRMamba architecture?": [
            "2048"
        ],
        "How many total instances are there in the test set for ESD Surgical phases?": [
            "171201"
        ],
        "How many ESD procedure videos were collected for the study described in section 4.1.1 of the paper?": [
            "385 videos"
        ],
        "How many cholecystectomy videos are contained in the Cholec80 dataset?": [
            "80"
        ],
        "What is the fine-tuned image resolution used during training in the implementation details?": [
            "250 ≃ 250"
        ],
        "How much does SRTM improve the accuracy when using Mamba branches alone on the ESD385 dataset?": [
            "0.73%"
        ],
        "In the ablation study, which configuration achieved the highest average Jaccard percentage?": [
            "Ours"
        ],
        "What is the average recall percentage for the model using Conv with Dilation?": [
            "77.51%"
        ],
        "What module combines the ability of Mamba to extract long-term temporal context with the Transformer's ability to extract short-term temporal context in SPRMamba?": [
            "Scale Residual TranMamba module"
        ],
        "What does SPRMamba outperform current state-of-the-art methods in according to the paper?": [
            "accuracy and robustness"
        ]
    },
    "Qwen2.5-Coder Technical Report": {
        "Which model scored the highest on the Performance Metrics chart?": [
            "Qwen2.5-Coder 7B-Instruct"
        ],
        "How many layers does the Qwen2.5-Coder 7B model have?": [
            "28"
        ],
        "What is the final average performance of Qwen2.5-Coder after 4-stage filtering according to Figure 1?": [
            "46.8%"
        ],
        "Which model's pre-training corpus was integrated into the Qwen2.5-Coder dataset to enhance its mathematical capabilities?": [
            "Qwen2.5-Math"
        ],
        "What is the final selected mixture ratio of Code, Text, and Math data for Qwen2.5-Coder's training dataset?": [
            "70:20:10"
        ],
        "How many tokens is the context length extended to during repo-level pretraining?": [
            "32,768 tokens"
        ],
        "What does the Result Analyzer provide based on failed test cases?": [
            "suggestions"
        ],
        "What tool is used to parse code snippets in the Mixed Tuning section?": [
            "tree-sitter-languages1"
        ],
        "What method was used to decontaminate the datasets in Qwen2.5-Coder?": [
            "10-gram overlap method"
        ],
        "What is the size of the Qwen2.5-Coder-1.5B model?": [
            "1.5B"
        ],
        "How many times more unique test cases does HumanEval+ have compared to the original HumanEval?": [
            "80 times"
        ],
        "What is the average performance score of DS-Coder-33B-Base on MultiPL-E?": [
            "50.3"
        ],
        "How many programming languages were evaluated from the MultiPL-E benchmark for Qwen2.5-Coder?": [
            "eight"
        ],
        "What benchmark was used to test code reasoning in the study?": [
            "CRUXEval"
        ],
        "What is the CRUXEval score for StarCoder2-15B?": [
            "46.1"
        ],
        "Which model achieved the highest score on the HellaSwag benchmark according to Table 11?": [
            "Qwen2.5-Coder-7B-Base"
        ],
        "What is the maximum input length supported by Qwen2.5-Coder for long sequence code data?": [
            "128K tokens"
        ],
        "How many core areas were assessed in the evaluation of the instruct models?": [
            "six"
        ],
        "Which model surpassed an 80% accuracy rate on HumanEval+ according to the paper?": [
            "Qwen2.5-Coder-7B-Instruct"
        ],
        "What accuracy score did Qwen2.5-Coder-7B-Instruct achieve on the hard subset of BigCodeBench-Instruct?": [
            "18.2%"
        ],
        "What is the Pass@1 accuracy of the Qwen2.5-Coder-7B-Instruct model on the Live-CodeBench dataset as reported in Table 13?": [
            "37.6%"
        ],
        "What is the average accuracy of Qwen2.5-Coder-7B-Instruct according to the McEval Performance?": [
            "76.5%"
        ],
        "What is the Input-CoT accuracy of the DS-Coder-V2-Lite-Instruct model on CRUXEval?": [
            "53.0%"
        ],
        "What is the source of the Python exercises used in Aider 8's code editing benchmark?": [
            "Exercism"
        ],
        "What benchmark was introduced by Li et al. in 2024 for evaluating Text-to-SQL tasks?": [
            "BIRD"
        ],
        "What is the MATH score for DS-Coder-V2-Lite-Instruct?": [
            "61.0"
        ],
        "How many tasks did the Qwen2.5-Coder-7B-Instruct model outperform the DS-Coder-V2-Lite-Instruct in?": [
            "11"
        ],
        "What will future research focus on in terms of scaling up code LLMs?": [
            "data size and model size"
        ]
    },
    "Community Shaping in the Digital Age_ A Temporal Fusion Framework for Analyzing Discourse Fragmentation in Online Social Networks": {
        "What framework does the research propose for analyzing discourse fragmentation in online social networks?": [
            "Temporal Fusion Framework"
        ],
        "How many layers does the proposed framework consist of?": [
            "four"
        ],
        "What aspect of social media discussions does the analysis framework focus on regarding the formation, evolution, and polarization of opinions?": [
            "opinion dynamics"
        ],
        "How many key elements are derived from the structure and dynamics of online social media in the temporal visualization method?": [
            "fourteen"
        ],
        "What type of analysis is integrated with network visualization to examine social networks' evolutionary trajectories?": [
            "temporal analysis"
        ],
        "What did Morelli et al. examine in the context of online social networks?": [
            "collective mobilization"
        ],
        "What does the JoiFl framework analyze in real-time on Twitter?": [
            "followers, tweets, retweets, mentions"
        ],
        "What hurricane event was used as a case study by both Fan et al. and Rajmut et al. in their research?": [
            "hurricane surge"
        ],
        "What algorithm do T'Kalantari et al. use to track communities and their leaders over time?": [
            "dynamic operational community detection algorithm"
        ],
        "What is the first component of the methodological framework employed to investigate community formation within social networks?": [
            "DATA COLLECTION"
        ],
        "What must the collected dataset incorporate to understand the temporal evolution of online communities according to the paper's section?": [
            "timestamps"
        ],
        "What attribute in the dataset indicates the precise time of tweet publication in a unique format?": [
            "created_at"
        ],
        "Which neural network model is mentioned as having demonstrated effectiveness for multi-class text classification according to Summers and Romero, 2018?": [
            "LSTM"
        ],
        "What color is used to represent the small community nested within the larger green group in Figure 2?": [
            "blue"
        ],
        "How many spatial visual representations are generated for each community using the dataset subset 𝑊{𝑎, 𝑠#} over the period 𝑑 days?": [
            "2𝑑 + 1"
        ],
        "What element in Interaction Dynamics is essential for understanding patterns of influence on social media networks?": [
            "Relational Dynamics"
        ],
        "What aspect of social media discussions does the \"Dominance\" element examine?": [
            "structural inequalities"
        ],
        "What will the key elements introduced in the future work section highlight from raw data?": [
            "broader societal trends"
        ],
        "What event on May 25, 2020, sparked the data collection for the \"Black Lives Matter\" movement study?": [
            "killing of George Floyd"
        ],
        "How many categories of harmful language were used in the annotated dataset for training the models in the study?": [
            "eight"
        ],
        "How many users engaged in hate speech tweets in San Francisco according to Figure 4?": [
            "567,557"
        ],
        "What hashtag was central to the tweets during the Black Lives Matter movements mentioned in the paper?": [
            "#BlackLivesMatter"
        ],
        "What was the second most common type of hate speech found in New York City in 2018 according to the study?": [
            "Racism"
        ]
    },
    "Biological arrow of time_ Emergence of tangled information hierarchies and self-modelling dynamics": {
        "Which law states the impossibility of fully transforming disordered heat energy into coherent work without the expense of an additional resource?": [
            "Second law"
        ],
        "What process involves making RNA copies of genetic protein information encoded in DNA?": [
            "Transcription"
        ],
        "What term did Woese use to describe the evolutionary shift from horizontal gene transfer to vertical inheritance?": [
            "Darwinian threshold"
        ],
        "What type of organisms develop clonally from the division of a single cell?": [
            "Multicellular organisms"
        ],
        "What concept did Black et al. propose to explain the emergence of collective-level reproduction?": [
            "ecological scaffolding"
        ],
        "What is Gödel numbering used to assign to statements about natural number arithmetic?": [
            "natural number"
        ],
        "What action follows the print operation in the finite-state specification example of a Turing Machine?": [
            "R"
        ],
        "What theorem states that the subsets of the natural numbers are uncountable?": [
            "Cantor’s Theorem"
        ],
        "What operation relates α-order oracle machines in the context of the Turing jump?": [
            "\"Turing jump"
        ],
        "According to Moore, how many degrees of freedom must a physical dynamical system have to be Turing equivalent?": [
            "three"
        ],
        "What law suggests that lost complex traits are unlikely to be regained in the same form in evolution?": [
            "Dollo’s law"
        ],
        "Who offered the perspective that the arrow of time is an arrow of increasing correlations in the context of quantum mechanics?": [
            "Seth Lloyd"
        ],
        "What pattern in Conway's Game of Life is depicted in Figure 6?": [
            "toad"
        ],
        "What theorem did Casti apply to prove that universal computing dynamical systems have strange attractors unreachable from any initial state?": [
            "Chaitin’s (Incompleteness) Theorem"
        ],
        "Who explored the concept of tangled hierarchies in his seminal book?": [
            "Hofstadter"
        ],
        "What term did Prokopenko et al. use to describe the concept of shared encoding in proto-cells?": [
            "stigmergic gene transfer"
        ],
        "What type of functions do bottom-level entities compute to facilitate collective action, as described in section 5.7 of the paper?": [
            "non-decomposable functions"
        ],
        "What concept does Fig. 7 in the paper illustrate?": [
            "tangled hierarchy"
        ],
        "What concept describes ants indirectly coordinating through the environment?": [
            "stigmergy"
        ],
        "What term implies a continuous progression along a single dimension in the context of the paper's \"Scales vs levels\" section?": [
            "scales"
        ],
        "What distinguishes type II from type I tangled hierarchies according to the section?": [
            "self-modelling"
        ],
        "What is not explicitly modeled by micro-scale objects in a tangled hierarchy of type I (TH-I)?": [
            "macro-scale regularity"
        ],
        "What type of hierarchy is described by the ant foraging and optimal path formation in a pheromone field?": [
            "TH-I"
        ],
        "What process leads to the decoding of an organism's observable phenotypic traits according to Figure 9?": [
            "Gene expression"
        ],
        "What hormone triggers leaf outgrowth in plants as mentioned in section 6.2.3?": [
            "auxin"
        ],
        "What year was the impossible staircase pattern devised by Oscar Reutersvärd?": [
            "1937"
        ],
        "What phenomenon causes ants to form \"death spirals\" according to Delsuc [28]?": [
            "ant mills"
        ],
        "What type of reduction enables a TH-II system to be more predictive about its dynamics?": [
            "dimensionality reduction"
        ],
        "What discrepancy is argued to be exhibited by the tangled hierarchy linking individual and group levels according to Section 7.2?": [
            "expression-referent discrepancy"
        ],
        "What principle did Pross introduce to extend Darwinian theory of evolution to inanimate matter?": [
            "Dynamic Kinetic Stability"
        ],
        "What core function identified by Wong et al. is responsible for novelty generation in self-replicating systems?": [
            "counterfactual reasoning"
        ],
        "What term is used by Kauffman to describe the set of all potential configurations that are one step away from a system's current state?": [
            "adjacent possible"
        ]
    },
    "Analysis of the ICML 2023 Ranking Data_ Can Authors' Opinions of Their Own Papers Assist Peer Review in Machine Learning?": {
        "How many submissions did NeurIPS 2023 receive?": [
            "12,343"
        ],
        "At which conference was the survey experiment conducted to evaluate the Isotonic Mechanism for peer review?": [
            "ICML"
        ],
        "What statistical level of confidence is achieved for the decrease in ground truth squared error using the Isotonic Mechanism?": [
            "99%"
        ],
        "Whose analysis provides \"truthfulness\" guarantees for the isotonic mechanism discussed in the paper's conclusion?": [
            "Su, 2022"
        ],
        "What is the average percentage improvement in MSE for numbers of submissions between 2 and 10 according to Figure 1 in the paper?": [
            "25%"
        ],
        "How many authors from ICML 2023 did not have OpenReview profiles?": [
            "20"
        ],
        "What was the mean review score for submissions that received the \"Outstanding Paper Award\"?": [
            "7.72"
        ],
        "What platform hosted the peer review process for ICML 2023?": [
            "OpenReview"
        ],
        "By what date will all data collected from the experiment be deleted?": [
            "December 31, 2024"
        ],
        "What is the mean of average review scores received by the highest-ranked papers before the rebuttal period?": [
            "4.80"
        ],
        "What is the average number of reviews per submission after the rebuttal period as of April 22, 2023, according to the ICML 2023 ranking data?": [
            "3.29"
        ],
        "What type of norm is denoted by ↑ · ↑ in the Isotonic Mechanism optimization program?": [
            "ε2 norm"
        ],
        "What color block indicates papers with averaged scores in the multi-owner strategy for the Isotonic Mechanism?": [
            "red"
        ],
        "What type of estimators are y and y↑ assumed to be in the evaluation of isotonic scores?": [
            "unbiased estimators"
        ],
        "What is the percentage reduction in the proxy MAE when using the greedy strategy of the Isotonic Mechanism according to Table 2?": [
            "11.71%"
        ],
        "What is the minimum average reduction in MSE at the 95% confidence level for the Multi-owner Strategy using isotonic scores compared to raw scores?": [
            "0.42"
        ],
        "What is the Isotonic Score for 800 submissions in the Multi-owner, Squared Error section?": [
            "360"
        ],
        "What is the Raw Score for Multi-owner at Rank 11 in the Mean Squared Error table?": [
            "0.86"
        ],
        "Who has access to the isotonic scores for overseeing ACs' recommendations?": [
            "SACs"
        ],
        "What percentage of submissions that received oral presentations at ICML 2023 and had author rankings were ranked first by at least one of their authors?": [
            "69.1%"
        ],
        "What percentage of the most \"unexpected\" review outcomes had the lowest average confidence levels according to Table 4?": [
            "42.2%"
        ],
        "What percentage of ICML 2023 authors stated they would submit the same rankings even if they were to be used for decision making?": [
            "59.4%"
        ],
        "What percentage of coauthor pairs provided inconsistent comparisons for submissions with substantial review score differences according to Wu et al., 2023?": [
            "25.9%"
        ]
    },
    "EDEN_ Exploring Disks Embedded in N-body simulations of Milky-Way-mass halos from Symphony": {
        "How many MW-mass halos are re-simulated in the EDEN simulations?": [
            "45"
        ],
        "Which halo finder was used to identify halos in the Symphony simulations?": [
            "ROCKSTAR"
        ],
        "What is the Spearman correlation coefficient (rS) between the stellar mass and the stellar half-mass formation scale factor for the SymphonyMilkyWay hosts?": [
            "-0.50"
        ],
        "What is the redshift value where the disks are initialized in Figure 2 of the paper?": [
            "3"
        ],
        "What fraction of the UM-predicted stellar mass is assumed to be in the spherical bulge in the EDEN simulations?": [
            "13%"
        ],
        "What label is given to the nine DMO counterparts of 'EDEN M→,Disk ↓ 2.5'?": [
            "Symphony M→,Disk ↓ 2.5"
        ],
        "Which year's study showed that low-mass subhalos with \"cuspy\" profiles favored by CDM stay bound for much longer than the lifetime of the universe?": [
            "2010"
        ],
        "What fraction is the median value of Mvir/Mpeak in both SymphonyMilkyWay and EDEN?": [
            "0.2"
        ],
        "What factor becomes stronger with increasing M→,Disk /Mvir,host according to Figure 4 in the paper?": [
            "subhalo abundance suppression"
        ],
        "What is the Spearman correlation coefficient for NDisk/NDMO and log10(M→,Disk/Mvir,host) within 100 kpc in the EDEN fiducial simulations?": [
            "!0.60"
        ],
        "What is the best-fit value of x0 for the range r < Rvir,host in Table 1?": [
            "0.67"
        ],
        "What color represents the median SPMF for EDEN fiducial in Figure 6?": [
            "red"
        ],
        "What is the minimum distance between a subhalo and its host halo on the 10 Myr grid defined as, according to the right panel of Fig. 7 in the EDEN paper?": [
            "pericenter distance"
        ],
        "What symbol represents the disk-to-halo mass ratio in Figure 8?": [
            "M→,Disk ↓ 2.5"
        ],
        "Which historical maximum mass proxy is mentioned as being more concentrated in radial distribution for subhalos?": [
            "Mpeak"
        ],
        "What numerical resolution is higher than EDEN according to Garrison-Kimmel et al. (2017)?": [
            "→ 10↓"
        ],
        "What is the maximum deviation in kpc of the EDEN hosts from their Symphony DMO counterparts at z = 0?": [
            "40 kpc"
        ],
        "What is the expected disk effect on subhalo abundance within 100 kpc according to EDEN?": [
            "→ 20%"
        ]
    },
    "Putting Data at the Centre of Offline Multi-Agent Reinforcement Learning": {
        "Which library provides standardized and publicly available single-agent offline RL datasets as mentioned in the Introduction?": [
            "D4RL"
        ],
        "What metric is often reported to measure a dataset's 'quality' in offline MARL papers?": [
            "mean episode return"
        ],
        "What paper introduced the MAICQ model?": [
            "Yang et al., 2021"
        ],
        "How many random seeds were used to report the final evaluation episode return of the offline MARL algorithms trained on the datasets?": [
            "10"
        ],
        "How many different SMAC scenarios were used in the offline MARL experiment?": [
            "three"
        ],
        "Which algorithm is trained on the two datasets generated on 2-Agent Halfcheetah in the paper?": [
            "MADDPG+CQL"
        ],
        "What metric is often reported as a proxy for diversity in the literature of offline MARL settings?": [
            "standard deviation"
        ],
        "What scenario from MAMuJoCo is used to construct two datasets with equal mean and std for the dataset distribution illustration?": [
            "2halfcheetah"
        ],
        "How many trajectories are in the CFCQL dataset according to the subsampled datasets table?": [
            "4992"
        ],
        "What quality level were the datasets from the 5m_vs_6m scenario used in the training of IQL+CQL?": [
            "Medium"
        ],
        "What metric was extended from Schweighofer et al. (2022) to measure dataset diversity in the multi-agent setting?": [
            "SACo"
        ],
        "How many datasets from prior works were converted into a consistent format as per Toledo et al., 2023?": [
            "over 80"
        ],
        "What is the name of the standardized dataset proposed for offline MARL?": [
            "OG-MARL"
        ],
        "What utility is used to standardise the format of datasets in OG-MARL?": [
            "Vault"
        ],
        "How many Vault datasets does OG-MARL support for downloading?": [
            "88"
        ],
        "What value is provided by describe_coverage for each dataset in the Vault?": [
            "Joint-SACo"
        ],
        "What function is used to generate episode return violin plots from a Vault?": [
            "describe_episode_returns"
        ],
        "What scenario is depicted in Figure 6 of the paper for dataset subsampling examples?": [
            "2s3z Vault"
        ]
    },
    "Optical Label-Free Microscopy Characterization of Dielectric Nanoparticles": {
        "What property relates diffusivity to size for spherical particles in a viscous medium according to the Stokes-Einstein relation?": [
            "size"
        ],
        "What is the refractive index of water as mentioned in the provided section of the paper?": [
            "1.33"
        ],
        "What determines the image obtained by a scattering microscope according to section B of the paper?": [
            "objective lens"
        ],
        "What operator denotes the Fourier transform in the mathematical framework described?": [
            "F"
        ],
        "What is the maximum angle relative to the optical axis that the objective admits for plane wave components?": [
            "ωmax"
        ],
        "What does the symbol φ represent in the context of the partially transmissive filter discussed in section 2.2 of the paper?": [
            "attenuation"
        ],
        "What angle must sin ωref exceed to ensure that P(k → kref) does not overlap with the term |Esca|2?": [
            "3 sin ωmax/M"
        ],
        "What year was the exact solution to the problem of light scattering by a homogeneous sphere derived by Gustav Mie?": [
            "1908"
        ],
        "What is the typical specific refractive index increment value for carbohydrates?": [
            "0.16 ml/g"
        ],
        "What is the approximation called that is described in the provided equation?": [
            "Rayleigh-Debye-Gans"
        ],
        "What encodes the distribution of refractive index within a particle in the described integral?": [
            "form factor"
        ],
        "What is the form factor value at a 0 degree scattering angle according to the section?": [
            "1"
        ],
        "What is the wavelength of the illuminating light used for calculating the form factors of homogeneous spheres in water?": [
            "532 nm"
        ],
        "What is the equation number that describes the scattered field from a nanoparticle located a distance z from the focal plane at the camera plane in darkfield microscopy?": [
            "38"
        ],
        "What is the illumination angle ωill for darkfield imaging through spatial blocking as discussed in Section 2?": [
            "0"
        ],
        "What is utilized to refocus detections individually in quantitative field imaging?": [
            "re-propagation"
        ],
        "What type of noise arises from coherent reflections and scattering along the beam path in scattering microscopy images?": [
            "speckle noise"
        ],
        "What algorithm is used for particle detection in iSCAT microscopy as trained in the appended notebooks?": [
            "LodeSTAR"
        ],
        "What figure in the paper demonstrates the use of oblique illumination for particle characterization using darkfield imaging?": [
            "Figure 11A"
        ],
        "What is the wavelength of the camera used for scattering signal measurement in Figure 12?": [
            "488 nm"
        ],
        "What method was used in Ref. [16] to characterize the polarizability and hydrodynamic radius of individual biomolecules?": [
            "NSM"
        ],
        "What is the lowest reported detection limit for iSCAT for suspended nanoparticles?": [
            "40 nm"
        ],
        "What microscopy technique is used to minimize the effect of unwanted light scattering for less strongly scattering particles?": [
            "confocal scattering microscopy"
        ]
    },
    "Optimal Visual Search with Highly Heuristic Decision Rules": {
        "What is the typical duration of fixations during overt search as used in the stimuli presentation for the covert search tasks?": [
            "250 msec"
        ],
        "What was the diameter of the wavelet target added to the noise patch in the experiments?": [
            "0.8 deg"
        ],
        "What is the average target detectability (d') across all display locations mentioned in the Human Detectability section?": [
            "2.17"
        ],
        "What figure illustrates the qualitative pattern of detectability in the fovea and other locations?": [
            "Figure S1a-d"
        ],
        "What is the overall detectability value reported in Figure 1c for the covert search task?": [
            "1.22"
        ],
        "What is the standard deviation of the Gaussian distribution for R_k in the signal detection framework?": [
            "1.0"
        ],
        "What is the standard deviation of the random percentage by which the actual d value is scaled in the simulation of varying background properties?": [
            "20%"
        ],
        "What is the estimated percentage of total noise variance due to correlated noise in the search task?": [
            "45%"
        ],
        "How many cpd was the wavelet target chosen for the covert search study?": [
            "6-cpd"
        ],
        "What does the existence of simple fixed decision rules increase the likelihood of developing in the context of covert search under natural conditions?": [
            "accurate quantitative theories"
        ],
        "What is the prior probability of target absence used in the experiments described in the \"Optimal Bayesian Decision Rule\" section?": [
            "0.5"
        ],
        "What version of MATLAB was used to generate the stimuli in the experiments?": [
            "2023a"
        ],
        "What shape parameter is used in the attentional sensitivity gain map in the model?": [
            "b"
        ]
    },
    "Synthesizing Evolving Symbolic Representations for Autonomous Systems": {
        "What does the symbol ω represent in the Markov Decision Process (MDP) tuple?": [
            "discount factor"
        ],
        "What symbol represents the discount factor in the semi-Markov Decision Process (SMDP) formalism?": [
            "ω"
        ],
        "What logical language is used in classical planning to capture an abstract symbolic description of the world?": [
            "propositional logic, first-order logic"
        ],
        "What type of learning agent framework is presented in section 3 of the paper?": [
            "open-ended"
        ],
        "What datasets collect the visited low-level states data during exploration in the paper section?": [
            "ID and TD"
        ],
        "What module includes the Goal Selector function in the planning process described in section 4 of the paper?": [
            "Long-Term Autonomy (LTA) module"
        ],
        "What variable represents the high-level plan in the Discover-Plan-Act algorithm?": [
            "ωEX"
        ],
        "What algorithm number details the Option Discovery module's procedure?": [
            "2"
        ],
        "What does the function f(s, o) indicate about the option o's execution from state s?": [
            "feasibility"
        ],
        "Which algorithm is used to perform clustering on the final states in the options partition step of the abstraction procedure?": [
            "DBSCAN"
        ],
        "What estimation technique is used to model the effects distribution in PPDDL domain synthesis?": [
            "Kernel density estimation"
        ],
        "What strategy returns starget = NULL during exploration in the Goal Selector module?": [
            "Action Babbling"
        ],
        "What type of classifier is Cltarget in the system described?": [
            "SVM"
        ],
        "What is used to describe the most suitable high-level state representation for s_init, s_g, and s_target in the planning process?": [
            "!ˆ init, ˆ g ! and !ˆ target"
        ],
        "What domain was the implemented system tested in according to section 4.1 of the paper?": [
            "Treasure Game"
        ],
        "How many levers are present in domain5 according to Table 1?": [
            "3"
        ],
        "How many learned options does the agent have after cycle number 10 in the Goal Babbling strategy case?": [
            "11"
        ],
        "How many data entries were collected in the TD dataset during the exploration step in the Treasure Game domain definition?": [
            "6600"
        ],
        "How many moves does the solution ςg take to solve the game problem?": [
            "21"
        ],
        "What action corresponds to task number 14 in the PLAN TASK GOAL section?": [
            "interact"
        ],
        "How many options were executed per episode in domain5 according to the paper?": [
            "800"
        ],
        "How many minimal solution steps are required in domain5?": [
            "31"
        ],
        "What type of motivation is integrated with classical planning in the approach presented in the paper?": [
            "intrinsic motivation"
        ],
        "What does the approach in the paper aim to enhance in agents?": [
            "adaptability, robustness, and creativity"
        ]
    },
    "Ultraviolet Technology To Prepare For The Habitable Worlds Observatory": {
        "What is the wavelength range deemed critical for calculating the EUV inputs into exoplanetary atmospheres?": [
            "102 – 115 nm"
        ],
        "What spectral region contains strong lines of H2 and H2O in the LUMOS T Tauri Star Simulation?": [
            "111.1 – 113.2 nm"
        ],
        "What wavelength range is critical for observing the strongest absorption bands of H2O in protoplanetary disks?": [
            "111 – 113 nm"
        ],
        "What instrument on comet 67P/C-G allowed for the simultaneous measurement of parent molecules and their dissociative products?": [
            "Rosetta Alice FUV instrument"
        ],
        "What suite is the simulated galaxy at z = 0.7 from, as shown in the top row of Figure 4?": [
            "FOGGIE suite"
        ],
        "What is the wavelength of the Lyman Continuum (LyC) edge?": [
            "91.18 nm"
        ],
        "What material is used as a protective overcoat to prevent aluminum oxidization in UV mirror coatings?": [
            "fluoride"
        ],
        "What is the peak wavelength of rest-frame O VI emission lines for which the eLiF mirror coating provides maximum sensitivity?": [
            "103 nm"
        ],
        "What is the H-roughness value for the Al+LiF coating technology?": [
            "Fresh 1.5-2.5 nm"
        ],
        "What was the temperature the mirror was heated to prior to LiF deposition in the initial high-temperature eLiF process at NASA-GSFC?": [
            "&gt;250°C"
        ],
        "What is the expected launch year for the SPRITE CubeSat?": [
            "2024"
        ],
        "At what wavelength is SPRITE specifically optimized for reflectance?": [
            "1050 ˚A"
        ],
        "What is the estimated absolute reflectance error for the XeLiF mirror coatings?": [
            "± 1%"
        ],
        "What material is commonly used as a dielectric coating for protected aluminum in UV-sensitive missions?": [
            "MgF2"
        ],
        "What is the highest temperature at which the MgF2 layer is applied in the \"Ti+Al+MgF2\" sample according to Figure 11?": [
            "225 C"
        ],
        "What is the average calculated coating-induced polarization at AOI=12 in the 200-3000 nm spectral range according to the LUVOIR/HabEx reports?": [
            "0.11%"
        ],
        "What is the gain typically achieved by a stack of 2 or 3 MCPs in MCP-based photodetectors?": [
            " 10^6"
        ],
        "What is the maximum format size for traditional MCPs manufactured using conventional techniques?": [
            "150 mm"
        ],
        "What is the size of the larger format Borosilicate glass MCPs that have been successfully flown?": [
            "200mm"
        ],
        "What factor of reduction in pre-launch and on-orbit backgrounds is expected with ALD borosilicate MCP technology?": [
            "2"
        ],
        "What type of anode is used in the 100 mm XS Detector for the INFUSE (2023) program?": [
            "cross strip conductive patterned anodes"
        ],
        "What is the power consumption of the GRAPH ASIC for a 50mm detector?": [
            "less than 7 W"
        ],
        "What is the QE percentage for silicon detectors at a wavelength of 200 nm with AR-coating?": [
            "70"
        ],
        "What is the Quantum Efficiency (QE) percentage of the front-illuminated silicon detector at 300 nm wavelength?": [
            "60"
        ],
        "What material is used for blocking visible light in the thick layer of the metal dielectric filters discussed in the silicon APD section?": [
            "aluminum"
        ],
        "What type of CCD implements an additional set of pixels for photon counting?": [
            "EMCCD"
        ],
        "What is the typical efficiency percentage of UV high-resolution spectroscopy gratings?": [
            "<40%"
        ],
        "What type of CCD can detect a very faint diffuse gas signal with greater fidelity compared to an EMCCD or MCP?": [
            "Skipper CCD"
        ],
        "What is the peak absolute diffraction efficiency achieved by the Au-coated EBL grating fabricated for the ESCAPE mission concept?": [
            ">75%"
        ],
        "What technique uses \"greyscale\" EBL and thermally activated EBL resist to sculpt blazed facets?": [
            "TASTE"
        ],
        "Which institution developed the Microshutter Arrays used on the JWST Near Infrared Spectrograph?": [
            "GSFC"
        ],
        "What is the insulating layer on the egg-crate frame of Si coated with in the MSA Egg-Crate Detail?": [
            "Al2O3"
        ],
        "What are the dimensions of the JWST MSA format?": [
            "365 x 171"
        ],
        "What material are the shutters in the FORTIS 128x64 NGMSA etched into?": [
            "silicon nitride"
        ],
        "What material was used to micromachine the 26 slices of the INFUSE slicer cube?": [
            "invar and copper"
        ],
        "What component is depicted in the inset of Fig 28 in the INFUSE image slicer concept?": [
            "MCP detector"
        ],
        "What type of gratings did INFUSE replace the pupil mirrors with?": [
            "Type IV holographic gratings"
        ],
        "What frequency of Quartz Crystal Microbalances (QCM) is used to detect contaminant thickness changes of 0.04 nm?": [
            "10 megahertz"
        ],
        "What is the maximum allowable change in reflectance at 121.6 nm according to MSFC-SPEC-1443?": [
            "3%"
        ],
        "How many early-career researchers would make up the STAMP science and instrument teams?": [
            "&gt; 50%"
        ],
        "What is the range of non-volatile molecular cleanliness levels defined by IEST-STD-1246?": [
            "10 ng/0.1m2 to 25 mg/0.1m2"
        ],
        "What law is used to predict the magnitude of optical absorption losses in the \"Molecular Contaminant Effect\" section?": [
            "Lambert’s Law"
        ],
        "What is the density range of most contaminants based on the densities of typical source plastics according to IEST-STD-CC1246E?": [
            "0.8 to 1.2 g/cm3"
        ],
        "What is the maximum allowable NVR mass for a molecular contaminant level of R2E-1 according to Table 2 in the document?": [
            "200 μg"
        ],
        "What is the probability of a molecule venting out the aperture in each desorb-adsorb cycle for a short telescope tube with a length/diameter ratio of 4?": [
            "0.06"
        ],
        "What is the predicted time to deplete a contaminant with a heat of adsorption of 26 kc/mol at 60 °C, according to Fig 36?": [
            "10 to 12 days"
        ]
    },
    "QUBO-based SVM for credit card fraud detection on a real QPU": {
        "How many physical qubits are used to obtain 48 logical qubits in neutral atom devices?": [
            "280"
        ],
        "What class of problems is the Quadratic Unconstrained Binary Optimization (QUBO) associated with?": [
            "NP-hard"
        ],
        "What is the specific type of problem that the QUBO SVM models will be trained to detect in the manuscript?": [
            "CCF"
        ],
        "What Python library is used for ideal and noisy simulations of the QUBO SVM model on classical hardware?": [
            "Pulser"
        ],
        "What is the projected value of worldwide fraud-related losses by 2025 according to the document?": [
            "35 billion dollars"
        ],
        "What is the ratio of \"anomalous\" to \"normal\" transactions in the CCF detection dataset?": [
            "0.17%"
        ],
        "In the neutral atom implementation section, which optimizer is used to make the Hamiltonian H as close as possible to Q?": [
            "COBYLA"
        ],
        "What is the duration of each pulse applied in the quantum register topology on the QPU?": [
            "10 μs"
        ],
        "What type of ensemble technique uses a meta-model in the second layer?": [
            "stacking"
        ],
        "What is the Balanced Accuracy at a noise level of 500% with 5 training samples in the 10-atom simulations?": [
            "0.4"
        ],
        "How many qubits were used in the 8 training samples simulations for the balanced accuracy analysis in Figure 6 subfigure (a)?": [
            "16 qubits"
        ],
        "What type of problem is reformulated for SVM training in the model presented?": [
            "QUBO problem"
        ],
        "What type of quantum computing is used to train the QUBO SVM model?": [
            "analog quantum computing"
        ]
    },
    "GD-1 Stellar Stream and Cocoon in the DESI Early Data Release": {
        "How many new spectroscopically confirmed members of the GD-1 stream were obtained with the Dark Energy Spectroscopic Instrument (DESI)?": [
            "126"
        ],
        "How many robotic positioners does the DESI instrument use?": [
            "5,000"
        ],
        "What is the radial velocity precision of the RVS pipeline mentioned in Valluri et al.'s paper?": [
            "1-10 km/s"
        ],
        "What is the upper limit of the color-magnitude cut for Gaia-DR3 stars in the GD-1 region as defined in Figure 2?": [
            "0.4"
        ],
        "How many knots are used to represent the velocity dispersion of the stream in the mixture model?": [
            "4"
        ],
        "What is the kernel band width for SDSS+LAMOST in Figure 4(b)?": [
            "7.25 km s-1"
        ],
        "What is the median metallicity of the entire DESI GD-1 sample as measured by the RVS pipeline?": [
            "-2.49±0.16"
        ],
        "What color histogram in Figure 6 represents stars in the GD-1 stream with an additional velocity constraint?": [
            "Black"
        ],
        "What package is used for direct maximization of the likelihood in the Multi-Gaussian Analysis of the cocoon?": [
            "scipy.optimize"
        ],
        "What is the FWHM of the \"thin stream\" component in ε2 at the distance of 9 kpc according to Figure 8?": [
            "55 pc"
        ],
        "What is the bivariate analysis result for εω2 [deg] in the Cocoon parameter?": [
            "→0.165 ± 0.154"
        ],
        "What fraction (Q) is given for the stars in the 'thin stream' component as determined by the joint modeling of ϖε2 and ϖVGSR?": [
            "0.6"
        ],
        "What is the estimated background fraction in the cocoon component according to Section 4.3 of the paper?": [
            "12%"
        ],
        "According to Cooper et al. (2023), by how much were the mean metallicities measured with DESI systematically lower compared to literature values?": [
            "0.2 to 0.4 dex"
        ],
        "According to Malhan et al. (2020), what velocity dispersion would imply that GD-1's parent dwarf galaxy had a cored dark matter halo?": [
            "~5 km s-1"
        ],
        "According to Zaritsky & Behroozi 2023, what is the estimated halo mass of GD-1's parent dwarf galaxy?": [
            "~2 x 10^9 M☉"
        ],
        "What is the velocity precision of the VLT/UVES spectrograph data used by Ibata et al. (2023)?": [
            "1 km s-1"
        ],
        "What is the faintest magnitude of GD-1 members confirmed from the first year of the DESI main program?": [
            "21"
        ],
        "What constant value have the VGSR measurements been corrected by in the DESI-EDR measurements for the GD-1 area?": [
            "0.93 km s-1"
        ],
        "What color curve represents the adopted distance gradient model in Figure 13 of the paper?": [
            "red"
        ],
        "What is the VGSR measurement error for TARGET-ID 39633374 in the DESI-EDR observations?": [
            "1.91"
        ]
    },
    "Evaporation of water-in-oil microemulsion droplet": {
        "What is the resistivity of the water used in the microemulsion studies?": [
            "18.2 MΩ-cm"
        ],
        "What is the diameter of the water sub-droplet for water-in-decane microemulsions at ω = 10 and ε = 0.1?": [
            "6.2 nm"
        ],
        "What shape are the water sub-droplets dispersed in xylene at ω = 10 and ε = 0.1 as observed in Figure 1(b)?": [
            "spherical"
        ],
        "What is the frequency of the single-axis acoustic levitator used in the experimental setup?": [
            "100 kHz"
        ],
        "What is the final diameter ratio of a pure liquid droplet after near-complete evaporation in Stage II?": [
            "0.1 ± 0.05"
        ],
        "What phase is characterized by a continuous rise in the droplet's temperature during the evaporation process?": [
            "pre-heating"
        ],
        "What is the laser irradiation intensity used in Figure 5d for different oil phases?": [
            "0.05"
        ],
        "What is the nature of the surfactant AOT during Stage II of evaporation for a microemulsion droplet?": [
            "non-volatile"
        ],
        "What is used to calculate the slope of the square of droplet diameter vs the time curve in the steady evaporation phase?": [
            "Python code"
        ],
        "What parameter is defined as the ratio of volume fraction of volatile to non-volatile components of the microemulsion droplet?": [
            "ϑ"
        ],
        "What property is compared for different base oils at I↓ = 0.1 in figure 9(a) and (c)?": [
            "evaporation rate"
        ],
        "Which base oil exhibits the highest evaporation time according to Figure 8(d)?": [
            "dodecane"
        ],
        "What factor leads to the larger shell size in xylene microemulsions compared to other microemulsions?": [
            "high vapor pressure"
        ],
        "Which microemulsion demonstrated a larger shell size in the study?": [
            "xylene microemulsion"
        ]
    },
    "Cognitive Hierarchy in Day-to-day Network Flow Dynamics": {
        "Whose principle characterizes a steady-state User Equilibrium in the context of traffic networks?": [
            "Wardrop's"
        ],
        "What type of dynamic is used to calibrate the virtual experiment mentioned in Ye et al. (2018)?": [
            "CH-NTP dynamic"
        ],
        "What coefficient in the flow update rules reflects travelers' inertia or reluctance to change?": [
            "𝛼"
        ],
        "According to CH theory, what do 1-step travelers assume the normalized proportion of 0-step travelers to be?": [
            "𝑝0 = 1"
        ],
        "What is the average thinking step across all players in behavioral game theory according to Camerer et al., 2004?": [
            "1 and 2"
        ],
        "What theory from cognitive psychology does the modeling framework align with in the context of transportation?": [
            "theory of mind"
        ],
        "What dynamic admits DUE as a fixed point according to section 3 of the paper?": [
            "NTP dynamic"
        ],
        "What year did Facchinei and Pang introduce Lemma 1?": [
            "2007"
        ],
        "What must a vector 𝒙♢ satisfy to be considered an MPE according to Proposition 1 in the paper?": [
            "VI"
        ],
        "According to the section, whose theorem guarantees the existence of at least one fixed point to the dynamical system (9)-(12)?": [
            "Brouwer’s"
        ],
        "How many classes are represented in the |𝐾|-class DUE in Proposition 2?": [
            "3"
        ],
        "What are the predicted flow patterns of all three classes at DUE represented by in the given section?": [
            "˜𝒙∗"
        ],
        "What property does each block element 𝑄𝑤[𝒛𝑤] exhibit according to Lemma 2?": [
            "PSD"
        ],
        "What is the size of the block matrix used as the Jacobian matrix for the CH-NTP dynamic when |𝐾| equals 3?": [
            "3-by-3"
        ],
        "What matrix represents the identity matrix in the block 𝐽𝑃𝑖,𝑗 definition?": [
            "𝐼"
        ],
        "What color points in Figure 3 represent the shortest route on day 𝑡 − 1?": [
            "green"
        ],
        "What dynamic is the 0-step model exactly called in the CH-NTP calibration section?": [
            "XYY dynamics"
        ],
        "What is the maximum value of gamma (𝛾) used in the grid search for calibration in section 4.2.1 of the paper?": [
            "1.0"
        ],
        "What is the optimal value of 𝛾 for the nonhierarchical model with |𝐾| = 1 across all values of 𝑀?": [
            "0.358"
        ],
        "What value of γ is associated with the large evolution trajectories in Figure 5a?": [
            "1.4"
        ],
        "What is the initial value of 𝑝0 set for all routes in the experiments mentioned in section 5.2.1?": [
            "0.4"
        ],
        "What value of gamma bar is marked as the stability threshold in Figure 8γ?": [
            "0.79"
        ],
        "What is the value of α in the test for stability on the boundary of the feasible route flow set?": [
            "0.5"
        ],
        "What is the value of ˆγ for route 3 at Step-0?": [
            "0.82"
        ],
        "What term is used to describe fixed points of the CH-Logit dynamic (25)-(28)?": [
            "MPSE"
        ],
        "What guarantees the existence of a fixed point in the dynamical system described in Proposition 5?": [
            "continuities"
        ],
        "What type of matrix is the Jacobian matrix of the Logit operator parameterized by 𝜃 at a cost vector 𝒄?": [
            "block diagonal"
        ],
        "In the stability analysis of the CH-Logit dynamic, what is the resolution used for enumerating combinations of 𝑝0 and 𝑝1?": [
            "0.001"
        ],
        "What is the lower bound of the range for alpha-hat (ˆ𝛼) as shown in Figure 13 when |K| changes from 1 to 2?": [
            "3 − 2√2"
        ],
        "What parameter value leads to different equilibria under the CH-NTP dynamic according to the initial conditions?": [
            "large 𝛾"
        ]
    },
    "A Radio Technosignature Search of TRAPPIST-1 with the Allen Telescope Array": {
        "What spectral type is the star TRAPPIST-1?": [
            "M-dwarf"
        ],
        "What is the temperature to which the new \"Antonio\" feeds at the ATA are cryogenically-cooled?": [
            "70 K"
        ],
        "What was the total data volume recorded from the TRAPPIST-1 system observations using the Allen Telescope Array in Fall 2022?": [
            "65 TB"
        ],
        "What is the minimum SNR value for identifying signals in the TRAPPIST-1 data using turboSETI?": [
            "10"
        ],
        "What is the maximum drift rate determined for a surface transmitter in the TRAPPIST-1 system according to Li et al. (2023)?": [
            "15 nHz"
        ],
        "How many iterations were needed at the lowest frequency during the TRAPPIST-1 search?": [
            "8"
        ],
        "What is the minimum attenuation factor between the on- and off-beam determined from tests on X-band downlinks from orbiters around Mars?": [
            "4"
        ],
        "What algorithm was used to test the effectiveness of scoring signals in the Injection Recovery section?": [
            "DOT"
        ],
        "What is the correlation score of the signal detected in the target panel of Figure 4?": [
            "0.276"
        ],
        "What parameter is used along with DOT score to measure attenuation between beams as shown in Figure 6 of the paper?": [
            "SNR-ratio"
        ],
        "What orbiter's signal is displayed in the top panel of Figure 7?": [
            "Emirates Hope orbiter"
        ],
        "What is the diameter of the transmitter dish assumed for the TRAPPIST-1 system in the paper?": [
            "3.4 m"
        ],
        "In the illustration from Figure 8, what is the name of the planet where the transmitter is located?": [
            "planet b"
        ],
        "What frequency was used for the beam during the observation on Oct 29, 2022, as shown in Figure 10?": [
            "3.3 GHz"
        ],
        "On what date did the representative still frame capture the PPO event of TRAPPIST-1?": [
            "October 29, 2022"
        ],
        "What color represents signals above the conservative cutoff in Figure 11 of the paper?": [
            "black"
        ],
        "On what date was the 10-minute integration displaying a \"blip\" result observed in the study?": [
            "Nov 05, 2022"
        ],
        "What duration was used for each calibrator scan during the observing sessions in the ATA search of TRAPPIST-1?": [
            "10 min"
        ],
        "What percentage of the total observation duration did PPO events comprise in the TRAPPIST-1 experiment?": [
            "21%"
        ],
        "What constant separation in arcminutes was used for the off-beam from the phase center in this project's beam-localization procedure?": [
            "9 arcminutes"
        ],
        "What is the typical operating power of the DSN's directed transmission?": [
            "tens of kiloWatts"
        ]
    },
    "Massively parallel CMA-ES with increasing population": {
        "What type of optimization problems does the paper address?": [
            "blackbox continuous optimization problems"
        ],
        "What is the specific variant of CMA-ES that employs an increasing population size?": [
            "IPOP-CMA-ES"
        ],
        "What routines are used to accelerate the CMA-ES linear algebra operations according to the paper?": [
            "BLAS and LAPACK"
        ],
        "What shape is the covariance matrix C in the CMA-ES algorithm?": [
            "n × n"
        ],
        "What is the multiplicative factor used in IPOP-CMA-ES to increase the population size?": [
            "2"
        ],
        "What programming model is used for inter-process communications in the deployment of IPOP-CMA-ES on large-scale parallel architectures?": [
            "MPI"
        ],
        "What variable is multiplied by the rank of the MPI process to ensure a distinct random generator seed in each CMA-ES descent?": [
            "current time"
        ],
        "On which supercomputer was the performance analysis of the parallel strategies conducted?": [
            "Fugaku"
        ],
        "How many continuous functions does the BBOB test suite provide?": [
            "24"
        ],
        "How many compute cores does each A64FX CPU in the Fugaku supercomputer have?": [
            "48"
        ],
        "What is the maximum performance gain achieved using Level 3 BLAS for the adaptation of the C covariance matrix according to the upper-right part of Figure 5?": [
            "190x"
        ],
        "What is the optimal number of threads for running BLAS/LAPACK in dimension 1000 according to the paper?": [
            "12 threads"
        ],
        "What profiler is used to measure MPI communication shares in Figure 6 of the paper?": [
            "FIPP"
        ],
        "What is used to measure the quality of a solution in the algorithms discussed in the \"Solution Quality\" section?": [
            "difference ε"
        ],
        "What is the minimum speedup achieved by K-Replicated for a dimension of 200?": [
            "0.1"
        ],
        "What is the maximum speedup achieved by K-Distributed over K-Replicated for function 7?": [
            "508×"
        ],
        "At what granularity does the gap between K-Distributed and K-Replicated increase for ECD values greater than 0.4?": [
            "1ms"
        ],
        "For which function number does the K-Distributed run with a population size of 24 first reach a log2K value of 5.7?": [
            "4"
        ],
        "What dimension is used for the speedup analysis of K-Distributed over sequential IPOP-CMA-ES in Figure 10?": [
            "40"
        ]
    },
    "Separation of Sodium Signals Between Mono- and Bi-Exponential T2 Decays via Multi-TE Single-Quantum Sodium (23Na) MRI": {
        "What type of imaging technique is generalized to multi-TE single-quantum (MSQ) imaging in the study?": [
            "short-T2 imaging"
        ],
        "What algorithm is used to fit the FID signal in the measurement of T2* values?": [
            "NNLS algorithm"
        ],
        "What is the minimum signal-to-noise ratio (SNR) required for singular value decomposition (SVD) analysis to be applicable to X elements in Eq. 6c?": [
            "≥ 2"
        ],
        "What type of filtering is optional in the MSQ technique to reduce noise on the bi-T2 sodium?": [
            "low-pass (LP) filtering"
        ],
        "How many TEs were used in the ideal case simulation according to Eq. 6?": [
            "80 TEs"
        ],
        "What function in MATLAB was used for sodium signal separation in the Tomyutev Simulations?": [
            "lsunonneg"
        ],
        "What MRI scanner model was used in the human studies at NYU Grossman School of Medicine?": [
            "Prisma"
        ],
        "What factor is applied to noise standard deviation in the SNR calculation for magnitude images?": [
            "0.655"
        ],
        "What was the age of the healthy subject represented in Figure 2 of the paper?": [
            "52 years old"
        ],
        "What is the typical value of Tfr used in Fig. 4a for the free sodium?": [
            "50ms"
        ],
        "What parameter consistently decreased with increasing SNR in the Phantom Simulations of the study?": [
            "SD"
        ],
        "What is the age of the epilepsy patient whose T2* spectra is presented in Figure 7c?": [
            "31 years old"
        ],
        "What is the P-value for the difference in volume fraction between gray and white matters in the healthy group according to Figure 10?": [
            "0.023"
        ],
        "What figure in the paper illustrates the underestimate of bi-T2 sodium signal caused by the TE1 image?": [
            "Fig. 6c3"
        ]
    },
    "Chiral patterning of rough surfaces with vortex laser beams_ from structured polarization to twisted forces": {
        "What type of angular momentum is associated with circular polarization of light?": [
            "spin angular momentum"
        ],
        "What method is used to solve the system of Maxwell equations in the study?": [
            "FDTD method"
        ],
        "What is the assumed correlation length ξ used in the simulations described in the paper?": [
            "100 nm"
        ],
        "What device is used to generate laser pulses with inhomogeneous polarization distribution according to the section \"B. Inhomogeneous polarization distribution\"?": [
            "q-plates"
        ],
        "What is the maximum difference in total absorbed energy Qtot between the laser pulses with radial, spiral, and azimuthal polarization according to the simulations?": [
            "0.5%"
        ],
        "What is the topological charge of the laser pulse carrying OAM as mentioned in Figure 4?": [
            "+1"
        ],
        "What is the topological charge of the OAM laser pulses tested up to in the simulations?": [
            "±10"
        ],
        "What is the numerical aperture (NA) corresponding to a convergence angle of δ = 20°?": [
            "0.34"
        ],
        "What is the sign of the topological charge ℓ used to reverse the twisting direction of nanoscale twisted needles?": [
            "negative"
        ],
        "What variable represents the material susceptibility in the expression for polarization ⃗P?": [
            "χ"
        ],
        "What shape of beam is associated with linear polarization in the discussed section of the paper?": [
            "Gaussian"
        ],
        "What is the periodicity of the transverse optical force for linearly polarized laser pulses with Gaussian and Laguerre-Gaussian beam shapes?": [
            "T/2"
        ],
        "What type of polarization is used in the laser pulses for configuration (i) in the Laguerre-Gaussian beam shape?": [
            "linearly polarized"
        ],
        "How many distinct lobes does the force distribution have for a circularly polarized laser pulse with a co-rotating polarization and wavefront as depicted in Fig. 10(b)?": [
            "four"
        ],
        "What is the convergence angle δ used to model the very smooth focusing of OAM laser pulses?": [
            "1°"
        ],
        "What is the intensity value at the coordinate (0,0) for circular polarization with ℓ = +1?": [
            "0.8"
        ]
    },
    "Law-based and standards-oriented approach for privacy impact assessment in medical devices_ a topic for lawyers, engineers and healthcare practitioners in MedTech": {
        "What article of the European Convention on Human Rights is the right to privacy enshrined in?": [
            "Article 8"
        ],
        "Which article of the GDPR mandates DPIAs for high-risk data processing activities?": [
            "Article 35"
        ],
        "What is the year of publication for ISO/IEC 27001?": [
            "2022"
        ],
        "What article of GDPR requires that data protection be assured by default and by design?": [
            "Article 25"
        ],
        "What standard was updated to ISO/IEC 29134:2023?": [
            "ISO/IEC 29134:2017"
        ],
        "Which ISO standard outlines the necessary components for describing data processing activities?": [
            "ISO/IEC 29134:2023"
        ],
        "Which ISO standard guides on implementing data minimization and purpose limitation in the context of GDPR articles 5, 6 and 35?": [
            "ISO/IEC 27701:2019"
        ],
        "What ISO/IEC standard offers specific guidelines on risk mitigation strategies for data protection impact assessments?": [
            "29134:2023"
        ],
        "Which standard provides specific controls for protecting PII in medical devices?": [
            "ISO/IEC 29151:2017"
        ],
        "Which ISO standard extends the ISO/IEC 27001 and 27002 standards to include privacy-specific controls?": [
            "ISO/IEC 27701"
        ],
        "What type of law convergence is described as essential for effective data protection in digital health technologies?": [
            "hard and soft law"
        ],
        "Which standards are integrated to establish a comprehensive framework for DPIAs in the realm of medical devices?": [
            "GDPR, MDR, ISO/IEC standards"
        ]
    },
    "Agglomerative Token Clustering": {
        "What linkage function is used in the Agglomerative Token Clustering (ATC) method as shown in Figure 1 of the Introduction?": [
            "Dcomplete"
        ],
        "What method is proposed in the paper for hierarchical merging-based token reduction?": [
            "Agglomerative Token Clustering"
        ],
        "Which clustering method was introduced as a modification to the ToMe method in the paper?": [
            "agglomerative clustering"
        ],
        "What algorithm is used for token merging in the ATC method within a ViT block?": [
            "agglomerative clustering algorithm"
        ],
        "What distance metric is used for Agglomerative Token Clustering in the paper?": [
            "cosine distance"
        ],
        "Which image generation model is incorporated with the token reduction method in the experiments?": [
            "Stable Diffusion"
        ],
        "What metric is used to evaluate the performance on the ImageNet-1K dataset in the study?": [
            "Top-1 Acc %"
        ],
        "What is the hyperparameter 't' value for the ViT-Huge model when applying the most aggressive token reduction settings?": [
            "7"
        ],
        "What resolution of images were generated for each class in the ImageNet-1K dataset using the modified ToMe algorithm?": [
            "512 × 512"
        ],
        "What is the minimum FID score achieved by the ToMe model according to the section?": [
            "33.57"
        ],
        "What dataset did Liu et al. use for their systematic comparison of token pruning methods?": [
            "COCO 2017"
        ],
        "Which linkage function often underperforms with more aggressive keep rates in ATC?": [
            "single"
        ],
        "What method sets a new state-of-the-art across diverse tasks such as classification, synthesis, detection, and segmentation according to the paper?": [
            "ATC"
        ]
    },
    "Who's the GOAT? Sports Rankings and Data-Driven Random Walks on the Symmetric Group": {
        "How many major titles does Serena Williams hold according to the introduction?": [
            "23"
        ],
        "According to the notes in Section 4.2 of the paper, who is considered better than Ivan Lendl?": [
            "All"
        ],
        "Which algorithm did Radicchi use to address the question of the GOAT in men's professional tennis?": [
            "network diffusion algorithm"
        ],
        "According to Bayer and Diaconis, how many riffle shuffles are necessary for a standard deck of 52 cards to start becoming well-mixed?": [
            "6"
        ],
        "What is the notation used to denote the symmetric group of degree n?": [
            "Sn"
        ],
        "What is the one-line notation of the permutation ε?": [
            "54123"
        ],
        "How many adjacent transpositions are at most needed to represent every element ε in Sn, according to Fact 2.5?": [
            "n(n-1)/2"
        ],
        "What property characterizes the sequence of random variables in a discrete-time Markov chain according to Levin and Peres?": [
            "Markov property"
        ],
        "What is the term used to describe the unique probability distribution μ for an irreducible finite Markov chain?": [
            "stationary distribution"
        ],
        "What is the unique minimal element in the Hasse diagrams of the posets on the symmetric group of order 4 mentioned in the paper?": [
            "1234"
        ],
        "What is the highest number of players involved in the rankings cutoffs used in the experimental part of the study?": [
            "20"
        ],
        "What is added to each entry of the matrix W to obtain an irreducible random walk?": [
            "1"
        ],
        "What type of graph is the support graph of P as implied by the additive 1 term in the provided section?": [
            "bi-directed Bruhat graph"
        ],
        "What symbol represents the stationary distribution of P in Section 3.3 of the paper?": [
            "μ"
        ],
        "What software is used to sample 100,000 linear extensions in the numerical implementation?": [
            "SageMath"
        ],
        "Whose historical rankings data does Sackmann note as intermittent from 1973 to 1984 and missing for 1982?": [
            "ATP"
        ],
        "Who is no longer a maximal element as a top 5 player according to Figure 3?": [
            "Sampras"
        ],
        "In the Hasse diagram of the top 10 players, which player is positioned as being better than Connors?": [
            "Djokovic"
        ],
        "Which two players remain incomparable maximal elements in the Hasse diagram of the top 20 players in Figure 5?": [
            "Federer and Nadal"
        ],
        "In the Hasse diagram of the poset over \"top 5 players,\" which player is conclusively better than Aryna Sabalenka?": [
            "Clijsters and Sharapova"
        ],
        "Which player mentioned in Figure 7 had a brief comeback between 2020 and 2022?": [
            "Kim Clijsters"
        ],
        "In the Hasse diagram of the poset over \"top 10 players,\" which player is conclusively better than Monica Seles?": [
            "Martina Navratilova"
        ],
        "Which player is listed first in the average rank of players table from Section 4.4 of the paper?": [
            "Chris Evert"
        ],
        "What is the coefficient of determination (r²) for the correlation between being a top 20 player and being a top 3 player in the WTA?": [
            "0.05"
        ],
        "Which mathematical concept did the paper adopt to aggregate historical ranking data into a single poset over top players?": [
            "stochastic dominance"
        ]
    },
    "Performance of Quantum Approximate Optimization with Quantum Error Detection": {
        "What is the name of the trapped-ion quantum computer used in the experiments with the Iceberg code?": [
            "H2-1"
        ],
        "How many physical qubits are used to encode a k-qubit circuit using the Iceberg code?": [
            "k + 2"
        ],
        "What optimization problem is specifically focused on in the paper using the Iceberg code model?": [
            "MaxCut"
        ],
        "What graph type was used for the QAOA MaxCut problem on the Quantinuum H2-1 quantum computer?": [
            "3-regular graph"
        ],
        "How many logical qubits are in the range used to generate the dataset for the Quantinuum H2-1 quantum computer emulator?": [
            "8, 26"
        ],
        "What is the minimum logical fidelity a noisy QAOA must achieve to outperform the GW algorithm according to the white noise model approximation?": [
            "0.974"
        ],
        "Which model's prediction of logical fidelity is less accurate on random Erdős–Rényi graphs compared to 3-regular graphs?": [
            "Iceberg"
        ],
        "What is the error rate symbol for the noise channel that introduces a random error commuting with both stabilizers in the Iceberg code?": [
            "p_c"
        ],
        "What parameter represents the error rate for unencoded circuits in the Iceberg code model?": [
            "p ϑ"
        ],
        "How many possible excitation events are there in the syndrome measurement block according to the simplification in the Iceberg code model?": [
            "16"
        ],
        "Which qubit in the final measurement block can only be excited by internal errors?": [
            "flag qubit"
        ],
        "What type of noise channel is considered in the circuit noise model mentioned in the section \"C. Approximation ratio and logical fidelity\"?": [
            "global white noise channel"
        ],
        "What method is used as a loss function to minimize the residual between model logical fidelity and experimental ratios in the unencoded circuits?": [
            "least squares"
        ]
    },
    "Multi-Sensor Deep Learning for Glacier Mapping": {
        "What is the minimum area of glaciers listed in the RGI 7.0?": [
            "0.01 km2"
        ],
        "What was the annual area change rate for glaciers in the European Alps from 2003 to 2015 according to Paul et al. (2020)?": [
            "-1.2%"
        ],
        "What method is referred to as the geodetic method for estimating glacier Mass Balance according to Berthier et al., 2023?": [
            "DEMs differencing"
        ],
        "Which method was historically used for glacier mapping that involved thresholding band ratios like Red/SWIR?": [
            "semi-automatic methods"
        ],
        "According to Peng et al. (2023) and Maslov et al. (2024), what type of data is most commonly used for glacier mapping?": [
            "Optical data"
        ],
        "What is the spatial resolution of the VHR optical data mentioned in the paper?": [
            "25 cm"
        ],
        "What imagery source provides the VHR aerial image used for the spatial resolution comparison in Figure 2?": [
            "swisstopo"
        ],
        "What dataset provides the sub-meter resolution DEM of the Rottalgletscher glacier?": [
            "swissALTI 3D DEM"
        ],
        "What country is the Glatscher da Sut Fuina glacier located in?": [
            "Switzerland"
        ],
        "What dataset did Xie et al. (2021) use for the ablation areas in their study on the central Karakoram region?": [
            "GAMDAM"
        ],
        "What classifier is used to address disagreements at the glacier termini in GlacierNet2?": [
            "KNN classifier"
        ],
        "Which architecture did Chu et al. (2022b) use as the backbone for their DeepLabv3+ model?": [
            "ResNet-34"
        ],
        "How many classes does the five-layer CNN distinguish among in the current research on glacier mapping?": [
            "seven classes"
        ],
        "What architecture is the GlaViTU model from Maslov et al. (2023) based on?": [
            "SETR & U-Net"
        ],
        "What model was trained to obtain the annual retreat rate of glaciers?": [
            "U-Net"
        ],
        "What catchments were the focus of the study by Robson et al. (2020)?": [
            "La Laguna and Poiqu"
        ],
        "What is the region of interest (ROI) for the rock glaciers inventory built by Sun et al. (2024)?": [
            "HMA: Tibetan Plateau"
        ],
        "What type of imagery did Zhang et al. (2019a) use from the TerraSAR-X mission for calving front detection?": [
            "SAR data"
        ],
        "What type of imagery is pre-processed into three channels for the CALFIN dataset?": [
            "near-infrared band"
        ],
        "Which model did Heidler et al. (2022) take inspiration from for the HED-UNet's edge detection component?": [
            "HED edge detector"
        ],
        "What layer is augmented to the U-Net model in Gourmelon et al. (2022)?": [
            "atrous spatial pyramid pooling layer"
        ],
        "What dataset is the HookFormer model trained on?": [
            "CaFFe dataset"
        ],
        "Which two data modalities are usually combined for glacier extent mapping according to the Discussion section?": [
            "optical and a DEM"
        ],
        "What type of neural network architecture is employed in the Instructed Glacier Model (IGM)?": [
            "convolutional"
        ],
        "Which section of the paper discusses DL-based methods for glacier evolution modelling?": [
            "5.2"
        ],
        "How many major sub-fields in glacier mapping are discussed in this work?": [
            "two"
        ]
    },
    "Secure Control Systems for Autonomous Quadrotors against Cyber-Attacks": {
        "What platform recorded a 225% increase in malicious attacks on autonomous systems?": [
            "Upstream"
        ],
        "What is the purpose of the nominal controller developed in the paper?": [
            "flying and stabilising"
        ],
        "Which university deployed the Agilicious quadrotor in 2023?": [
            "University of Zurich"
        ],
        "What type of aircraft is described in Section 2.1 of the paper?": [
            "quadrotor"
        ],
        "What type of Euler angles are used to describe the orientation in the provided section?": [
            "ZYX Euler angles"
        ],
        "What matrix is used to relate angular velocities in the body frame to those in the inertial frame for a quadrotor?": [
            "T"
        ],
        "How many flat outputs were selected for the quadrotor's differential flatness proof?": [
            "four"
        ],
        "What method is used to execute false data injections in the study discussed in section 2.2 of the paper?": [
            "man-in-the-middle approach"
        ],
        "What is the symbol for the discount factor in Markov decision processes?": [
            "γ"
        ],
        "What algorithm is widely used in quadrotor control due to its fast implementation and improved training stability?": [
            "Proximal Policy Optimization"
        ],
        "What coefficients balance the importance of the critic's accuracy and the policy's exploration capabilities in the PPO algorithm?": [
            "c1 and c2"
        ],
        "What value of epsilon is recommended by paper [26] to limit the variation of the ratio function in the current policy?": [
            "0.2"
        ],
        "What loss function is used for learning the value-function term in the PPO algorithm?": [
            "mean square error loss"
        ],
        "What optimizer is used for the proximal policy optimization algorithm in Algorithm 1?": [
            "Adam"
        ],
        "Which type of attack did [35] demonstrate could capture and control a UAV?": [
            "GPS spoofing"
        ],
        "What operating system is supported by Agilicious's software stack?": [
            "ROS"
        ],
        "What is the maximum speed of the DJI drone as listed in Figure 3.2?": [
            "140km/h"
        ],
        "What model of the Compute Unit is directly embedded onto the Carrier Board for the high-level controller?": [
            "Nvidia Xavier NX"
        ],
        "What type of connector is used to connect the Flight Controller to the ESC?": [
            "8-pin connector"
        ],
        "What is the weight of the Nvidia Jetson Xavier NX compute unit used in the quadrotor?": [
            "80 g"
        ],
        "What is the shape of the marker arrangement on the Crazyflie quadrotor for efficient orientation tracking according to Figure 3.4?": [
            "asymmetrical"
        ],
        "How many different pipelines did the researchers experiment on in their work?": [
            "two"
        ],
        "What type of filter is used as the feed-through estimator in the Estimator module?": [
            "Extended Kalman Filter"
        ],
        "Which protocol does the bridge provided by Agilicious use to communicate?": [
            "SBUS"
        ],
        "What type of battery is used to power the Crazyflie?": [
            "LiPO battery"
        ],
        "Which simulator was modified to create the custom environment for Agilicious quadrotor research?": [
            "PyFlyt"
        ],
        "What type of battery is used in the Crazyflie quadrotor?": [
            "LiPo battery"
        ],
        "What language is PyBullet's simulation built in?": [
            "C++"
        ],
        "What shape is the quadrotor used in the study described in Section 4.1 of the paper?": [
            "X-shaped"
        ],
        "In which subsection is the kinematic model of the quadrotor described?": [
            "2.1.3"
        ],
        "What type of controller is used for the autonomous quadrotor in section 4.2?": [
            "reinforcement learning"
        ],
        "What is the upper limit of the action space velocity vector v in the quadrotor environment?": [
            "3.5"
        ],
        "Which algorithm is chosen to solve the optimal false data injection attack problem in section 4.3?": [
            "proximal policy optimization"
        ],
        "How many parallel actors are involved in the training framework for the agents?": [
            "N = 5"
        ],
        "How many epochs are set for the hyperparameter tuning in the described agents?": [
            "10"
        ],
        "What value of the discount factor γ was discarded in the training of the nominal controller?": [
            "0.85"
        ],
        "What is the learning rate that balances fast convergence and stability according to Subfigure 5.2c?": [
            "3 ⇓ 10→4"
        ],
        "What is the learning rate (α) chosen for the nominal controller as stated in the section?": [
            "0.0003"
        ],
        "What is the highest batch size compared for attacker models in Figure 5.4?": [
            "M = 256"
        ],
        "What value of T showed better performance in Subfigure 5.4a?": [
            "5120"
        ],
        "What is the final learning rate (α) selected for the attack controller's hyperparameters?": [
            "0.0001"
        ],
        "What is the discount factor (γ) used for the Defence controller?": [
            "0.99"
        ],
        "What type of controller is designed in Algorithm 2 for tracking control of a quadrotor?": [
            "nominal controller"
        ],
        "How many times is each experiment run to average the Euclidean distances in Figure 5.9?": [
            "twenty times"
        ],
        "At what time do attacks start during each episode of the quadrotor simulation?": [
            "2s"
        ],
        "What is the maximum duration for each experiment shown in Figure 5.13?": [
            "ten seconds"
        ],
        "What type of model did the researchers use for control when deploying learning-based controllers on Agilicious?": [
            "MPC"
        ],
        "What is the maximum duration of an experiment with the Agilicious quadrotor as stated in Figure 5.16?": [
            "fourteen seconds"
        ],
        "What type of quadrotor is deployed with learning-based controllers in real life as mentioned in section 5.3.2?": [
            "Crazyflie"
        ],
        "What algorithm was designed to provide secure countermeasures for the quadrotor?": [
            "Algorithm 4"
        ],
        "What is the name of the state-of-the-art quadrotor platform used in the experiments?": [
            "Agilicious"
        ],
        "What specific type of quadrotor was mentioned as having deployment limitations in section 6.1 of the paper?": [
            "Agilicious quadrotor"
        ],
        "What type of learning was applied to the security problem of underactuated nonlinear complex systems in the study?": [
            "deep reinforcement learning"
        ]
    },
    "The long-term human capital and health impacts of a pollution reduction programme": {
        "What type of data does the paper utilize to investigate the long-term impact of Smoke Control Areas on individuals' health and human capital?": [
            "UK Biobank data"
        ],
        "Which event did Bharadwaj et al., 2016; Ball, 2018; von Hinke and others use to study the causal impacts of early-life pollution exposure?": [
            "1952 London smog"
        ],
        "What type of emissions were substantially and persistently reduced by the introduction of Smoke Control Areas according to the findings?": [
            "black smoke emissions"
        ],
        "What type of matter did the introduction of SCAs primarily reduce?": [
            "particulate matter"
        ],
        "How many sibling pairs are contained in the analysis sample according to the section of the paper?": [
            "160"
        ],
        "What chart was used to determine the shade of smoke under the Clean Air Act of 1956?": [
            "Ringelmann Chart"
        ],
        "What was the initial fine for violating a smoke control order under the UK law?": [
            "ten pounds"
        ],
        "What percentage of the costs for appliance conversions to comply with a smoke control order were reimbursed by the local council?": [
            "70%"
        ],
        "How many smoke control areas were introduced in England by 1973 according to Baker et al., 2024b?": [
            "over 4,000"
        ],
        "How many County Boroughs were dropped from the study due to significant boundary changes?": [
            "15"
        ],
        "What grid resolution do the ERA5 reanalysis data have for weather measurements?": [
            "25km"
        ],
        "How many station-year-month observations for sulphur dioxide remained after applying data restrictions?": [
            "34,951"
        ],
        "What substance showed a larger decrease at treated stations compared to controls according to Figure 2 in the paper?": [
            "black smoke"
        ],
        "What type of regression is used to show long-term trends in the historical pollution measurements?": [
            "LOESS"
        ],
        "What is the minimum school leaving age reform year that led to the exclusion of individuals born before September 1957 from the study?": [
            "1957"
        ],
        "What is the unit of interest in the second part of the analysis regarding the impact of smoke control areas?": [
            "individual"
        ],
        "What is the focus date for the study of smoke control areas (SCAs) as mentioned in the section?": [
            "submission date"
        ],
        "What socioeconomic status did residents in areas under smoke control generally have compared to those in control areas?": [
            "higher socio-economic status"
        ],
        "What model is used to estimate the impact of SCAs on local pollution levels?": [
            "two-way fixed effects model"
        ],
        "What type of effects control for spatial variation in the outcomes of interest in the individual-level analysis of SCAs' impact?": [
            "CB ↔ Inside fixed effects"
        ],
        "What does the dummy variable Adjijt indicate when equal to one in the static difference-in-difference specification?": [
            "adjustment period"
        ],
        "How much did black smoke levels drop immediately after the submission of an SCA?": [
            "10 mcg/m3"
        ],
        "By how much did black smoke concentrations drop on average after the submission of SCAs according to Column 1 in Table 2?": [
            "8.053"
        ],
        "What is the control group composed of in the OLS event estimates studying the impact of smoke control on individuals?": [
            "never-treated individuals"
        ],
        "How much higher are the birth weights of individuals conceived when the SCA is in operation compared to those conceived prior to SCA submission?": [
            "60g"
        ],
        "How many observations were made for adult height in Table 3?": [
            "11,922"
        ],
        "How many grams did male birth weights increase on average after the introduction of SCAs?": [
            "126 grams"
        ],
        "What is the dependent variable corresponding to column (4) in Table 5?": [
            "Fluid intelligence"
        ],
        "What is the unit of measurement for adult height in Table 6?": [
            "centimeters"
        ],
        "What is the range of black smoke concentration reduction observed in the robustness checks according to Figure 6?": [
            "→10–30 mcg/m3"
        ],
        "By what year were over 1,000 SCAs introduced in English CBs according to the 1956 Clean Air Act section?": [
            "1973"
        ],
        "According to Fukushima (2021), what is pollution linked to that may affect the survival rates in non-SCAs?": [
            "infant mortality and foetal loss"
        ]
    },
    "Outlier Detection with Cluster Catch Digraphs": {
        "Who first recognized the existence of substantial deviations from commonly occurring phenomena in nature?": [
            "Francis Bacon"
        ],
        "What becomes challenging in higher dimensions according to the section on the importance of outlier detection?": [
            "virtual inspection"
        ],
        "What statistical method is suggested to avoid masking and swamping that involves calculating the deviation about the median?": [
            "MAD"
        ],
        "What does the abbreviation UN-CCDs stand for in the context of the paper?": [
            "Uniformity- and Neighbor-based CCDs"
        ],
        "Which algorithm assumes that outliers have a substantially lower in-degree in a kNN graph according to Hautamaki et al.?": [
            "ODIN"
        ],
        "What metric does the Local Outlier Factor (LOF) method use to compute a point's local outlyingness?": [
            "local reachability density"
        ],
        "What type of clustering method does the k-means algorithm belong to?": [
            "partitional"
        ],
        "What method constructs a minimal spanning tree to form clusters and outliers in hierarchical clustering?": [
            "MST method"
        ],
        "What does BA stand for in the context of evaluation metrics for outlier detection algorithms?": [
            "Balanced Accuracy"
        ],
        "What statistic is used to determine the optimal radius of each covering ball in CCDs?": [
            "KS-based statistic"
        ],
        "What does the UN-MCCD algorithm specifically tailor for?": [
            "outlier detection"
        ],
        "What does the acronym MCG stand for in the context of the paper's section 3.2?": [
            "Mutual Catch Graphs"
        ],
        "What is the vertex set V(X↓) equal to in step 8 of Algorithm 1 in the Density-based Mutual Catch Graph (D-MCG) Algorithm?": [
            "X↓"
        ],
        "In the D-MCG algorithm, what parameter is adjusted through simulation?": [
            "ω"
        ],
        "What algorithm is proposed as a faster alternative to the U-MCCD algorithm?": [
            "RU-MCCD"
        ],
        "What is the maximum dimensionality (d) for which the F2-scores exceed 0.9 in the RU-MCCD algorithm's performance on simulated datasets?": [
            "10"
        ],
        "What type of distribution leads to smaller dominating covering balls in the M-CCD algorithm?": [
            "Gaussian"
        ],
        "What parameter is introduced to ensure a point set is considered a valid cluster in the optimal number of clusters determination?": [
            "Smin"
        ],
        "What color represents the outliers in the synthetic data set visualization in Figure 4(a) of the SU-MCCD algorithm?": [
            "red"
        ],
        "What is the minimum cluster size (Smin) set to in the evaluation of the SU-MCCD algorithm in Section 5?": [
            "half"
        ],
        "What is the standard deviation of the mean Nearest Neighbor Distance (μd) under Complete Spatial Randomness (CSR) for d=2, as shown by Clark and Evans?": [
            "0.26136"
        ],
        "What statistical measures are considered simultaneously in the SR-MCT according to the Mutual Catch Graph section?": [
            "median and mean"
        ],
        "What does the UN-CCD Clustering Algorithm output for dataset X?": [
            "Cluster centers"
        ],
        "What type of CCDs are used for clustering in the UN-MCCD algorithm according to line 1 of Algorithm 2?": [
            "UN-CCDs"
        ],
        "How many covering balls are there in total according to the section on \"Radii of the covering balls\"?": [
            "n"
        ],
        "What is the fixed proportion of outliers in the simulated data sets?": [
            "5%"
        ],
        "What is the lowest True Positive Rate (TPR) observed for the UN-MCCD algorithm when d = 2 and n = 1000?": [
            "0.930"
        ],
        "What is the F2-score of SUN-MCCDs when the data set size is 1000?": [
            "0.996"
        ],
        "How many data sizes are presented in Figure 8 for the performance measures of the algorithms?": [
            "2"
        ],
        "What is the TNR of the RU-MCCD algorithm when n = 100 and d = 3?": [
            "0.880"
        ],
        "At what dimensionality value does the SUN-MCCD algorithm start to substantially outperform the SU-MCCD algorithm?": [
            "5"
        ],
        "What is the fixed distance between the cluster centers and the outliers in the simulations?": [
            "2 units"
        ],
        "How many clusters are examined in the simulations to assess the performance of CCD-based outlier detection algorithms?": [
            "2 to 5"
        ],
        "How many dimensions were the simulated datasets when d equals 3?": [
            "3"
        ],
        "How many clusters have their centers defined when d = 10 and μ4 is involved?": [
            "Four"
        ],
        "What is the TPR of RU-MCCDs (d = 3) with 5 uniform clusters?": [
            "0.989"
        ],
        "What is the highest TNR value for SU-MCCDs with 5 clusters according to Table 8?": [
            "0.947"
        ],
        "What is the TPR of the SUN-MCCD algorithm at a 15% contamination level when d = 3?": [
            "0.973"
        ],
        "What minimal distance between outliers and cluster centers is investigated in the first simulation for Section 5.2.3?": [
            "1.25"
        ],
        "What is the F2-score of SU-MCCDs with 15% outliers according to Table 13?": [
            "0.939"
        ],
        "What is the F-score for SU-MCCDs at a distance of 1.5?": [
            "0.788"
        ],
        "What is the minimal distance between outliers and cluster centers in sub-figure (e) of Figure 16?": [
            "2.25"
        ],
        "What is the F2-score for SUN-MCCDs with a minimal distance of 1.75?": [
            "0.865"
        ],
        "Which algorithms exhibit stable behavior regardless of cluster distances in the CCD-based outlier detection?": [
            "SU-MCCD and SUN-MCCD"
        ],
        "What is the highest noise level tested in the simulations with Gaussian clusters as mentioned in Section 5.2.5?": [
            "10%"
        ],
        "What is the TNR of the RU-MCCD algorithm when the distance between cluster centers is 3?": [
            "0.835"
        ],
        "What is the radius of the hypersphere where outliers are generated for the study in Section 5.2.6?": [
            "1"
        ],
        "What metric is used to summarize the performance of the CCD-based algorithms for d = 10 in Figure 21?": [
            "BAs"
        ],
        "What is the TNR for SUN-MCCDs with d = 10 at a 5% level of noise?": [
            "0.948"
        ],
        "What is the \\( F^2 \\)-score for SUN-MCCDs at a noise level of 7%?": [
            "0.859"
        ],
        "What parameter is used to indicate the intensity in a Neyman-Scott cluster process?": [
            "↼"
        ],
        "What shape does the kernel of the Matérn cluster process represent?": [
            "unit disc"
        ],
        "What is the radius of the Thomas cluster process denoted as ϖ T in the paper?": [
            "0.07"
        ],
        "What is the minimum number of nearest neighbors used as an input parameter for LOF in the experiments?": [
            "11"
        ],
        "How many repetitions were used to summarize the performance of each outlier detection algorithm?": [
            "1000"
        ],
        "What is the True Positive Rate (TPR) threshold that LOF exceeds under most simulation settings?": [
            "0.95"
        ],
        "What is the F2-score of iForest when d = 20 under the Thomas cluster process?": [
            "0.774"
        ],
        "What is the TNR of the LOF algorithm when d = 20 under a mixed cluster process?": [
            "0.857"
        ],
        "Which robust alternative method is employed for feature normalization in real data examples?": [
            "Med and MADN"
        ],
        "What is the F2-score of the iForest algorithm on the ecoli data set?": [
            "0.652"
        ]
    },
    "Adaptive Selection of Sampling-Reconstruction in Fourier Compressed Sensing": {
        "What field has compressed sensing revolutionized by allowing the reconstruction of high-quality images from fewer measurements?": [
            "image acquisition"
        ],
        "What symbol denotes componentwise multiplication in the adaptive selection of sampling-reconstruction (H1.5, c)?": [
            "⊙"
        ],
        "Which method in the paper is described as not being adaptive to each data point?": [
            "H1"
        ],
        "What is the average gain in SSIM for facial image restoration using the proposed adaptive selection in the paper?": [
            "0.04"
        ],
        "What is the fundamental limitation of H1 in joint optimization of sampling-reconstruction?": [
            "not adaptive"
        ],
        "What type of network did study [29] use for adaptive sampling in CS-MRI?": [
            "cGAN"
        ],
        "What is improved by adaptive selection according to Theorem 1 in the paper?": [
            "true risk"
        ],
        "What is used as a HF uncertainty quantifier in Fourier CS according to the provided section of the paper?": [
            "SR space generation model"
        ],
        "What default value is used for the number of sampling-reconstruction pairs J in the discussed model?": [
            "J = 3"
        ],
        "What does the simplified version of Proposition 1 claim to maximize?": [
            "PSNR"
        ],
        "What is quantified in section (3) of the paper?": [
            "Bayesian uncertainty"
        ],
        "What color is used to highlight the Bayesian uncertainty in Figure 2 of the paper?": [
            "magenta"
        ],
        "What algorithm is used to initialize cluster centers in the given section of the paper?": [
            "k-means++"
        ],
        "What type of sampling is used to generate Mj in the adaptive selection method described in Section 3?": [
            "rejection sampling"
        ],
        "What architecture was used in the reconstruction network for Fourier compressed sensing on the CelebA dataset?": [
            "U-Net"
        ],
        "What dataset is used for the acceleration rate 4× comparison in Figure 4?": [
            "fastMRI dataset"
        ],
        "Which reconstruction method achieved the highest PSNR at a rate of 4× according to Table 3?": [
            "Sorted-Self"
        ],
        "At what value of J does the SSIM reach a plateau in the CS-MRI 1D 8× experiment?": [
            "2"
        ],
        "Which sampling method resulted in a higher SSIM value for 2D 4× in CS-MRI J = 3?": [
            "Rejection sampling"
        ],
        "What metric improved in the Fourier CS experiments using the proposed method?": [
            "SSIM"
        ]
    }
}